{
   "nodes" : {
      "comment/16" : {
         "id" : "comment/16",
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] I agree with you Stephan “There’s great consensus that the first project of the FTI, the jrnl, should be a WordPress [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/08/26/bootstrapping-wordpress/",
            "creator_name" : "Bootstrapping WordPress &#8211; jrnl",
            "date" : "2018-08-26 19:12:45",
            "date_gmt" : "2018-08-26 19:12:45"
         },
         "title" : "Bootstrapping...: [&#8230;] I agree with you Stephan “There’s..."
      },
      "post/5" : {
         "title" : "This is a test post",
         "data" : {
            "guid" : "http://wp.doug/?page_id=5",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-19 10:12:59",
            "mime_type" : "",
            "date_gmt" : "2018-09-19 10:12:59",
            "date" : "2018-09-19 10:12:59",
            "name" : "this-is-a-test-post",
            "modified" : "2018-09-19 10:12:59",
            "html" : "Hello I'm the first paragraph. And I'm the 2nd sentence.\r\n\r\nThe grammar is not the point, thankfully."
         },
         "type" : "page",
         "id" : "post/5"
      },
      "term/24" : {
         "type" : "category",
         "title" : "Commenting",
         "data" : {
            "count" : "0",
            "description" : "Threading of comments so that they can appear under the parent post, via the author etc.",
            "slug" : "reading2ccomment"
         },
         "id" : "term/24"
      },
      "comment/40" : {
         "id" : "comment/40",
         "data" : {
            "html" : "Thanks for having me!",
            "creator_name" : "Teodora Petkova",
            "creator_url" : "",
            "date_gmt" : "2018-09-18 12:39:36",
            "date" : "2018-09-18 12:39:36"
         },
         "title" : "Teodora Petkova: Thanks for having me!",
         "type" : "comment"
      },
      "term/42" : {
         "type" : "post_tag",
         "data" : {
            "slug" : "publishing",
            "description" : "",
            "count" : "2"
         },
         "title" : "publishing",
         "id" : "term/42"
      },
      "post/49" : {
         "title" : "Re: Friday",
         "data" : {
            "modified" : "2018-08-22 12:37:02",
            "name" : "re-friday",
            "html" : "<p style=\"text-align:justify\">Today, <a href=\"https://jrnl.global/2018/08/21/frode-hegland\">Frode Hegland</a> officially confirmed the first meeting of the <a href=\"https://www.futureoftext.org/institute.html\">Future of Text Institute</a> on the 2018-08-24. With that I received a mail from him, to which I was asked to reply, so I try to do it here.</p>\n\n<p style=\"text-align:justify\">The meeting will introduce the “jrnl” software project, an attempt to make a more Engelbartian blog system, likely the first major topic for the FTI. As it became possible to study Douglas Engelbart’s ARC Journal in more detail, it looks like NLS and Journal are quite distinct and relatively independent from each other, which allows for both to be investigated and recreated as a capability separately. If we would want to start to build a pretty Engelbartian Journal system, that isn’t too difficult any more because Doug didn’t do too difficult things 50 years ago in terms of the (initial) ARC Journal.</p>\n\n<p style=\"text-align:justify\">The project name “jrnl”, is that a generic work title or supposed to be the name for a specific result/product, how many different jrnl implementations will be permitted, what about variants that don’t comply with the official list of requirements that such a system should fulfill (and be it on the level of profiles), is it a trademark and who owns it? One option would be to just build prototypes/experiments until they evolve into something useful, under a loose, vague working title, as the details what the name means will remain questionable for some time anyway.</p>\n\n<p style=\"text-align:justify\">Frode asked for specific suggestions and criteria. While there are always plenty of things to suggest (won’t that be an important work of the FTI, to discuss all the things in detail?), I would like to put one initial criterion forward: the demand that all software and content must be libre-licensed, namely <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3</a> + any later version of the license for software (<a href=\"https://www.youtube.com/watch?v=ASJ6V4AbW1I\">context</a>) and maybe for content as well, with the additional option to also license content under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a> (<a href=\"https://www.youtube.com/watch?v=eginMQBWII4\">context</a>) as this will kill it for most people right there, but without such an agreement, we can never arrive at the common infrastructure and universal library, it would conflict with the very nature of digital and therefore not worth it, why waste valuable, rare, precious lifetime for another effort based on a terribly obsolete model? Now, an institute can have many departments, but proprietary, restricted stuff won’t go on in mine as it’s by far the most significant reason for the informational and cultural misery we’re in for more than a century already, and an attempt to improve it must never fall back into the mechanics that only apply to physical scarcity. If we fail to see the vision of a truly digital future, I would wonder what we’re even doing here.</p>\n\n<p style=\"text-align:justify\">Another question was if I think that this endeavor is fundable. I’m convinced that nothing related to text is fundable in 2018, people even refuse gratis contributions and the very own field hardly could care less. Furthermore, if there would be money, that would lead to even larger problems.</p>\n\n<p style=\"text-align:justify\">The e-mail included a reference to the Journal project page with things on it I like and others I’m just going to ignore, like “linking into e-books” or “rich PDF”. It’s beyond me how those notions can even exist after all that happened in those spaces. Anyhow, the FTI project moves towards a good general direction, it hopefully might gain some constructive traction on the Friday 24th call.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "date_gmt" : "2018-08-22 12:37:02",
            "date" : "2018-08-22 12:37:02",
            "modified_gmt" : "2018-08-22 12:37:02",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=49",
            "excerpt" : ""
         },
         "type" : "post",
         "id" : "post/49"
      },
      "comment/19" : {
         "type" : "comment",
         "data" : {
            "date_gmt" : "2018-08-26 12:33:03",
            "date" : "2018-08-26 12:33:03",
            "creator_url" : "https://skreutzer.de/2018/08/26/personal-hypertext-report-6/",
            "creator_name" : "Personal Hypertext Report #6 &#8211; skreutzer’s Blog",
            "html" : "[&#8230;] by curation without having negative effects on what WordPress generates for the web: In the biography post about Teodora Petkova, there was a single, lone &amp;nbsp; on the last line, and that broke my XML processing of the post [&#8230;]"
         },
         "title" : "Personal Hype...: [&#8230;] by curation without having negative e...",
         "id" : "comment/19"
      },
      "post/66" : {
         "type" : "post",
         "title" : "Personal Hypertext Report #6",
         "data" : {
            "html" : "<details>\n  <summary>Stephan Kreutzer doesn’t want to work on a WordPress enhancement: the current posts on the default installation broke XML processing by a non-browser client because of a named DTD entity and bugs in WordPress’ <code>wpautop()</code> function – both unnecessary problems caused by the general web context, too expensive to fix and difficult to work with.</summary>\n</details>\n<p style=\"text-align:justify;\">There’s great consensus that the first project, the jrnl, should be a WordPress enhancement project. I’m happy with that as a good practical compromise for bootstrapping ourselves: it’s readily available and many people know how to set it up and/or use it, it’s libre-freely licensed (not ideal though, <a href=\"https://www.gnu.org/philosophy/who-does-that-server-really-serve.en.html\">GPLv2 makes no sense for software that is run over a network</a>, the software should be licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a>, but they probably lack a way to update the license or can’t do that for social reasons), it tends to be an “open”, friendly actor of the open web and it has a usage share of the total of all websites that makes it likely that I encounter such legacy web content I want to work with, I wouldn’t want to lose those entirely. For our group, we need something to capture our discussions, otherwise we would lose some of our own history. Doug Engelbart, at the time he didn’t have the NLS yet, printed his proposals on paper, which is good enough to communicate the idea and get the project going, as these documents can be imported into the very system they describe, but it’s not that we need to wait for the perfect tool in order to allow ourselves to talk about the design of such perfect tool. The conversation about this topic is more important than the costs of doing it wrong. It’s part of bootstrapping really to improve on what’s already around, because if we would re-invent everything starting from digital electronics over networking infrastructure to software architecture and graphical rendering engines, we would never get anywhere in regard to our end goals, so the improvement process must happen from within – adjusting, enhancing, replacing piece by piece for an exponentially enabling overall progress.</p>\n\n<p style=\"text-align:justify;\">What I personally plan to do however won’t contribute much to a WordPress enhancement because WordPress for all its benefits also comes with many problems as it happens to follow the web model. The web wasn’t designed as a hypertext capability infrastructure, but as a document accessing scheme that developed into a fully blown programming framework for online software. It has never been much concerned about the needs of text, which becomes all too apparent for the otherwise perfectly reasonable things it cannot do. Changing that within the web paradigm would be unbelievably expensive for socio-political reasons and the required money/time investment, so I just might play devil’s advocate for client components that aren’t browsers and don’t care much about what servers do for the web by building my own little system that solves the problems I still remain to have when it comes to reading, writing and publishing. That can either lead to wonderful interplay with WordPress enhancements or to great conflicts depending on the technical specifics of implementation and design. In any case, it’s a worthwile research endeavor that promises directly usable results in the larger context, no matter how all the other parts behave, being the independent, potentially non-cooperating entities on the network they are.</p>\n\n<p style=\"text-align:justify;\">The first thing I tried as a simple test was to automatically download the existing posts on <a href=\"https://jrnl.global\">jrnl.global</a> with my <a href=\"https://www.bitchute.com/video/agkvwxYtL6YD\"><code>wordpress_retriever_1</code> workflow</a>. I encountered two minor issues that were easily solvable by curation without having negative effects on what WordPress generates for the web: In the <a href=\"https://jrnl.global/2018/08/22/teodora-petkova\">biography post about Teodora Petkova</a>, there was a single, lone <code>&amp;nbsp;</code> on the last line, and that broke my XML processing of the post data as retrieved via the JSON API. XML does not come with a lot of DTD entities except those to escape its own special characters and therefore is unaware of HTML’s legacy DTD entity declarations. They’re usually not really needed because characters should just be encoded in the file with the encoding clearly stated in the <a href=\"https://en.wikipedia.org/wiki/XHTML#XML_declaration\">XML declaration</a> or <a href=\"https://en.wikipedia.org/wiki/Processing_Instruction\">processing instruction</a>. I agree that it might be sometimes favorable to explicitly use escaping for special characters, especially the non-printable ones that can be hard to read and write in standard text editors, but then <a href=\"https://www.w3.org/TR/REC-xml/#dt-charref\">XML supports the encoding of Unicode characters</a> in the form of <code>&amp;#xA0;</code> (hexadecimal). My parsers generally still lack the ability to translate these Unicode escape codes to the actual character (with the additional difficulty to never break encoding through the entire processing pipeline), but that needs to be added anyway eventually, with the XML tools probably already being fine. The old HTML entities for encoding special characters is really a legacy remnant of DTDs, and while DTD declarations at the beginning of HTML file might arguably help with identifying the HTML version (especially a huge problem with “versionless”, “living” and therefore bad HTML5), they also cause a lot of trouble for processing XHTML with a XML processor (which is just great, but was abandoned by the web and browser people for questionable reasons): DTDs can include other DTDs, each of which can theoretically contain entity declarations, so an generic, vocabulary-agnostic, XHTML-unaware XML processor needs to load/read all involved DTDs in order to find out how entities need to be replaced for text output, which entity names are defined and which aren’t (the latter will cause the processor to fail). Now, the DTDs define the HTML vocabulary or specialized format based on the generic XML format convention, which is published as a standard by the W3C and needs an unique identifier to be disambiguated from other standards and versions, otherwise the whole vocabulary would be ambiguous and of no help for processors to interpret its meaning correctly. So if the W3C needs an identifier, ideally globally unique (which implies a central name registry), what do you think they would use, especially back in the day? An URL of course! Act two: imagine you write  a generic XML parser library and you encounter a DTD declaration, while your library is also going to parse DTDs and allow DTD validation (for proper, but separate HTML support) eventually, and lack the time or knowledge to do a particular good job with the first release of the implementation? It might even be legal constraints as the DTD files by the W3C have some almost non-free restrictions or the question why a generic XML parser library should come with W3C DTDs if some users will never parse any XHTML ever – what happens a lot of times, as the unique identifier looks like and is an URL and the referenced, needed DTDs are not locally available, these parsers send out HTTP <code>GET</code> requests for the initial DTD, which then references several other DTDs internally, and then sometimes the received results (if any) might not get saved (because why would you and how, for small, ad-hoc, generic XML parsers?). There are probably plenty of web crawlers and bots and client implementations that try to obtain a resource from the web and then read it in for further processing with a normal XML tool, and in a distributed network, this causes quite some <a href=\"https://www.w3.org/blog/systeam/2008/02/08/w3c_s_excessive_dtd_traffic\">excessive traffic for the W3C server</a>. So what did the W3C do in response? They throttle so serve the response of course! So imagine yourself, being an unsuspecting user of such an XML library, trying to parse in some nice XHTML, just to observe that your program execution stalls. Is it a bug, an endless loop? You might enter a debugging session but can’t find out a lot. Lucky you if you go to get you a coffee eventually while leaving the parser running instead of giving up the plan entirely, to be surprised when coming back that miraculously the XHTML input somehow did get parsed. That’s likely because the artificial delay at the W3C server has expired – to then serve the requested DTD(s)! To treat the identifier as resolvable instead of an abstract one is the root cause of this problem, delivering the DTDs encourages such behavior, and additionally, the delay might lead to the impression that XHTML/XML parsing is very, very slow. But what else can you do? Not serving the DTDs would leave HTML entities unresolvable and the XML would fail to parse. If parsers/processors don’t have the DTDs and can’t get them, all of XHTML would be unreadable, which would be a grim option for the whole XML/XHTML/semantic effort. But can XHTML demand special handling from all generic XML parsers out there? Of course not, the whole point of XHTML is to make it universally available just as all the other XML vocabularies. Therefore, still having the DTD declaration and named entities in XHTML for backward compatibility with crappy HTML4 while not advancing to XHTML2 (HTML5 removed the DTD and with that, XHTML5 doesn’t have one either, but as rubbish HTML5/XHTML5 is the one without version as a “living standard” indistinguishable from a potentially upcoming HTML6/XHTML6 except for heuristic analysis, a HTML5 DTD would have been better than no version indication at all) is a historical tragedy that renders even the best, well-formed, valid portions of the web hard to use for some of our machinery, completely unnecessarily. For my tools, I install a catalog of the DTDs that I included in the download, so all DTD identifiers can be resolved to the local copy, but that’s not an option for my own primitive <a href=\"https://en.wikipedia.org/wiki/StAX\">StAX parser</a> in <a href=\"https://gitlab.com/publishing-systems/CppStAX\">C++</a> or its sloppy <a href=\"https://gitlab.com/publishing-systems/JsStAX\">JavaScript port</a> (deliberate lack of XML tools in browsers is unbelievably ironic and a big loss of potential). XML parsers of the big programming frameworks usually also have a DTD parser on board and just need the W3C DTDs from somewhere, ideally delivered as a local resource with me resolving the ID to the local file in the catalog. These catalogs could be adjusted to not resolve to the actual W3C DTD for mere parsing (we’re not doing DTD validation here, do we?), but to a pseudo DTD that contains nothing than the named entity declarations and omit all references to any of the other DTDs. For the custom, small StAX parser, I think I’ll add a mechanism that instructs the parser to first read a XML file that lists named entity names and their intended textual replacement, so it can continue with the real input file and recognize all entities that were configured this way in advance. And all of this needs to happen in preparation to handle a single <code>&amp;nbsp;</code> that hasn’t have any effect to the visual appearance anyway. Pragmatically, I just removed it from the blog post for now, I think it won’t be missed.</p>\n\n<p style=\"text-align:justify;\">Something else broke the parsing of the <a href=\"https://jrnl.global/2018/08/21/jrnl-launch-meeting-announcement-for-friday-24th-of-august-2018\">jrnl launch meeting announcement (for Friday 24th of August 2018)</a> post: welcome to the <a href=\"https://codex.wordpress.org/Function_Reference/wpautop\"><code>wpautop()</code> function of WordPress</a>! “autop” stands for “auto paragraph” and replaces two consecutive line breaks with XHTML <code>&lt;p&gt;</code> tags. In the process, for XML/XHTML well-formedness as the very minimum of standard compliance, it has to find the beginning of the previous paragraph and the end of the paragraph that follows. It also must respect other encapsulating tags as tags are in hierarchical structure and aren’t allowed to overlap. For some reason, autop is notoriously error-prone. Have a look at the issue tracker: there’s <a href=\"https://core.trac.wordpress.org/ticket/103\">#103</a>, <a href=\"https://core.trac.wordpress.org/ticket/488\">#488</a>, <a href=\"https://core.trac.wordpress.org/ticket/2259\">#2259</a>, <a href=\"https://core.trac.wordpress.org/ticket/2691\">#2691</a>, <a href=\"https://core.trac.wordpress.org/ticket/2813\">#2813</a>, <a href=\"https://core.trac.wordpress.org/ticket/2833\">#2833</a>, <a href=\"https://core.trac.wordpress.org/ticket/3007\">#3007</a>, <a href=\"https://core.trac.wordpress.org/ticket/3362\">#3362</a>, <a href=\"https://core.trac.wordpress.org/ticket/3621\">#3621</a>, <a href=\"https://core.trac.wordpress.org/ticket/3669\">#3669</a>, <a href=\"https://core.trac.wordpress.org/ticket/3833\">#3833</a>, <a href=\"https://core.trac.wordpress.org/ticket/3935\">#3935</a>, <a href=\"https://core.trac.wordpress.org/ticket/4857\">#4857</a>, <a href=\"https://core.trac.wordpress.org/ticket/7511\">#7511</a>, <a href=\"https://core.trac.wordpress.org/ticket/9744\">#9744</a>, <a href=\"https://core.trac.wordpress.org/ticket/14674\">#14674</a>, <a href=\"https://core.trac.wordpress.org/ticket/27350\">#27350</a>, <a href=\"https://core.trac.wordpress.org/ticket/27733\">#27733</a>, <a href=\"https://core.trac.wordpress.org/ticket/28762\">#28763</a>, <a href=\"https://core.trac.wordpress.org/ticket/33466\">#33466</a>, <a href=\"https://core.trac.wordpress.org/ticket/33834\">#33834</a>, <a href=\"https://core.trac.wordpress.org/ticket/38656\">#38656</a>, <a href=\"https://core.trac.wordpress.org/ticket/39377\">#39377</a>, <a href=\"https://core.trac.wordpress.org/ticket/40135\">#40135</a>, <a href=\"https://core.trac.wordpress.org/ticket/40603\">#40603</a>, <a href=\"https://core.trac.wordpress.org/ticket/42748\">#42748</a>, <a href=\"https://core.trac.wordpress.org/ticket/43387\">#43387</a>. The fact that regex is involved explains part of this mess. WordPress recognizes that plain text linebreaks are considered harmful when they’re typed to convey semantic meaning, and as the application is managing output for the web in (X)HTML, whitespace like linebreaks doesn’t encode meaning, it usually gets entirely ignored in the visual rendering and instead formats the source code for better readability. If the plain text editor of WordPress is used, autop should not be applied onto the text whatsoever because it can be expected that the user will directly input XHTML. The visual editor should create a a new <code>&lt;p&gt;</code>-pair with the cursor right within it – any subsequent enter key press in an empty paragraph should have no effect (but then people will start to enter spaces into the empty paragraphs to force their way to vertical spacing for layout/typesetting, so a whitespace check needs to be performed). An actual plain text editor variant should XML-escape all angle brackets as mixing different formats and encodings is always a bad idea. Here we’re already losing WordPress as a decent writing and publishing tool, that’s with the out-of-the-box default configuration and no plugins or themes installed yet to interfere with the content even more. The <code>div</code>s with the <code>ApplePlainTextBody</code> class seem to be of other origin, also being pretty useless as the CSS class doesn’t seem to exist and doesn’t help as a mechanism to derive semantic meaning. There’s even an empty one of those <code>div</code>s, so I just removed all of them and that also caused autop to not fail for what otherwise was perfectly valid XHTML.</p>\n\n<p style=\"text-align:justify;\">“Enhancement” can mean different things, “WordPress enhancement” means using WordPress as the basis for the enhancement, but then “WordPress” can be looked at from different perspectives. The web perspective isn’t one I personally consider much because I precisely want to get rid of the limitations that are associated with it, plus it would be too expensive for me to invest into fixing all the problems that exist with the current implementations/paradigm against the resistance of those who are in actively favor of them or simply don’t care.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "name" : "personal-hypertext-report-6",
            "modified" : "2018-08-26 04:06:57",
            "date" : "2018-08-26 04:06:57",
            "date_gmt" : "2018-08-26 04:06:57",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-08-26 04:06:57",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=66"
         },
         "id" : "post/66"
      },
      "term/50" : {
         "id" : "term/50",
         "type" : "post_tag",
         "data" : {
            "description" : "",
            "slug" : "foo",
            "count" : "1"
         },
         "title" : "foo"
      },
      "post/173" : {
         "type" : "post",
         "data" : {
            "guid" : "https://jrnl.global/?p=173",
            "excerpt" : "",
            "modified_gmt" : "2018-09-09 13:38:06",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "date" : "2018-09-09 13:38:06",
            "date_gmt" : "2018-09-09 13:38:06",
            "modified" : "2018-09-09 13:38:06",
            "name" : "visual-syntactic-text-formatting",
            "html" : "Visual Syntactic Text Formatting is one of the ViewSpec we are considering.\n<div class=\"page\" title=\"Page 1\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n\nAs originally developed by Mark Warschauer, University of California, Irvine markw@uci.edu, Youngmin Park, University of California, Irvine and Randall Walker, Mayo Clinic: <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=3&amp;ved=2ahUKEwi5rsbdjLDdAhULDMAKHY7ZDRoQFjACegQIBxAC&amp;url=http%3A%2F%2Fwww.liveink.com%2FIPCC%25202007%2520VSTF%2520Research%2520Paper.pdf&amp;usg=AOvVaw1vuDLG6vpW_5UUYpKt2dvP\">Visual-Syntactic Text Formatting - Live Ink</a>\n\nI have implemented is a simplified version in Liquid | Flow, as can be seen in these two different lengths, taking a paragraph from Doug Engelbart's 1962 paper, some tweaking as to what rules should be used can be useful, both live and pre-set:\n\n</div>\n</div>\n</div>\n\n[caption id=\"attachment_174\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-09-at-14.33.48.png\"><img class=\"wp-image-174 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-09-at-14.33.48-700x796.png\" alt=\"\" width=\"700\" height=\"796\" /></a> Visual Syntactic Text Formatting[/caption]"
         },
         "title" : "Visual Syntactic Text Formatting",
         "id" : "post/173"
      },
      "user/6" : {
         "type" : "user",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/5f1be69c9e03b14c92ecf899775dbf30"
         },
         "title" : "Gyuri Lajos",
         "id" : "user/6"
      },
      "user/5" : {
         "title" : "Teodora Petkova",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/904a1fc22020acceb38b0eeab7328794"
         },
         "type" : "user",
         "id" : "user/5"
      },
      "post/33" : {
         "id" : "post/33",
         "title" : "RFC: Glossary Data Formats",
         "data" : {
            "date_gmt" : "2018-08-21 17:01:59",
            "date" : "2018-08-21 17:01:59",
            "html" : "<div>\n<h2>First stage</h2>\n<p style=\"text-align: justify\">\n        For now, we can use the following format to specify glossary entries for the Journal:\n      </p>\n<pre>&lt;dl&gt;\n  &lt;dt&gt;Media Fragment&lt;/dt&gt;\n  &lt;dt&gt;Media Fragments&lt;/dt&gt;\n  &lt;dd&gt;Paragraphs, datasets, images, topic maps, glossaries… that go into forming one or more document(s).&lt;/dd&gt;\n  &lt;dd&gt;This glossary entry is a media fragment, and each of its parts could be as well.&lt;/dd&gt;\n&lt;/dl&gt;</pre>\n<p style=\"text-align: justify\">\n        As the Journal is currently stored in WordPress, we might use its data model to some extend, but will abandon that more and more by abusing it as generic online data storage, where any arbitrary data is stored in the content-body of a blog post. This will render all plugins, themes and administrative tools on the server useless and might even break the HTML that gets generated for the web, so users in a browser won’t be able to see something reasonable any more if they visit the URL. The views rendered by a server are irrelevant anyway, as the client can’t rely on this external entity to cooperate on ViewSpec operations, or even to be present/reachable at all.\n      </p>\n<p style=\"text-align: justify\">\n        After retrieval, a client is supposed to look into the content-body of a blog post, and if there’s a XHTML <code>&lt;dl&gt;</code> in there, this glossary definitions should be added to the glossary of the Journal, the latter consisting of all <code>&lt;dl&gt;</code>s found in all blog posts. Because of the semantic <code>&lt;dl&gt;</code> markup, we can ignore the explicit WordPress category that marks posts to be glossary entries, while on the other hand the entire Journal can’t have two separate glossaries at this first stage. There’s no need to require all glossary entries to be in a single <code>&lt;dl&gt;</code> in a single post, or to demand that every post containing a <code>&lt;dl&gt;</code> isn’t allowed to contain more than one definition. One post could contain more than one <code>&lt;dl&gt;</code>, but this is certainly not encouraged. There are no recommendations on what to do with other data found in a post content-body outside of <code>&lt;dl&gt;</code>. Clients are free to ignore it, as it is expected that different types of data will be stored separately instead of being embedded in big collections, so clients get a choice to explicitly only retrieve the data that’s of interest to them, by avoiding the need to extract relevant data from mixed media fragments in complex ways. It is expected that on the client side, the glossary data will get applied onto other, independent media fragments in the process of building the document.\n      </p>\n<p style=\"text-align: justify\">\n        At the first stage, XHTML’s <code>&lt;dl&gt;</code> supports multiple terms and multiple definitions for each glossary entry. If I understand correctly, all consecutive <code>&lt;dt&gt;</code>s are alternatives (synonyms, abbreviations, plurals, languages even?) to each other until the first <code>&lt;dd&gt;</code> is encountered, of which there might be several to express different definitions (different in meaning, not highlighting different aspects of the same meaning) for the same term(s). Clients are expected to associate the term(s) and description(s) with some logic of their own, as XHTML doesn’t provide explicit grouping unfortunately. Within the <code>&lt;dt&gt;</code>s and <code>&lt;dd&gt;</code>s, other semantics aren’t supported nor encouraged, clients are free to ignore such markup, but they must interpret all text nodes inside the unsupported markup as belonging to the text of the term or definition. Clients are allowed to interpret other valid XHTML if found in a <code>&lt;dt&gt;</code> or <code>&lt;dd&gt;</code> if they can and want, but they can never expect an implicitly granted meaning on the Journal, nor will there be a stage in the future which will include unrelated XHTML elements via this backdoor into glossary definitions.\n      </p>\n<p style=\"text-align: justify\">\n        We look at <code>&lt;dl&gt;</code> as some kind of microformat serialized in XML, and as XML namespaces aren’t included in the first stage, the unambiguous meaning of this “magic” markup name is derived from the declaration that it has the XHTML meaning if this markup name is found in the data of the official location(s) and sources of the Journal. For now, definitions should be unique globally and not published at two separate places or as duplicates at the same place. If clients encounter a term that’s already in the local data storage, they’re free to ignore the newly retrieved definition, which includes all other term alternatives of the definition and all definition descriptions that are associated with the term in question, but not other definitions of the same <code>&lt;dl&gt;</code> that might provide new, previously unknown definitions.\n      </p>\n</div>\n<div>\n<h2>Second stage</h2>\n<pre>&lt;?ohs version=\"1.0\" format=\"xml\" encoding=\"UTF-8\"?&gt;\n&lt;dl xmlns=\"http://www.w3.org/1999/xhtml\"\n    xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n    rdf:about=\"ohsidentifierscheme:info.doug-50/journal/category/12?created=2018-02-11T23:42\"&gt;\n  &lt;dt&gt;Media Fragment&lt;/dt&gt;\n  &lt;dt&gt;Media Fragments&lt;/dt&gt;\n  &lt;dd&gt;Paragraphs, datasets, images, topic maps, glossaries… that go into forming one or more document(s).&lt;/dd&gt;\n  &lt;dd&gt;This glossary entry is a media fragment, and each of its parts could be as well.&lt;/dd&gt;\n&lt;/dl&gt;</pre>\n</div>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>. It was first published with the canonical URL <a href=\"http://doug-50.info/journal/2018/04/07/rfc-glossary-data-formats/\">http://doug-50.info/journal/2018/04/07/rfc-glossary-data-formats/</a>.</p>",
            "name" : "rfc-glossary-data-formats",
            "modified" : "2018-08-21 17:01:59",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=33",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-08-21 17:01:59"
         },
         "type" : "post"
      },
      "term/18" : {
         "id" : "term/18",
         "title" : "RFC",
         "data" : {
            "count" : "3",
            "slug" : "rfc",
            "description" : "Inspired by the class Request For Comment, this is where we post our technical decisions for reference and discussion."
         },
         "type" : "category"
      },
      "comment/12" : {
         "title" : "Christopher G...: Some more thoughts:\n- How does a \"smart/aware\" ...",
         "data" : {
            "html" : "Some more thoughts:\n- How does a \"smart/aware\" client take advantage of this information? By getting it when the document is viewed or can it get more information via an API mediated by the blog?\n- How does a dumb (HTML+Javascript) client take advantage of this information? At the most naive level, some javascript could detect the glossary, and the regions(s) of the page to apply it to the HTML for the benefit of the reader.\n\nA good example of something like this, that already exists, is Wikipedia. Wikipedia considers the first paragraph of a page the primary definition, so internal links have a nice ajax popup window giving that definition if you hover over them.",
            "date" : "2018-08-22 10:05:02",
            "date_gmt" : "2018-08-22 10:05:02",
            "creator_name" : "Christopher Gutteridge",
            "creator_url" : "http://blog.soton.ac.uk/webteam/"
         },
         "type" : "comment",
         "id" : "comment/12"
      },
      "post/389" : {
         "type" : "post",
         "data" : {
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=7",
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-08-21 14:05:02",
            "content_filtered" : "",
            "date_gmt" : "2018-08-21 14:05:02",
            "date" : "2018-08-21 14:05:02",
            "html" : "Hello!\n\nMy full name is Frode Alexander Hegland.\n\nMy personal site is <a href=\"http://www.frodehegland.com\">frodehegland.com</a>\n\nMy professional site is <a href=\"http://www.liquid.info\">www.liquid.info</a>",
            "name" : "frode-hegland",
            "modified" : "2018-08-21 14:05:02"
         },
         "title" : "Frode Hegland",
         "id" : "post/389"
      },
      "post/152" : {
         "id" : "post/152",
         "type" : "post",
         "title" : "Document ViewSpec",
         "data" : {
            "modified_gmt" : "2018-09-08 14:40:50",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=152",
            "excerpt" : "",
            "name" : "document-viewspec",
            "modified" : "2018-09-08 14:40:50",
            "html" : "A flexible view where the user can control the presentation of the article, including collapsing into outline modes, expanding into Flow mode, colour coding of key text and more.\n\nThis is a Doug Engelbart term.\n\nCited from <a href=\"http://www.dougengelbart.org/pubs/oad-2250.html#7a\">Authorship Provisions in Augment</a>\n\njrnl post Category: <a href=\"https://jrnl.global/category/richreadingviewspec/\">ViewSpecs</a>",
            "date" : "2018-09-08 14:40:50",
            "date_gmt" : "2018-09-08 14:40:50"
         }
      },
      "term/1" : {
         "id" : "term/1",
         "type" : "category",
         "title" : "Uncategorized",
         "data" : {
            "description" : "",
            "slug" : "uncategorized",
            "count" : "7"
         }
      },
      "post/349" : {
         "id" : "post/349",
         "title" : "Blue Dot",
         "data" : {
            "guid" : "https://jrnl.global/?p=349",
            "excerpt" : "",
            "modified_gmt" : "2018-10-10 15:38:54",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "date_gmt" : "2018-10-10 15:38:54",
            "date" : "2018-10-10 15:38:54",
            "modified" : "2018-10-10 15:38:54",
            "name" : "blue-dot",
            "html" : "We now have a designed blue dot menu here on jrnl.global with a rudimentary Flow function which the guys are going to improve and then put the code into Shane's repository at <a href=\"https://github.com/swalkergibson/blue-dot\">https://github.com/swalkergibson/blue-dot</a>"
         },
         "type" : "post"
      },
      "comment/26" : {
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] My Linked in Profile   will have to do for the moment along with this post here on Why Blogging Sucks [&#8230;]",
            "date" : "2018-10-08 06:50:25",
            "date_gmt" : "2018-10-08 06:50:25",
            "creator_url" : "https://jrnl.global/2018/10/08/gyuri-lajos/",
            "creator_name" : "Gyuri Lajos &#8211; jrnl"
         },
         "title" : "Gyuri Lajos &...: [&#8230;] My Linked in Profile   will have to...",
         "id" : "comment/26"
      },
      "post/7" : {
         "data" : {
            "excerpt" : "",
            "guid" : "http://wp.doug/?p=7",
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-26 11:53:49",
            "content_filtered" : "",
            "date_gmt" : "2018-09-19 10:13:44",
            "date" : "2018-09-19 10:13:44",
            "html" : "XXXX tum te tum",
            "modified" : "2018-10-26 11:53:49",
            "name" : "heres-yet-another-post"
         },
         "title" : "Here's yet another post",
         "type" : "post",
         "id" : "post/7"
      },
      "term/5" : {
         "id" : "term/5",
         "type" : "category",
         "data" : {
            "description" : "",
            "slug" : "demo-50",
            "count" : "0"
         },
         "title" : "Demo @ 50"
      },
      "post/353" : {
         "title" : "People",
         "data" : {
            "modified" : "2018-10-10 15:40:53",
            "name" : "people",
            "html" : "It would be great when typing in someone's name who is also a blogger, at least on the same blog, to have a quick and easy way to link them to their profile.",
            "date_gmt" : "2018-10-10 15:40:53",
            "date" : "2018-10-10 15:40:53",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-10 15:40:53",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=353",
            "excerpt" : ""
         },
         "type" : "post",
         "id" : "post/353"
      },
      "comment/31" : {
         "type" : "comment",
         "data" : {
            "html" : "I think your post highlights issues we need to deal with. I would so very much like to be able to comment inline, instead of separated, here. Anyway:\n\nYes, viewspec should be modular.\n\nYes, there may not be a date so this should be just one option for showing if the document has been superseded.\n\nClicking is assumed for the first version I think, but we must definitely look into other interactions for other devices.\n\nLots to discuss, but this dialogue itself is very worthwhile I think.",
            "date" : "2018-09-09 16:36:02",
            "date_gmt" : "2018-09-09 16:36:02",
            "creator_name" : "Frode Hegland",
            "creator_url" : "http://liquid.info"
         },
         "title" : "Frode Hegland: I think your post highlights issues we need to ...",
         "id" : "comment/31"
      },
      "comment/55" : {
         "id" : "comment/55",
         "title" : "Search Result...: [&#8230;] is what I was talking about during ou...",
         "data" : {
            "html" : "[&#8230;] is what I was talking about during our previous meeting. Simple search results for the user to find an article they wrote and quickly copy a link or as [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/10/19/search-results-theme-for-finding-own-articles-primarily/",
            "creator_name" : "Search Results Theme for finding own articles (primarily) &#8211; jrnl",
            "date_gmt" : "2018-10-19 11:00:00",
            "date" : "2018-10-19 11:00:00"
         },
         "type" : "comment"
      },
      "term/36" : {
         "data" : {
            "description" : "",
            "slug" : "future-of-text",
            "count" : "1"
         },
         "title" : "Future of Text",
         "type" : "post_tag",
         "id" : "term/36"
      },
      "comment/29" : {
         "id" : "comment/29",
         "title" : "Authoring Ver...: [&#8230;] are no lists of Categories here, they...",
         "data" : {
            "html" : "[&#8230;] are no lists of Categories here, they are for the Timeline [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/09/09/authoring-version-control/",
            "creator_name" : "Authoring Version Control &#8211; jrnl",
            "date_gmt" : "2018-09-09 13:12:13",
            "date" : "2018-09-09 13:12:13"
         },
         "type" : "comment"
      },
      "comment/7" : {
         "id" : "comment/7",
         "data" : {
            "html" : "[&#8230;] This is a reply to “jrnl launch meeting announcement (for Friday 24th of August 2018)”. [&#8230;]",
            "date_gmt" : "2018-08-22 12:37:48",
            "date" : "2018-08-22 12:37:48",
            "creator_name" : "Re: jrnl launch meeting announcement (for Friday 24th of August 2018) &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/08/22/re-jrnl-launch-meeting-announcement-for-friday-24th-of-august-2018/"
         },
         "title" : "Re: jrnl laun...: [&#8230;] This is a reply to “jrnl launch mee...",
         "type" : "comment"
      },
      "post/150" : {
         "id" : "post/150",
         "data" : {
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-08 14:36:10",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=150",
            "html" : "The ability for a link to be created which does not just link to the document but to a specific section within the document, such as a paragraph or a sentence, so that the reader can instantly jump to the cited section.\n\nThis is a high-resolution version of pages in physical documents and can be used for further interaction.\n\nRelated to the issue of pointing and addressing: <a href=\"http://wordpress.liquid.info/the-fine-art-of-addressing/\">http://wordpress.liquid.info/the-fine-art-of-addressing/</a>\n\nThis is a Doug Engelbart term.\n<p style=\"text-align: center;\">jrnl post Category: <a href=\"https://jrnl.global/category/highresolutionaddressability/\">High Resolution Addressability</a></p>",
            "name" : "high-resolution-addressability",
            "modified" : "2018-09-08 14:36:10",
            "date" : "2018-09-08 14:36:10",
            "date_gmt" : "2018-09-08 14:36:10"
         },
         "title" : "High Resolution Addressability",
         "type" : "post"
      },
      "comment/10" : {
         "data" : {
            "html" : "[&#8230;] else broke the parsing of the jrnl launch meeting announcement (for Friday 24th of August 2018) post: welcome to the wpautop() function of WordPress! “autop” stands for “auto paragraph” [&#8230;]",
            "date_gmt" : "2018-09-22 11:21:52",
            "date" : "2018-09-22 11:21:52",
            "creator_url" : "https://skreutzer.de/2018/08/26/personal-hypertext-report-6/",
            "creator_name" : "Personal Hypertext Report #6 &#8211; skreutzer’s Blog"
         },
         "title" : "Personal Hype...: [&#8230;] else broke the parsing of the jrnl la...",
         "type" : "comment",
         "id" : "comment/10"
      },
      "user/4" : {
         "title" : "skreutzer",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/e6b20462f3e31c5eb94c6b6572b5c3e4"
         },
         "type" : "user",
         "id" : "user/4"
      },
      "post/320" : {
         "id" : "post/320",
         "data" : {
            "guid" : "https://jrnl.global/?p=320",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-08 13:41:53",
            "mime_type" : "",
            "date_gmt" : "2018-10-08 13:41:53",
            "date" : "2018-10-08 13:41:53",
            "modified" : "2018-10-08 13:41:53",
            "name" : "initial-project-overview",
            "html" : "Overview of the project as designed before the <a href=\"https://jrnl.global/2018/10/07/agenda-chris-shane/\">call</a> on the 8th of October 2018.\n\nOur meeting today will be to agree on a flow, such as this, then how to architect it and who will take ownership of the different aspects of the work.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-08-at-14.39.56.png\"><img class=\"aligncenter size-full wp-image-322\" src=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-08-at-14.39.56.png\" alt=\"\" width=\"2630\" height=\"1380\" /></a>"
         },
         "title" : "Initial Project Overview",
         "type" : "post"
      },
      "term/47" : {
         "data" : {
            "count" : "1",
            "slug" : "visual-syntactic-text-formatting",
            "description" : ""
         },
         "title" : "Visual Syntactic Text Formatting",
         "type" : "post_tag",
         "id" : "term/47"
      },
      "user/7" : {
         "id" : "user/7",
         "type" : "user",
         "title" : "Paul Presley",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/ee2fdc1fbe3b09e1d978ef03cff0205e"
         }
      },
      "post/382" : {
         "id" : "post/382",
         "type" : "post",
         "title" : "Frode's dream of rich article listing",
         "data" : {
            "date" : "2018-10-18 15:53:22",
            "date_gmt" : "2018-10-18 15:53:22",
            "name" : "frodes-dream-of-rich-article-listing",
            "modified" : "2018-10-26 12:50:55",
            "html" : "I will be mocking up something to support the issue of <a href=\"https://jrnl.global/2018/10/17/fast-dynamic-views-dynamic-displays/\">how to find the right article in ones own blog world</a>.",
            "guid" : "https://jrnl.global/?p=382",
            "excerpt" : "",
            "modified_gmt" : "2018-10-26 12:50:55",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : ""
         }
      },
      "comment/48" : {
         "id" : "comment/48",
         "title" : "Initial Proje...: [&#8230;] of the project as designed before the...",
         "data" : {
            "creator_name" : "Initial Project Overview &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/10/08/initial-project-overview/",
            "date_gmt" : "2018-10-08 13:43:39",
            "date" : "2018-10-08 13:43:39",
            "html" : "[&#8230;] of the project as designed before the call on the 8th of October [&#8230;]"
         },
         "type" : "comment"
      },
      "post/45" : {
         "type" : "post",
         "title" : "Teodora Petkova",
         "data" : {
            "modified" : "2018-08-22 10:16:13",
            "name" : "teodora-petkova",
            "html" : "Hello! I am Teodora. My personal website is <a href=\"http://www.teodorapetkova.com/\" target=\"_blank\" rel=\"noopener\">www.teodorapetkova.com</a> and the website of the book I am currently finishing is <a href=\"http://www.thebravenewtext.com/\" target=\"_blank\" rel=\"noopener\">www.thebravenewtext.com</a>.\n\nWhat brought me here, at <strong>jrnl</strong> is my interest in the way our textual existence on the Web evolves.\n\nYou will find me mostly around <a href=\"https://plus.google.com/+TeodoraPetkova/posts\" target=\"_blank\" rel=\"noopener\">Google +</a> and <a href=\"https://twitter.com/TheodoraPetkova\" target=\"_blank\" rel=\"noopener\">Twitter</a>, sharing and discussing all things text, Semantic Web.",
            "date_gmt" : "2018-08-22 10:16:13",
            "date" : "2018-08-22 10:16:13",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-08-22 10:16:13",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=45",
            "excerpt" : ""
         },
         "id" : "post/45"
      },
      "post/158" : {
         "title" : "Status",
         "data" : {
            "guid" : "https://jrnl.global/?p=158",
            "excerpt" : "",
            "modified_gmt" : "2018-09-09 10:14:26",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "date_gmt" : "2018-09-09 10:14:26",
            "date" : "2018-09-09 10:14:26",
            "modified" : "2018-09-09 10:14:26",
            "name" : "status",
            "html" : "The wordpress ‘status’ Format is quite interesting.\n\nIt behaves like a non-headed tweet or social media post. It could be useful for future work.\n\n<a href=\"https://codex.wordpress.org/Post_Formats\">https://codex.wordpress.org/Post_Formats</a>"
         },
         "type" : "post",
         "id" : "post/158"
      },
      "comment/54" : {
         "type" : "comment",
         "data" : {
            "date_gmt" : "2018-10-25 14:24:44",
            "date" : "2018-10-25 14:24:44",
            "creator_name" : "Gyuri Lajos",
            "creator_url" : "",
            "html" : "Just a small issue. As I was adding a hypothes.is annotation to this page the blue dot came up as well.  The two capabilities could be better coordinated. Fortunatly both can be used as is.\nThe link below should show the annotations I added.\nhttps://hyp.is/c2vwzNhfEeiHOi9DoiXkTA/jrnl.global/2018/10/17/fast-dynamic-views-dynamic-displays/\n\nI concur with the observation about the difficulties encountered when one tries to find something in one's own \"information space\"."
         },
         "title" : "Gyuri Lajos: Just a small issue. As I was adding a hypothes....",
         "id" : "comment/54"
      },
      "user/2" : {
         "type" : "user",
         "title" : "Frode Hegland",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/62089910b46ccc18746dd7397736506d"
         },
         "id" : "user/2"
      },
      "term/25" : {
         "type" : "category",
         "data" : {
            "count" : "0",
            "description" : "",
            "slug" : "demo"
         },
         "title" : "Demo",
         "id" : "term/25"
      },
      "comment/18" : {
         "title" : "Personal Hype...: [&#8230;] by curation without having negative e...",
         "data" : {
            "creator_name" : "Personal Hypertext Report #6 &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/08/26/personal-hypertext-report-6/",
            "date" : "2018-08-26 04:07:02",
            "date_gmt" : "2018-08-26 04:07:02",
            "html" : "[&#8230;] by curation without having negative effects on what WordPress generates for the web: In the biography post about Teodora Petkova, there was a single, lone &amp;nbsp; on the last line, and that broke my XML processing of the post [&#8230;]"
         },
         "type" : "comment",
         "id" : "comment/18"
      },
      "comment/45" : {
         "id" : "comment/45",
         "type" : "comment",
         "title" : "An end of sum...: [&#8230;] The interaction method is a blue dot ...",
         "data" : {
            "html" : "[&#8230;] The interaction method is a blue dot which appears when user selects text. Point to it to get a menu of options. This is what used to be called the Hyperwords Project and was developed for Mozilla and Chrome as well as for wordpress which is the code we will be using now: https://jrnl.global/2018/09/21/refined-blue-dot/ [&#8230;]",
            "date" : "2018-10-03 21:01:02",
            "date_gmt" : "2018-10-03 21:01:02",
            "creator_url" : "http://wordpress.liquid.info/an-end-of-summer-update/",
            "creator_name" : "An end of summer update &#8211; liquid thoughts"
         }
      },
      "comment/25" : {
         "data" : {
            "date_gmt" : "2018-09-10 07:28:49",
            "date" : "2018-09-10 07:28:49",
            "creator_url" : "https://jrnl.global/2018/09/10/why-blogging-sucks-2/",
            "creator_name" : "Why Blogging Sucks &#8211; jrnl",
            "html" : "[&#8230;] with the light it can, given some proper data are added to our words. And I totally agree with Stephan Kreutzer&#8217;s write-up that blogging isn&#8217;t &#8220;hypertexty [&#8230;]"
         },
         "title" : "Why Blogging ...: [&#8230;] with the light it can, given some pro...",
         "type" : "comment",
         "id" : "comment/25"
      },
      "comment/23" : {
         "title" : "skreutzer: 7:55 I failed miserably to describe what I mean...",
         "data" : {
            "html" : "<p style=\"text-align:justify;\"><a href=\"https://www.youtube.com/watch?v=K-m5lhUjbnU#t=7m55s\" rel=\"nofollow\">7:55</a> I failed miserably to describe what I mean by “complex” and assumed that everybody in the hypertext field has some kind of glimpse what it is, but to make sure that listeners can get an idea of what category of problems I’m referring to, I tried to write a rough <a href=\"https://skreutzer.de/2018/08/26/on-complexity/\" rel=\"nofollow\">introduction to the notion</a>. It’s a major motive for Engelbart’s and Nelson’s work. Why do I feel to be confronted by a problem of complexity for a short introduction or elevator pitch about the things I’m doing or looking at? I’ve developed a bunch of small tools that do different tasks but also interact with each other in various ways, I’ve learned about many different aspects of text and publishing, I know what computers and networks are and can do, I’m aware of the mess we’ve created, try to look at all sorts of different things going on in past, present, future and in parallel, so when asked what I did, do or want to, I have no clue where to start and where to end, to filter what might be relevant and what might not, in order to fit a description in a short time span. Whatever I say, focus can shift tomorrow if there’s a good reason/opportunity, as I try to keep my stuff flexible enough anyway. It’s probably best to state the “values” I care most about: libre licensing, semantic net, open standards, avoiding dependencies, curation, offline usage, posterity, augmented reality for everybody. In effect, I care most about the universal library and am puzzled why we’ve allowed ourselves to not have it already. To go into more detail easily leads to immense complexity as it is the nature of networked, distributed structures with many aspects to every single node. So I have already several useful pieces to approach the gargantuan task, but they’re not made coherent yet into a capability infrastructure. Instead of describing what I did so far, it’s more interesting to discuss what we might build, and of course previous results might integrate, but as the problems with text aren’t solved yet to our satisfaction, there’s obviously still something missing. What it might be and how it might work is of plentiful complexity of its own, and one may frame it as a standard for text systems what POSIX is for operating systems, but we can easily suspect that there are many social, legal and technical implications that need to be worked on in order to make it happen.</p>\n\n<p style=\"text-align: justify\">Talking about it (this topic or another topic with a sufficient number of interrelated aspects) under a linear time restriction while still giving an accurate overview that’s not totally misleading is a problem of complexity I don’t have a tool for to deal with. The fact of my failure to show all of text, writing, publishing, hypertext, my interpretation of it and the views expressed by others, in a few sentences is a good demonstration of where I see this problem.</p>\n\n<p style=\"text-align: justify\">This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "creator_name" : "skreutzer",
            "creator_url" : "https://skreutzer.de",
            "date_gmt" : "2018-09-10 11:10:11",
            "date" : "2018-09-10 11:10:11"
         },
         "type" : "comment",
         "id" : "comment/23"
      },
      "comment/9" : {
         "type" : "comment",
         "title" : "Personal Hype...: [&#8230;] my Personal Hypertext Report #6, I ma...",
         "data" : {
            "html" : "[&#8230;] my Personal Hypertext Report #6, I made a screenshot that contains portions of Frode Hegland’s “jrnl launch meeting announcement (for Friday 24th of August 2018)” text. As the report primiarly covers actual issues of the existing posts on jrnl.global, it made [&#8230;]",
            "date" : "2018-09-10 00:26:01",
            "date_gmt" : "2018-09-10 00:26:01",
            "creator_name" : "Personal Hypertext Report #7 &#8211; skreutzer’s Blog",
            "creator_url" : "https://skreutzer.de/2018/09/09/personal-hypertext-report-7/"
         },
         "id" : "comment/9"
      },
      "term/30" : {
         "title" : "design",
         "data" : {
            "count" : "1",
            "description" : "",
            "slug" : "design"
         },
         "type" : "post_tag",
         "id" : "term/30"
      },
      "term/33" : {
         "id" : "term/33",
         "type" : "post_tag",
         "title" : "Edgar",
         "data" : {
            "count" : "2",
            "slug" : "edgar",
            "description" : ""
         }
      },
      "comment/53" : {
         "id" : "comment/53",
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] I will be mocking up something to support the issue of how to find the right article in ones own blog world. [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/10/18/frodes-dream-of-rich-article-listing/",
            "creator_name" : "Frode&#8217;s dream of rich article listing &#8211; jrnl",
            "date_gmt" : "2018-10-18 15:53:25",
            "date" : "2018-10-18 15:53:25"
         },
         "title" : "Frode&#8217;s...: [&#8230;] I will be mocking up something to sup..."
      },
      "comment/33" : {
         "type" : "comment",
         "title" : "Blue Dot Menu...: [&#8230;] (flows the selected text or full page...",
         "data" : {
            "creator_url" : "https://jrnl.global/2018/09/14/blue-dot-menu-design/",
            "creator_name" : "Blue Dot Menu Design &#8211; jrnl",
            "date" : "2018-09-14 11:22:21",
            "date_gmt" : "2018-09-14 11:22:21",
            "html" : "[&#8230;] (flows the selected text or full page. We will need to [&#8230;]"
         },
         "id" : "comment/33"
      },
      "post/26" : {
         "id" : "post/26",
         "title" : "jrnl launch meeting announcement (for Friday 24th of August 2018)",
         "data" : {
            "guid" : "https://jrnl.global/?p=26",
            "excerpt" : "",
            "modified_gmt" : "2018-08-21 14:56:34",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "date_gmt" : "2018-08-21 14:56:34",
            "date" : "2018-08-21 14:56:34",
            "name" : "jrnl-launch-meeting-announcement-for-friday-24th-of-august-2018",
            "modified" : "2018-08-21 14:56:34",
            "html" : "Hi,\n\nI look forward to the first meeting of the jrnl (‘Journal’) project this Friday at 5pm UK time!\n\nThe purpose of the jrnl project is to build enhancements to a wordpress blog which deliver on some of Doug Engelbart’s inventions and vision. It is under the auspices of The Future Text Institute (which we are purposefully taking a long time to launch, in order to do it properly).\n\nThe first use of the jrnl will be to make a digital version of the analog book we will produce for this year’s special Future of Text: 50th years Anniversary of Doug Engelbart’s Demo.\n\n\n*** The very first contents of the blog will be our own dialog so I ask you to please reply through blogging. I have posted this announcement in the blog itself so please use your jrnl blog account to reply to this message and post any thoughts and questions–let’s live this to improve this ***\n\n\n_____________________________\n\nMeeting Preparation\n\n\nBefore the meeting please blog any introduction with links to whatever personal or professional profile you would like to share using the ’The Team’ Category. If you don’t know how to blog or if you did not get log-in details please email me.\n\n_____________________________\n\nAgenda for the 1 hour meeting\n\n\nWe will briefly introduce ourselves.\n\nWe will then discuss how we should work together. How much are we comfortable using the blog, how often should we meet, how we should track tasks (hopefully through the blog but perhaps other ways) and how we should document our work and technical decisions through the blog.\n\nWe will then spend the reminder of the time hearing views on the jrnl itself, including any suggested requirements, features and implementations.\n\nWe will close with everyone having a minute to say how they will commit to the project: what you take responsibility for doing. For some that will simply be listening in occasionally and that is fine.\n\n_____________________________\n\nAfter the meeting there I have a one hour break before I meet with Vint Cerf and Ismail Serageldin to present what we have arrived at and how we should proceed, for their feedback. During this one hour I’m happy to be part of any ongoing implementation details, should anyone wish to continue.\n\nThis is exciting!\n\n\n\nFrode Hegland\nfutureoftext.org"
         },
         "type" : "post"
      },
      "term/35" : {
         "data" : {
            "count" : "1",
            "slug" : "flexibility",
            "description" : ""
         },
         "title" : "flexibility",
         "type" : "post_tag",
         "id" : "term/35"
      },
      "post/204" : {
         "type" : "post",
         "data" : {
            "mime_type" : "",
            "modified_gmt" : "2018-09-12 16:03:17",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=204",
            "html" : "<p style=\"text-align: center;\"><em>writing, then just getting stuck looking at the writing process</em></p>\n&nbsp;\n<p style=\"text-align: right;\"><strong>freedom is the power to act</strong></p>\n\n<h2>learning the tracks</h2>\nWe have internal models of the world made up of connected structures of relationships with are sometimes called models, maps or schema. Whatever we call them, it’s worth keeping in mind that these are constructs and not neutral reflections.\n\nEverything we learn, we learn ‘into’ these constructs. The signals from our senses connect to these structures.\n\nThis has long been studied and understood and provides a meaningful means of learning about the world. When a student is learning about an established field it is good pedagogy to present the information in a well structured manner to allow for the new information to hook onto previously established structures.\n\nHowever, once the student is out of school and out the door, there is no single, universal knowledge store to access. In order to add value to ones work and field, the student must accept that their mental constructs is are but one way of ‘looking at’ the world.\n\nAccepting the non-objectivity of ones constructs is not an easy thing to do because this is where our minds ‘run’, this sculpture is the entrenched pattern of our minds. The very root of the word to ‘learn’ comes from the notion of following a track, which is a useful metaphor when expecting the world to have a definitive, single useful model.\n\nAt a very deep level, this is where our base personalities’ foundations play a role in how the rest of the constructs will grow: For someone who is of a calm or nervous disposition the shape of the constructs will be different. Those who are creative will have different scaffolding for their constructs to those who are better on focused tasks. The dimensions of personality are many and they all are part of the ‘material’ the sculpture builds from.\n\nIt’s easy to pile to the existing shape, to follow established tracks, it’s easy to keep building from the current shape, a shape which is our ‘world view’. If you love a sport it won’t take you that long to understand the perforce of a new player. If you are a jazz fanatic it is easy to appreciate a new piece of music. You can judge what you experience based on what you already know.\n<h2>jumping</h2>\nThe title of this article refers to the act of ‘jumping’. The act of jumping is appropriate not only because it’s a metaphor for jumping out of the tracks of established thinking but also because the notion of our mental structures reminds us of the need to change our view of our current knowledge and to see it in context with new knowledge.\n\nThe ‘grooves’ we have formed in our physical brains by strengthening certain synaptic connections while weakening others require real mental effort to examine and to re-build based on new impressions.\n\nChanging our minds is not easy if we are to be confident in our view of the world and how we fit within that world. If we build our identity around fixed points and those points move, it is hard for our mental structures to fit, to follow the changes.\n\nLong books have been written about different political and religious ideologies and how they enforce specific world views by constraining what we feel we should question and what we should take as some form of moral or core truth.\n\nThis article is not about the pros and cons of different views, different mental tracks.\n\nfreedom of movement\n\nThis article is about intellectual freedom of movement.\n\nWhat has driven the development of brains has been movement from the very start: Movement towards mates and prey and away from predators.\n\nToday we live in increasingly mental worlds where what we interact with is now what we see physically in the world but what we interact with mentally via computer screens.\n\nThe computer screens can serve as thinking spaces to better reflect what is in our mental structures and thus, to use an analogy, use our occipital lobes to augment our prefrontal cortex very much like a GPU can augment an CPU.\n<h2>digital augmentation</h2>\nSince the dawn of our species we have been thinking outside our brains, through the use of our hands and through the use of tools, such as something as simple as a stick and substrates, such as sand. We have indicated to others what we are interested in, we have developed visual means of counting and we have developed increasingly sophisticated and abstracted means of noting down thoughts so that we may remember and communicate them but also so that we may gain better ‘insights’ ourselves.\n\nThe terms ‘jumping’ and ‘insights’ are not chosen for poetic colour but rather to illustrate movements.\n\nUsing digital systems to augment freedom of movement in order to help the user move away from only staying in well worn tracks and to to develop better understanding of their mental structures, arises out of the ability to change what is shown to the user and how the user moves through the information space.\n\nIn many cases what will be shown will be text, not images (as either drawing, photographs or three dimensional renderings) since the symbols of text allow for syntactical meaning in more flexible and abstracted ways than literal or diagrammatic images.\n\n***\n\nour mental map is connections\n\ncuriosity is questioning the connections\n\nspark points to provide perspectives\n\norganising own thoughts DOUG\n\n***\n\nAs I write this I am working with blocks of text which are meaningless away from my foveal focus, they become uniform grey blocks.\n\n&nbsp;\n\nthis is where it grinds down.\n\n&nbsp;\n\nThis is where I am lost in my own text. As Doug Engelbart wrote in Authorship Provisions In Augment: “ Studying another's work provides a well-recognized challenge, but one of the toughest jobs is to study one's own work during its development” (<a href=\"http://www.dougengelbart.org/pubs/oad-2250.html#Ref-2\">Engelbart, 1984</a>).\n\nthinking along these lines today the same old avenues open up in my mind in different ways:\n\nPromising avenues for investigation are ways to expand and contract sections based on what the author is focusing on, like this:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/section.png\"><img class=\"aligncenter size-full wp-image-207\" src=\"http://wp.doug/wp-content/uploads/2018/09/section.png\" alt=\"\" width=\"2444\" height=\"1440\" /></a>\n\nOf course, this can then go into a <a href=\"http://wordpress.liquid.info/liquid-projects-near-future-scenario-with-joe-using-the-dynamic-view/\">Dynamic View</a> as well, as envisioned as a <a href=\"http://www.liquid.info/view.html\">Liquid | Author feature</a>, or in a very different way.\n\nPerhaps it would be worthwhile to also introduce means to visually present hyperGlossary entries into the work for the author to be able to use them to write succinctly and in a linked way. Perhaps like this, where the glossary entries are available when the author mouse-overs the left hand side of the screen, to either drag over, click over or to use in other ways:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/glossary-entries-1.png\"><img class=\"aligncenter size-full wp-image-206\" src=\"http://wp.doug/wp-content/uploads/2018/09/glossary-entries-1.png\" alt=\"\" width=\"2560\" height=\"1440\" /></a>",
            "name" : "the-incredible-difficulty-of-jumping-mental-tracks-breakdown-and-notions-of-progress",
            "modified" : "2018-09-12 16:03:17",
            "date" : "2018-09-12 16:03:17",
            "date_gmt" : "2018-09-12 16:03:17"
         },
         "title" : "The Incredible Difficulty of Jumping Mental Tracks + Breakdown and Notions of Progress",
         "id" : "post/204"
      },
      "term/17" : {
         "id" : "term/17",
         "title" : "Related Work",
         "data" : {
            "count" : "1",
            "description" : "Any related work we should be aware of.",
            "slug" : "related-work"
         },
         "type" : "category"
      },
      "comment/27" : {
         "id" : "comment/27",
         "type" : "comment",
         "data" : {
            "date" : "2018-10-08 09:29:03",
            "date_gmt" : "2018-10-08 09:29:03",
            "creator_url" : "http://liquid.info",
            "creator_name" : "Frode Hegland",
            "html" : "Your quote about understanding and being understood is beautiful."
         },
         "title" : "Frode Hegland: Your quote about understanding and being unders..."
      },
      "term/13" : {
         "id" : "term/13",
         "title" : "Presenter",
         "data" : {
            "count" : "0",
            "description" : "",
            "slug" : "presenter"
         },
         "type" : "category"
      },
      "post/292" : {
         "id" : "post/292",
         "data" : {
            "modified" : "2018-10-05 11:21:34",
            "name" : "9th-december-my-priorities",
            "html" : "For the jrnl project to celebrate the 50th anniversary of Doug Engelbart's demo, I aim to have the following done and ready to demo and for people to download and use themselves:\n<ul>\n \t<li><a href=\"http://www.liquid.info\">Liquid | Author</a> support <a href=\"http://wordpress.liquid.info/publish-from-author-to-wordpress-high-resolution-addressing/\">posting to WordPress with high-resolution addressing</a> for citation done.</li>\n \t<li>Flow and Find in Article, both of which are ViewSpecs and will require that the document is re-drawn live in jrnl</li>\n \t<li>Basic <a href=\"http://thefutureoftext.org/hyperglossary.html\">hyperGlossary</a> functionality for jrnl and Author.</li>\n \t<li>Author released with perfect citation export and use experience.</li>\n</ul>\nBonus would be to have the following or at least have started gearing up for work on:\n<ul>\n \t<li><a href=\"http://wordpress.liquid.info/voice-interaction-for-text/\">Voice interaction for editing.</a></li>\n \t<li><a href=\"http://wordpress.liquid.info/compressed-scrolling/\">Compressed Scrolling.</a></li>\n</ul>\nPlease feel free to share priorities here as well.",
            "date" : "2018-10-05 11:21:34",
            "date_gmt" : "2018-10-05 11:21:34",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-05 11:21:34",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=292",
            "excerpt" : ""
         },
         "title" : "9th December, my Priorities (personal)",
         "type" : "post"
      },
      "comment/11" : {
         "data" : {
            "date_gmt" : "2018-08-22 08:45:46",
            "date" : "2018-08-22 08:45:46",
            "creator_url" : "http://blog.soton.ac.uk/webteam/",
            "creator_name" : "Christopher Gutteridge",
            "html" : "I think there's a strong argument for aspiring to keep the default HTML rendering to something useful. \n\nUse of \"data\" attributes could be useful to describe richer scope, or additional matching terms which don't want to be shown to the default HTML view.\n\nLater, it would be useful to be able to use a semantic code/id/uri to link a concept to a definition. So that you can provide make the text of \"The Queen\" link to a definition of \"Queen Elizabeth II\" even though \"Th Queen is not an appropriate term for the glossary entry."
         },
         "title" : "Christopher G...: I think there's a strong argument for aspiring ...",
         "type" : "comment",
         "id" : "comment/11"
      },
      "post/343" : {
         "type" : "post",
         "title" : "10/8/2018: Notes from call with Frode and team",
         "data" : {
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=343",
            "mime_type" : "",
            "modified_gmt" : "2018-10-09 15:29:08",
            "comment_count" : null,
            "content_filtered" : "",
            "date" : "2018-10-09 15:29:08",
            "date_gmt" : "2018-10-09 15:29:08",
            "html" : "<h3>Participants</h3>\nShane Gibson\nFrode Hegland\nChristopher Gutteridge\nGyuri Lajos\n<h3>Introductions</h3>\nChris Gutteridge: Works for University of Southampton, been there for 20+ years, works in OpenData, worked with Ted Nelson, doing a PhD in scholarly communication. When Frode started his project, Chris got involved because they had a lot of similarities. Chris comes from a very different perspective, had a bit of a brainstorm about Doug Englebart ideas and how to port them into WP. Chris is a developer himself. One of the ideas is some very simple and easy to understand components in WP, posts, categories, tags, etc, if you could treat those all as entities so that other applications could understand them. Taking information in a WP site, be able to import more items from an external source, and then be able to lay out your own visualization of information. Using jQuery to highlight connections between, with some links pre-opened.\n\nGyuri Lajos: Does not know much about WP. Came to the Future of Text about 5 years ago while working as a researcher for the last 15 years. Had a revelation 5 or 6 years ago. Been through several iterations. Going for a collaborative intelligence platform. Only criticism of Englebart is that the only way he could get any funding would have been collaborative intelligence platform. Now, every individual can be their own edge/hub of information. Most important thing is to plug into what exists. Every individual is empowered to do their own thing, but then should be able to collaborate.\n\nFrode Hegland: Does not want to build something in WP just because it is a nice interface. A person who easily gets carried away.\n<h3>Notes</h3>\n<ul>\n \t<li>The result of ingesting content is really, really important.</li>\n \t<li>When a search is completed, sub-search should be available inside of the result.</li>\n \t<li>Search query X</li>\n \t<li>Graph databases\n<ul>\n \t<li>You have entities</li>\n \t<li>You have properties</li>\n \t<li>You have relationships (typically directional: this post has this author as a relationship)</li>\n</ul>\n</li>\n \t<li>Simple level is an abstraction layer that treats every single entity the same.</li>\n \t<li>Once a post/page is published, it becomes relatively static.</li>\n \t<li>Create a sentence entity and a paragraph entity using basic WP authoring, when you push publish, it will create entities.</li>\n \t<li>Would be great to have natural language processing.</li>\n \t<li>Can WordPress be converted into a graph storage and view system?</li>\n \t<li>Find all entities that match X conditions with relations of a certain type and find relations with particular attributes.</li>\n \t<li>Posts and authors, introduce natural language search, possibly.</li>\n \t<li>Compressed scrolling is far in the future.</li>\n \t<li>The hyperglossary will be a separate discussion.</li>\n \t<li>Annotate is a future consideration.</li>\n \t<li>High resolution addressing is very important and should be the first thing we want to demonstrate.</li>\n \t<li>Publishing hooks should implement a WordPress-specific scheme for copy as citation.</li>\n \t<li>Implemented as a message queue.</li>\n</ul>\n<h3>Action Items</h3>\n<ol>\n \t<li>Merge Chris \"copy as citation code\" with blue dot code currently on wordpress.liquid.info</li>\n \t<li>Create empty GitHub repository and share with Frode for the purposes of storing code inside existing blue dot</li>\n</ol>\nPlease let me know if there are modifications required for these notes!",
            "name" : "10-8-2018-notes-from-call-with-frode-and-team",
            "modified" : "2018-10-09 15:29:08"
         },
         "id" : "post/343"
      },
      "term/38" : {
         "id" : "term/38",
         "type" : "post_tag",
         "data" : {
            "slug" : "interactivity",
            "description" : "",
            "count" : "1"
         },
         "title" : "interactivity"
      },
      "term/29" : {
         "id" : "term/29",
         "data" : {
            "count" : "1",
            "slug" : "collapse-view",
            "description" : ""
         },
         "title" : "collapse view",
         "type" : "post_tag"
      },
      "comment/2" : {
         "title" : "cjg: Poopy.",
         "data" : {
            "creator_url" : "",
            "creator_name" : "cjg",
            "date" : "2018-10-26 12:01:16",
            "date_gmt" : "2018-10-26 12:01:16",
            "html" : "Poopy."
         },
         "type" : "comment",
         "id" : "comment/2"
      },
      "post/272" : {
         "id" : "post/272",
         "type" : "post",
         "data" : {
            "date_gmt" : "2018-09-21 16:15:59",
            "date" : "2018-09-21 16:15:59",
            "html" : "We now have this refined blue dot menu, with basic functions only. It's only live on <a href=\"http://wordpress.liquid.info\">wordpress.liquid.info</a> so far though.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-21-at-17.12.53.png\">\n<img class=\"aligncenter size-full wp-image-273\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-21-at-17.12.53.png\" alt=\"\" width=\"1252\" height=\"492\" /></a>",
            "modified" : "2018-09-21 16:15:59",
            "name" : "refined-blue-dot",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=272",
            "mime_type" : "",
            "modified_gmt" : "2018-09-21 16:15:59",
            "comment_count" : null,
            "content_filtered" : ""
         },
         "title" : "refined blue dot"
      },
      "user/9" : {
         "id" : "user/9",
         "type" : "user",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/e215e04b075bb1b3539da395c88bea05"
         },
         "title" : "Shane Gibson"
      },
      "term/43" : {
         "type" : "post_tag",
         "data" : {
            "count" : "0",
            "description" : "",
            "slug" : "recording"
         },
         "title" : "recording",
         "id" : "term/43"
      },
      "post/407" : {
         "id" : "post/407",
         "type" : "post",
         "data" : {
            "modified" : "2018-10-01 10:22:18",
            "name" : "paul-presley",
            "html" : "For nearly 30 years I have been working in magazine publishing, from lowly intern to full-time Editor (today at: <a href=\"http://www.geographical.co.uk\">www.geographical.co.uk</a>). My interest in this project is due to a love of the presentation of useful text for readers, so anything that is working on ways to better the interactions between readers and content is going to be of use as the written form evolves.",
            "date" : "2018-10-01 10:22:18",
            "date_gmt" : "2018-10-01 10:22:18",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-01 10:22:18",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=279",
            "excerpt" : ""
         },
         "title" : "Paul Presley"
      },
      "term/23" : {
         "id" : "term/23",
         "data" : {
            "count" : "4",
            "description" : "The ability of the user to cite by copying information from one article and for the system to carry across relevant contextual information in order to make it quick and easy for the reader to access the source, including high-resolution linking. ",
            "slug" : "reading2cite"
         },
         "title" : "Citations",
         "type" : "category"
      },
      "post/103" : {
         "title" : "What Sucks about Blogging",
         "data" : {
            "html" : "<details>\n  <summary>\n    Blogging as a practice is just fine, what sucks is that the way we do it isn’t hypertexty enough.\n  </summary>\n</details>\n\n<p style=\"text-align:justify;\">Blogging as a practice in itself doesn’t suck at all. Writing diary or articles or entries in a <a href=\"http://archive.computerhistory.org/resources/access/text/2013/04/102723087-05-01-acc.pdf\">journal</a> is just fine. It’s the way how we do it today that needs improvement. I have an <a href=\"https://skreutzer.de/2018/07/20/incomplete-list-of-desired-hypertext-system-capabilities\">incomplete list of desired hypertext capabilities</a>, but when looking at only blogging activities in isolation, it’s also clear that a different hypertext capability profile/subset is needed than for other modes of working on/with text. What sucks about blogging on the web is the absence of that particular capability profile. This is an incomplete list as well.</p>\n\n<ul>\n  <li>\n    <p style=\"text-align:justify;\">If a text is sent to a machine that has the task of distributing it (which in effect publishes it), usually a server dedicated 24/7 to send the text to everyone who asks for it, if that server goes offline or changes address, all references/links break because they’re hard-wired to that particular machine from which the text can’t be retrieved any more, despite a lot of other places have a copy that could serve it just as well.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">If a text that was published gets updated by the original author, it’s not made obvious to the reader what version he’s currently looking at, and the previous versions are usually not made accessible. Those readers who received an earlier version don’t have an easy way to learn that their copy is potentially outdated, that a new version was published.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">People can’t publish their modifications to a text that was published by somebody else. In part because of technical problems: we lack a way to keep the link to the original source, to notify the source in a federated way about the derived work, to import/approve the changes made by others as a new version of the original author (retaining the links to the contributor), to find all derived works based on a base text even if its original author didn’t import/approve them, all of this for every version and derived works getting versioned themselves, basically the cloning/forking/merging as pioneered by git/GitHub. While solutions can be build to make this technically possible, legal permissions are needed as well as the pre-digital copyright law is designed to prevent it, and if people don’t agree on policies that allow collaboration, there is no way to or point in practically engaging with them. Most of blogging is one-way, fire&amp;forget, throwaway communication of little use other than for passive consumption.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Blog posts on/for the web usually lack the annotation of semantic meaning. Instead, they target a specific visual rendering by a browser. If a client wants to apply its own ViewSpecs onto the blog posts, there’s not a lot in the data to which the ViewSpecs could react. Blogging on the web doesn’t encourage to improve this, it continues to focus on the visual rendering by the browser as defined by the author or operator of the distribution/server machine.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Annotations, comments, citations and so on (secondary additions not adjusting the main text) rarely can be published independent of the operator of the distribution/server machine of the main text, while they should be published independently for the original author(s) to get notified in a federated way to import/approve them or not, but even without import/approval, every reader who looks at the main text from the original source should be able to learn about all comments, annotations, citations in other works regardless of import/approval by the original authors. Furthermore, those works should be independent works of their own, which means that they’re versioned as well, can be modified by anyone in the same manner, or can get annotated or commented on. All those pieces should collate/come together virtually for navigation and manipulation on the client as many distribution mechanisms/servers might be involved, so no single one of them will have all of the pieces or would reliably provide the functions (even if, it would be a bad idea to become dependent on what a particular machine provides).</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Whatever a user publishes, it should be made possible to show up in his publications feed, if he should choose so. Such contribution feeds of authorship can be created for any arbitrary identity of individuals or groups.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Blogs are designed to list publications chronologically. This is only one way to organize material. All sorts of lists of posts should be allowed, publishable by anybody in any combination from the same or different sources. The chronological order discriminates older posts and puts emphasis on new ones. Navigatable hypertext with links between pieces of text should be made an option as blogging integrates into generic hypertext, so hypertext capabilities can be used to create traditional blogging among a lot of other things as well.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Every retrieved publication should be saved to a local archive that can keep it forever or only temporarily, depending on policy set by the user, of which there can be many. It should be possible to keep track of what has been read, and to publish such information selectively or as a whole.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Despite it’s not really part of blogging, hypertext capabilities should allow the reader to curate his local copies of the retrieved materials, to link them together in ways not foreseen or intended by the original author, and across different sources. That result should be publishable if the user wishes to, which requires a solution to avoid the legal restrictions.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Digital technology offers a lot of potential, but it’s rarely realized. There is no reason why arbitrary combinations of retrieved portions shouldn’t be printable by anyone as a neatly bound hardcover or leaflet, in many layouts, optionally interleaved for note-taking, starting from quantities of a single copy, never going “out of print” when a second and third copy is needed. There is no reason why arbitrary combinations of retrieved portions shouldn’t be convertable into a data format that can be read on an e-ink device (EPUB) to be read on the bus or train, or be made available as audio via text-to-speech. Whatever derived formats/renderings are generated, they should be publishable so they can be found when searching for those kind of configurations associated with a text source, regardless if the original author imports/approves them or not.</p>\n  </li>\n  <li>\n    <p style=\"text-align:justify;\">Blogging should be made a thing for audio and video as well.</p>\n  </li>\n  <li>\n    More to come…\n  </li>\n</ul>\n\n<p style=\"text-align:justify;\">In my view, the question “what sucks about blogging” isn’t particulary helpful because what sucks isn’t related to blogging that much. I more lament the general lack of hypertext capabilities for all types of text and media work, which includes blogging of course, but not limited to this particular activity. On the other hand, some aspects of hypertext are less important if one only looks at blogging, so it’s still reasonable to answer the question by trying to point out those capabilities that would improve blogging as implemented today the most. Blogging also invites long-form writing where shorter, hypertextually interlinked pieces make production and consumption easier, while chronological order can be one option amongst many others.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>\n",
            "modified" : "2018-09-03 02:21:38",
            "name" : "what-sucks-about-blogging-2",
            "date_gmt" : "2018-09-03 02:21:38",
            "date" : "2018-09-03 02:21:38",
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-03 02:21:38",
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=103"
         },
         "type" : "post",
         "id" : "post/103"
      },
      "comment/35" : {
         "id" : "comment/35",
         "title" : "Implicit Link...: [&#8230;] Let users select any arbitrary text a...",
         "data" : {
            "html" : "[&#8230;] Let users select any arbitrary text and perform searches based on the text, such as we have experimented with for Liquid | Flow and in wordpress here wordpress.liquid.info both of which are already developed and owned by us. A blog post with illustration of the blue dot. [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/09/08/implicit-linking/",
            "creator_name" : "Implicit Linking &#8211; jrnl",
            "date" : "2018-09-09 14:26:48",
            "date_gmt" : "2018-09-09 14:26:48"
         },
         "type" : "comment"
      },
      "term/21" : {
         "id" : "term/21",
         "type" : "category",
         "data" : {
            "count" : "0",
            "slug" : "templates",
            "description" : "Giving the user specific templates to further constrain and clarify special posts, such as meeting Agendas which expand into meeting Minutes at the time of the meeting."
         },
         "title" : "Wordpress Templates"
      },
      "comment/43" : {
         "id" : "comment/43",
         "type" : "comment",
         "title" : "MacOS X Text ...: [&#8230;] I have written a brief blog post on c...",
         "data" : {
            "creator_name" : "MacOS X Text draft proposal Post, 18 Sep 2018) &#8211; liquid thoughts",
            "creator_url" : "http://wordpress.liquid.info/macos-x-text-draft-proposal-post-18-sep-2018/",
            "date" : "2018-09-18 12:27:53",
            "date_gmt" : "2018-09-18 12:27:53",
            "html" : "[&#8230;] I have written a brief blog post on citations as part of the introduction for a session on Symbol Manipulation for the 50th Anniversary of Doug Engelbart’s seminal demo, which would ask you to please have a look at: https://jrnl.global/2018/09/17/draft-symbol-manipulation-session-intro-pointing/ [&#8230;]"
         }
      },
      "comment/46" : {
         "type" : "comment",
         "title" : "Agenda, Chris...: [&#8230;] Frode has posted his priorities on th...",
         "data" : {
            "date_gmt" : "2018-10-07 15:16:53",
            "date" : "2018-10-07 15:16:53",
            "creator_url" : "https://jrnl.global/2018/10/07/agenda-chris-shane/",
            "creator_name" : "Agenda, Chris &#038; Shane &#8211; jrnl",
            "html" : "[&#8230;] Frode has posted his priorities on this blog. [&#8230;]"
         },
         "id" : "comment/46"
      },
      "post/390" : {
         "id" : "post/390",
         "type" : "page",
         "title" : "welcome to jrnl",
         "data" : {
            "mime_type" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-19 11:22:28",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?page_id=390",
            "html" : "The jrnl is a project to enhance writing articles on the web, inspired by the work of Doug Engelbart. We are building our initial components on WordPress.\n\nFor more, please have a look at our <a href=\"https://jrnl.global/journal/\">Journal</a>.\n<h1>jrnl origins</h1>\n<p id=\"u4814-14\">For the special <a href=\"https://thedemoat50.wordpress.com/symposium/\">Symposium</a> on the 50th Anniversary of Doug Engelbart's demo, on the 9th of December 2018, we will produce a printed book of presentations of the speakers and additional written statements by them. Furthermore, in order to honour a small part of his legacy, we are building our version of his Journal (we are calling just ‘jrnl’) which aims to deliver on some of the interactive elements which he invented but which are largely missing from today's online environments and that is this project.</p>\n<p id=\"u4814-17\" style=\"text-align: center;\"><strong><em>The point jrnl is that we believe that connected online documents are still in infancy. We can and must do better.</em></strong></p>\n\n<h1 id=\"u4814-24\"><span id=\"u4814-22\">Platform : WordPress</span></h1>\n<p id=\"u4814-30\">Inspired by Doug Engelbart we are working to not only write about this in hypothetical terms but also to build it so that we can demonstrate the usefulness of what is proposed.</p>\n<p id=\"u4814-36\">In order to realise our goal of producing something visibly useful which can be used by anyone who can host a web page, the jrnl has the WordPress blogging platform as its core. This platform we believe has a lot to offer, as Wired recently wrote “<a class=\"nonblock\" href=\"https://www.wired.com/story/rss-readers-feedly-inoreader-old-reader/\">it's time for an rss revival</a>.”</p>\n<p id=\"u4814-42\">In addition to the formal contributions to the Symposium, the jrnl is being populated with the casual dialogue of our daily work as we discuss the system itself which will help us get a better feel for the system as we build it, ‘eating our own dog food’ as they are so fond of saying in Silicon Valley or ‘living on’ as former Apple engineer Ken Kocienda put it more poetically. The different contributions (official Symposium transcript and our dialogue) will naturally be posted under different categories, providing a clear entry point for each year's official <a class=\"nonblock\" href=\"http://thefutureoftext.org/symposium.html\" data-href=\"page:U74\">Future of Text Symposium</a> posts.</p>\n<p id=\"u4814-48\">The goal is to make adding to the record<span id=\"u4814-45\"> usefully browsable, searchable and viewable in flexible ways, </span><span id=\"u4814-46\">to augment the authors ability to be understood and the readers ability to understand, </span>so that we may come closer to escaping the ‘Bush Curse’:</p>\n\n<blockquote>\n<p id=\"u4814-53\">Thus far we seem to be worse off than ever before - for we can enormously extend the record; yet even in it's present bulk we can hardly consult it.</p>\n<p id=\"u4814-59\">Vannevar Bush<span id=\"u4814-55\"> </span><a class=\"nonblock\" href=\"https://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/\">The Atlantic Monthly</a><span id=\"u4814-58\"> 1945</span></p>\n</blockquote>\n<h1 id=\"u4814-67\"><span id=\"u4814-65\">Components To Build</span></h1>\n<p id=\"u4814-75\">The jrnl components are separated both to make each one easer to focus on and because they should be as independent as possible in order to remain open and to allow for any other party's components to integrate, supporting a specific use case. To discuss the priorities listed here, please use the Category <a class=\"nonblock\" href=\"https://jrnl.global/category/priorities/\">Priorities</a> in the jrnl.global blog: <a class=\"nonblock\" href=\"http://thefutureoftext.org/jrnl-components-to-build.html\" data-href=\"page:U5970\">jrnl Components To Build</a></p>\n\n<h1 id=\"u4814-83\"><span id=\"u4814-81\">Project Updates</span></h1>\n<h1 id=\"u4814-97\"><span id=\"u4814-95\">Criteria</span></h1>\n<ul id=\"u4814-125\" class=\"list0 nls-None\">\n \t<li id=\"u4814-100\">Clear visuals</li>\n \t<li id=\"u4814-102\">Rich interactions</li>\n \t<li id=\"u4814-104\">Fast Citations</li>\n \t<li id=\"u4814-106\">High-Resolution Addressing</li>\n \t<li id=\"u4814-110\"><a class=\"nonblock\" href=\"http://thefutureoftext.org/socratic-authoring.html\" data-href=\"page:U3357\">Socratic Authoring</a> considerations</li>\n \t<li id=\"u4814-112\">Support for multiple timelines view specifications</li>\n \t<li id=\"u4814-114\">Support for multiple article view specifications</li>\n \t<li id=\"u4814-116\">Support for -outside-the-document intelligence, where the document can be notified of updates or changes</li>\n \t<li id=\"u4814-124\">Follow the insights of Doug Engelbart, whom you can hear discuss some of these topics on this site, in the <a class=\"nonblock\" href=\"http://thefutureoftext.org/engelbart.html\" data-href=\"page:U3240\">Audio Glossary</a> and read more about on the <a class=\"nonblock\" href=\"http://www.dougengelbart.org/\">Doug Engelbart Institute</a>.</li>\n</ul>\n<h1 id=\"u4814-130\"><span id=\"u4814-131\">Constraints</span></h1>\n<ul id=\"u4814-145\" class=\"list0 nls-None\">\n \t<li id=\"u4814-136\">Based on open blog standards</li>\n \t<li id=\"u4814-138\">Adheres to standard WordPress and RSS feeds, thus allowing contributors flexibility and data ownership is retained</li>\n \t<li id=\"u4814-140\">Component based/object oriented so that anyone can choose which functionality they want, without needing to take the whole system</li>\n \t<li id=\"u4814-142\">Integration with Twitter or other short text/live media</li>\n \t<li id=\"u4814-144\">Integration with YouTube or other video storage and extract transcripts</li>\n</ul>\n<h1 id=\"u4814-153\"><span id=\"u4814-151\">Contributors</span></h1>\n<ul id=\"u4814-188\" class=\"list0 nls-None\">\n \t<li id=\"u4814-160\"><span id=\"u4814-155\"><a href=\"https://jrnl.global/2018/08/21/frode-hegland/\">Frode Hegland</a>, </span>developer of macOS and iOS software; <a class=\"nonblock\" href=\"http://www.liquid.info/\">liquid.info</a> is the principal investigator and project lead.</li>\n \t<li id=\"u4814-163\"><span id=\"u4814-161\">Christopher Gutteridge</span> from the University of Southampton is system architect</li>\n \t<li id=\"u4814-166\"><span id=\"u4814-164\">Shane Gibson</span> is principal WordPress architect</li>\n \t<li id=\"u4814-169\"><a href=\"https://jrnl.global/2018/10/08/gyuri-lajos/\"><span id=\"u4814-167\">Gyuri Lajos</span></a> is an active team member</li>\n \t<li id=\"u4814-175\"><a href=\"https://jrnl.global/2018/08/21/stephan-kreutzer/\"><span id=\"u4814-170\">Stephan Kreutzer</span></a> is actively <a class=\"nonblock\" href=\"https://skreutzer.de/category/english/\">working</a> on the project.</li>\n \t<li id=\"u4814-178\"><span id=\"u4814-176\">The Advisory Board</span> is Ismail Serageldin, David Price and Howard Rheingold with Vint Cerf as chairman</li>\n \t<li id=\"u4814-181\"><span id=\"u4814-179\">Dialogue Partners</span> include Bruce Horn, Mark Anderson, Jacob Hazelgrove, Marc Antoine Parent, <a href=\"https://jrnl.global/2018/08/22/teodora-petkova/\">Teodora Petkova</a>, Timour Shoukine and <a href=\"https://jrnl.global/2018/10/01/paul-presley/\">Paul Presley</a></li>\n \t<li id=\"u4814-187\"><span id=\"u4814-182\">You?</span> We are currently seeking collaborators and funding so please <a class=\"nonblock\" href=\"http://thefutureoftext.org/join-us.html\" data-href=\"page:U5318\">get in touch</a> if you are interested in contributing</li>\n</ul>\n&nbsp;",
            "name" : "about-jrnl",
            "modified" : "2018-10-19 11:22:28",
            "date" : "2018-10-19 11:22:28",
            "date_gmt" : "2018-10-19 11:22:28"
         }
      },
      "post/162" : {
         "id" : "post/162",
         "type" : "post",
         "title" : "Thoughts on a ‘Publish’ Dialogue Box",
         "data" : {
            "name" : "thoughts-on-a-publish-dialogue-box",
            "modified" : "2018-09-09 12:40:32",
            "html" : "The act of publishing to the web, through WordPress, can be more useful for the reader if the process includes explicit steps for adding meta-information, such as the Category of the post and appropriate Tags.\n\nIn this dialogue, mocked up for possible inclusion in Liquid | Author, the user has a large, clear screen for assigning Categories and adding Tags:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/publish-to-wordpress.png\"><img class=\"aligncenter size-full wp-image-163\" src=\"http://wp.doug/wp-content/uploads/2018/09/publish-to-wordpress.png\" alt=\"\" width=\"2264\" height=\"2135\" /></a>",
            "date" : "2018-09-09 12:40:32",
            "date_gmt" : "2018-09-09 12:40:32",
            "comment_count" : null,
            "modified_gmt" : "2018-09-09 12:40:32",
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=162",
            "excerpt" : ""
         }
      },
      "post/364" : {
         "title" : "10/16/2018: Team meeting",
         "data" : {
            "date_gmt" : "2018-10-17 15:26:12",
            "date" : "2018-10-17 15:26:12",
            "modified" : "2018-10-17 15:26:12",
            "name" : "10-16-2018-team-meeting",
            "html" : "<h3>Participants</h3>\nFrode Hegland\n\nGyuri Lajos\n\nShane Gibson\n\nChristopher Gutteridge\n<h3>Notes</h3>\nThere were some issues with connectivity, but Gyuri and I had a follow-up conversation where we outlined his requirements for the integration with WordPress.org websites and MindGraph.co.",
            "guid" : "https://jrnl.global/?p=364",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-17 15:26:12",
            "mime_type" : ""
         },
         "type" : "post",
         "id" : "post/364"
      },
      "term/32" : {
         "id" : "term/32",
         "data" : {
            "slug" : "doug-engelbart",
            "description" : "",
            "count" : "4"
         },
         "title" : "Doug Engelbart",
         "type" : "post_tag"
      },
      "post/107" : {
         "title" : "Discourse",
         "data" : {
            "name" : "discourse",
            "modified" : "2018-09-03 13:05:35",
            "html" : "Discourse is internet discussion forum.\n\n“Discourse is the 100% open source discussion platform built for the next decade of the Internet. Use it as a mailing list, discussion forum, long-form chat room, and more!”\n<h2>business model</h2>\nPaid for hosting: <a href=\"http://payments.discourse.org/pricing\">payments.discourse.org/pricing</a>\n<h2>\nteam</h2>\nJeff Atwood, co-founder and co-founder of Stack Overflow\nRobin Ward, co-founder\nSam Saffron, co-founder\n<p style=\"text-align: center;\">\n<a href=\"https://www.discourse.org\">discourse.org</a></p>",
            "date_gmt" : "2018-09-03 13:05:35",
            "date" : "2018-09-03 13:05:35",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-03 13:05:35",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=107",
            "excerpt" : ""
         },
         "type" : "post",
         "id" : "post/107"
      },
      "term/44" : {
         "id" : "term/44",
         "type" : "post_tag",
         "title" : "tags",
         "data" : {
            "description" : "",
            "slug" : "tags",
            "count" : "1"
         }
      },
      "comment/38" : {
         "id" : "comment/38",
         "data" : {
            "creator_name" : "Frode Hegland",
            "creator_url" : "http://liquid.info",
            "date_gmt" : "2018-09-10 09:12:45",
            "date" : "2018-09-10 09:12:45",
            "html" : "Hey, thanks for this."
         },
         "title" : "Frode Hegland: Hey, thanks for this.",
         "type" : "comment"
      },
      "term/11" : {
         "id" : "term/11",
         "title" : "News/Updates",
         "data" : {
            "count" : "7",
            "description" : "Announcements related to the jrnl project.",
            "slug" : "news-updates"
         },
         "type" : "category"
      },
      "post/117" : {
         "id" : "post/117",
         "type" : "post",
         "data" : {
            "date" : "2018-09-08 11:46:40",
            "date_gmt" : "2018-09-08 11:46:40",
            "html" : "<a href=\"https://jrnl.global/author/Christopher/\">Christopher Gutteridge</a> and I had a half day work and discussion session on the project.\n<h2>Decisions</h2>\nWe decided that we should work on published documents, not live documents as in Google Docs.\n\nWe further affirmed what may be obvious; that we want to make any additions modular so that anyone can plug any component into their wordpress install without needing the rest.\n\nMajor components of work will a fast query engine and a view engine for a list/timeline view and text interactions when reading a document.\n\n&nbsp;\n<h2>Actions</h2>\nWe plan to hire an external wordpress developer for a reality check before moving further.\n\nI have noted down our priorities as I see them, please feel free to post your thoughts using the Priorities Category if you disagree. Let's try to thread our dialogue around the wordpress system as it is to start with.\n\n<a href=\"http://thefutureoftext.org/jrnl-components-to-build.html\">http://thefutureoftext.org/jrnl-components-to-build.html</a>\n\n&nbsp;\n<h2>Rough Notes</h2>\nLikely not useful to read but added for completeness:\n\n[caption id=\"attachment_126\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1233.jpeg\"><img class=\"wp-image-126 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1233-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /></a> General sketch about a loose document space[/caption]\n\n[caption id=\"attachment_128\" align=\"aligncenter\" width=\"4032\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1235.jpeg\"><img class=\"wp-image-128 size-full\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1235.jpeg\" alt=\"\" width=\"4032\" height=\"3024\" /></a> Notions for how a template could work with an Agenda setting meeting plans and then how it expands to be the basis for minutes, on the right[/caption]\n\n[caption id=\"attachment_127\" align=\"aligncenter\" width=\"700\"]<img class=\"wp-image-127 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1234-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /> Messy notes on what a useful query could be, bottom left and various thoughts.[/caption]\n\n[caption id=\"attachment_122\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1231.jpeg\"><img class=\"wp-image-122 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1231-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /></a> The beginning of trying to list what we can make or build and actions.[/caption]\n\n[caption id=\"attachment_125\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1230.jpeg\"><img class=\"wp-image-125 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1230-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /></a> Extensions for wordpress[/caption]\n\n[caption id=\"attachment_124\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1229.jpeg\"><img class=\"wp-image-124 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1229-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /></a> Basic notes on what's in the document list view and what's in the single page view[/caption]\n\n[caption id=\"attachment_123\" align=\"aligncenter\" width=\"700\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1232.jpeg\"><img class=\"wp-image-123 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/IMG_1232-700x525.jpeg\" alt=\"\" width=\"700\" height=\"525\" /></a> Thoughts on how to deal with different queries[/caption]",
            "modified" : "2018-09-08 11:46:40",
            "name" : "meeting-with-chris-gutteridge-5th-of-sept-2018",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=117",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-08 11:46:40"
         },
         "title" : "Meeting with Chris Gutteridge 5th of Sept 2018"
      },
      "term/34" : {
         "id" : "term/34",
         "data" : {
            "count" : "2",
            "description" : "",
            "slug" : "enhancements"
         },
         "title" : "enhancements",
         "type" : "post_tag"
      },
      "term/46" : {
         "id" : "term/46",
         "title" : "ViewSpec",
         "data" : {
            "count" : "1",
            "slug" : "viewspec",
            "description" : ""
         },
         "type" : "post_tag"
      },
      "comment/1" : {
         "title" : "A WordPress C...: Hi, this is a comment.\nTo get started with mode...",
         "data" : {
            "creator_url" : "https://wordpress.org/",
            "creator_name" : "A WordPress Commenter",
            "date" : "2018-09-19 10:00:07",
            "date_gmt" : "2018-09-19 10:00:07",
            "html" : "Hi, this is a comment.\nTo get started with moderating, editing, and deleting comments, please visit the Comments screen in the dashboard.\nCommenter avatars come from <a href=\"https://gravatar.com\">Gravatar</a>."
         },
         "type" : "comment",
         "id" : "comment/1"
      },
      "comment/14" : {
         "id" : "comment/14",
         "data" : {
            "html" : "<p style=\"text-align:justify;\">Potentially similar to this: <a href=\"https://www.bitchute.com/video/Nu2Cv9fc8cvT/\" rel=\"nofollow\">Hypertext Components: HyperGlossary Capability Prototype for Doug@50</a>? I know, it’s using the web stack and therefore was a waste of time, but surely technical people might get the idea that I could arbitrarily pull in different glossaries and apply it to the text, either by text search or alternatively because there are explicit links/connections made available for given text/glossary combinations, or in other ways, and authors could suggest glossaries, but also researchers, readers, insiders of the field, I myself could publish such glossaries (with or without separate links/connections to existing bodies of text), or I could apply my own, non-public glossary for note taking, so I can collect different definitions whereever I encounter the word in what I’m reading. The prototype is also supposed to demonstrate that I apply different styles/layouts/ViewSpecs (of my own, by the author, publicly shared via a ViewSpec repository/marketplace, made by any group or individual), where again the author can suggest a certain ViewSpec, but if I encounter the work in a different context, they might suggest a different ViewSpec, or I apply my own, etc.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "creator_name" : "skreutzer",
            "creator_url" : "https://skreutzer.de",
            "date_gmt" : "2018-08-25 12:22:21",
            "date" : "2018-08-25 12:22:21"
         },
         "title" : "skreutzer: Potentially similar to this: Hypertext Componen...",
         "type" : "comment"
      },
      "term/16" : {
         "type" : "category",
         "title" : "Recordings",
         "data" : {
            "slug" : "recordings",
            "description" : "",
            "count" : "3"
         },
         "id" : "term/16"
      },
      "post/88" : {
         "id" : "post/88",
         "type" : "post",
         "title" : "Bootstrapping WordPress",
         "data" : {
            "modified" : "2018-08-26 19:12:42",
            "name" : "bootstrapping-wordpress",
            "html" : "Yes, I agree with you <a href=\"https://jrnl.global/2018/08/21/stephan-kreutzer/\">Stephan</a> “<a href=\"https://skreutzer.de/2018/08/26/personal-hypertext-report-6/\">There’s great consensus that the first project of the FTI, the jrnl, should be a WordPress enhancement project. I’m happy with that as a good practical compromise for bootstrapping ourselves”</a>.",
            "date_gmt" : "2018-08-26 19:12:42",
            "date" : "2018-08-26 19:12:42",
            "modified_gmt" : "2018-08-26 19:12:42",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=88",
            "excerpt" : ""
         }
      },
      "post/198" : {
         "id" : "post/198",
         "data" : {
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=198",
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-12 08:47:12",
            "content_filtered" : "",
            "date" : "2018-09-12 08:47:12",
            "date_gmt" : "2018-09-12 08:47:12",
            "html" : "I think the notion of addressing is key for much of the interactions we should build and I have written on it all over the place, particularly on the site <a href=\"http://symbolspace.info\">http://symbolspace.info</a> where I discuss connections and addressability as aspects of the same thing.\n\nFor our jrnl project a high priority is to implement stable way where a reader can cite text in a blog post and have a high expectation that when cited in another blog post or other document, when a subsequent reader chooses to access the citation source, that it will automatically be indicated on the article.\n\nAn important part of this is the use of the high resolution URL. I think that we must have a way for the browser to know where to scroll to in the document and I don’t think that we should develop a browser(s) plugin for this. Therefore there needs to be anchors in the text as the address point the high resolution URL can refer to.\n\nFor this reason I think we should stick with simple paragraph resolution with an automatically added anchor tag at the point of publishing/uploading and then have a selection mechanism (I propose the old hyperwords/liquid blue dot) <a href=\"https://jrnl.global/2018/09/09/rich-text-interaction/\">https://jrnl.global/2018/09/09/rich-text-interaction/ </a>know what anchor is before any selected text and use that as the URL anchor point.\n\nWhat do you all think?\n\nIf we go down this route we will have to define how to add the anchors and I can use <a href=\"http://www.liquid.info\">Liquid | Author's</a> Publish feature to add this so that we can test it.\n<h3>note</h3>\nFor my own future history, this is what my office in our new house looks like now, including a napping little man:\n\n[caption id=\"attachment_200\" align=\"aligncenter\" width=\"2736\"]<a href=\"http://wp.doug/wp-content/uploads/2018/09/DSC5288-2-1.jpg\"><img class=\"size-full wp-image-200\" src=\"http://wp.doug/wp-content/uploads/2018/09/DSC5288-2-1.jpg\" alt=\"\" width=\"2736\" height=\"1824\" /></a> Edgar starting his nap in my office in the early days at Durrington.[/caption]",
            "name" : "jrnl-high-resolution-addressing-implementation",
            "modified" : "2018-09-12 08:47:12"
         },
         "title" : "jrnl High Resolution Addressing Implementation",
         "type" : "post"
      },
      "post/57" : {
         "id" : "post/57",
         "type" : "post",
         "data" : {
            "guid" : "https://jrnl.global/?p=57",
            "excerpt" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-08-24 20:22:46",
            "content_filtered" : "",
            "mime_type" : "",
            "date_gmt" : "2018-08-24 20:22:46",
            "date" : "2018-08-24 20:22:46",
            "name" : "initial-meeting-summary-report",
            "modified" : "2018-08-24 20:22:46",
            "html" : "(As emailed to the team):\n\nThank you to those of you who joined the call and those who tried :-)\n\nWe had a good introductory chat and decided that we will reconvene in two weeks, on the 7th of September at the same time, 5pm UK time, 9am California time.\n\nI will upload the audio recording when I can, we are moving house today and tomorrow so it’s all a bit technically disorganised here right now.\n\nWe decided on starting with EVERYONE writing a blog post on jrnl.global titled “Why Blogging Sucks’ where we outline the problems with current blogging, even if it’s simply a rant, and hopefully from that can add some ideas on how to improve blogging.\n\nThis can be issues in general as well as issues with how we can all work together as a team. There are also things we can do right now to improve blogging by writing better posts–and please don’t think I am being patronising by writing this, it was something which came up in our dialogue–we can think about writing clear Subjects for the posts and writing as well as we can, including one thought per paragraph, in order to make it easier to respond to other’s thoughts.\n\n(If you don’t have an account, please ping me and I’ll set it up. We hope to be able to support different blogs but it’s easier if we all use this one for this project initially)\n\nI will also try to install an auto-email summary system on the site, to help us stay together.\n\nOnward!\n\nFrode Hegland\n<a href=\"http://futureoftext.org/\">futureoftext.org</a>"
         },
         "title" : "Initial Meeting Summary Report"
      },
      "comment/30" : {
         "id" : "comment/30",
         "title" : "skreutzer: So this is obviously a RFC for a ViewSpec. Ther...",
         "data" : {
            "html" : "<p style=\"text-align:justify;\">So this is obviously a RFC for a ViewSpec. There are two ways to spec ViewSpecs: one would be to write one RFC per ViewSpec feature, so different features can be combined into a rendering layout, or to spec a rendering layout as a whole, containing several ViewSpec features. I’m for the first option, otherwise we’ll just create a mess that’s not standardizable and reusable.</p>\n\n<p style=\"text-align:justify;\">“is appended after the date” assumes that there is a date. As of now, we don’t have a RFC that specs a format for text resources or a capability that would describe where a date is supposed to come from, and just expecting that it should be WordPresses format would evoke a whole bunch of comments, so I’m reading the suggestion as “is appended somewhere”.</p>\n\n<p style=\"text-align:justify;\">“The reader can click on this” assumes that a mouse capability is present, which might not be true for all systems, for example terminal environments, e-ink devices or print might not offer such functionality, so I propose that the supersede indicator is purely informational in cases where no confirmation capability can be provided. Acknowledging the indicator is something to be stored by the client.</p>\n\n<p style=\"text-align:justify;\">Any formatting of the indicator text before and after confirmation should be configurable by the user as a general system setting or as part of a session/context configuration, maybe offering a suggestion by the author/source or other sources, but how those settings are managed is part of the general ViewSpec infrastructure and not subject of this RFC, so this RFC only describes that based on the confirmation status of the indicator, the indicator can be visually changed by applying settings that aren’t subject of this RFC.</p>\n\n<p style=\"text-align:justify;\">“view the latest version or to view the version history” is very vague and there are no RFCs yet how the latest version or version history might be managed or rendered, so this RFC suggests that systems that are already able to provide such functionality, are allowed to add it to the supersede indicator in whatever way they’re able to, but it’s not recommended to rely on the availability of these options at the indicator.</p>\n\n<p style=\"text-align:justify;\">I ignore the other suggestions as they’re not related to this ViewSpec feature RFC. To make the ViewSpec feature work, we need another RFC that describes how the supersede indication can be published. Note that this mustn’t necessarily include provisions on how the latest version or version history is related to the indicator, because that would be a whole thing of its own, not coming from the visual design of a ViewSpec feature, but the simple capability to indicate (and have the indication published and retrieved) that a text is outdated is already useful for systems to provide only the latest, not superseded material, or to learn about what resources do not need to be retrieved if the user doesn’t want to look at the historical past.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "creator_url" : "https://skreutzer.de",
            "creator_name" : "skreutzer",
            "date" : "2018-09-09 15:01:44",
            "date_gmt" : "2018-09-09 15:01:44"
         },
         "type" : "comment"
      },
      "post/177" : {
         "id" : "post/177",
         "type" : "post",
         "title" : "Rich Text Interaction / Blue Dot",
         "data" : {
            "html" : "An example interaction to provide server-side specified options for text interactions. Options can include in-blog search, user name recognition and links and more. You can try it live at <a href=\"http://wordpress.liquid.info/a-theoretical-model-for-knowledge-work-symbol-manipulation-4-aug/\">http://wordpress.liquid.info/a-theoretical-model-for-knowledge-work-symbol-manipulation-4-aug/ </a>\n\nIt looks like this:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/animated-popup.gif\"><img class=\"aligncenter size-full wp-image-178\" src=\"http://wp.doug/wp-content/uploads/2018/09/animated-popup.gif\" alt=\"\" width=\"1388\" height=\"933\" /></a>This is currently implemented at wordpress.liquid.info under the original name of ‘<a href=\"https://en.wikipedia.org/wiki/Hyperwords\">hyperwords</a>’ in 2006:\n\nhttp://wordpress.liquid.info/post-14-aug-1403/#hw-item-4130",
            "modified" : "2018-09-09 13:59:49",
            "name" : "rich-text-interaction",
            "date" : "2018-09-09 13:59:49",
            "date_gmt" : "2018-09-09 13:59:49",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-09 13:59:49",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=177"
         }
      },
      "term/6" : {
         "type" : "category",
         "title" : "Functionalities/Features",
         "data" : {
            "count" : "0",
            "slug" : "features",
            "description" : "The functionality we want to build into jrnl."
         },
         "id" : "term/6"
      },
      "post/366" : {
         "id" : "post/366",
         "title" : "fast dynamic views & dynamic displays",
         "data" : {
            "date_gmt" : "2018-10-17 17:09:57",
            "date" : "2018-10-17 17:09:57",
            "html" : "<em>Based on our previous meeting, thinking and talking with Chris, I have noted down an issue of what we are referring to as a rich, dynamic view of blog articles:</em>\n\nI am convinced that in order for the symbol manipulation Doug Engelbart spoke so highly off to be realised, we will have to developed much richer visual authoring and reading environments, both in terms of the visual presentation and the speed and smoothness of interaction. For the jrnl project we have our <a href=\"https://jrnl.global/2018/10/09/9th-december-project-priorities/\">priorities</a> and here are some further thoughts based on our last group chat:\n<h1>Visually Rich</h1>\nI feel that it will be important to use a visually bigger, wider and deeper view than simple blocks of text. The reason for this has been <a href=\"http://wordpress.liquid.info/why-another-word-processor-2/\">explained</a> many times but boils down to applying our occipital lobe to support our prefrontal cortex.\n<h1>Instant Interaction</h1>\nWhat is also crucial is the speed of the interaction. In the same way Doug used the illustration of a skiing downhill to show how important speed of interaction is, I feel that the difference between waiting any amount of time for a visualisation to settle/build will make it a category less useful than something simpler but ‘instant’.\n<h1>Least Effort</h1>\nIt should possible to draw forth what is required in the least energy using way for a trained/experienced user. The <a href=\"http://wordpress.liquid.info/navigation-hypertext-a-call-to-action/\">mental load</a> of authoring and studying is already substantial and the tool cannot add to the load.  There is of course a balance here; the user should invest in learning their tools but this investment should have a clear payoff once basic use of the tool has become become second nature, once <a href=\"http://www.liquidinformation.org/exikiosis.html\">exikiosis</a> has been achieved.\n<h1>Authoring</h1>\nFor example, as I wrote “symbol manipulation Doug Engelbart” above, I should very easily be able to see what I have written on that topic and have a very quick and easy way to link to my previous article/definition/notes.\n\nThe way I do this now is to write my text in Liquid | Author, select that text and use Liquid | Flow to search my own blog. This works ok but the search result on my blog are few and the refining of the search result is not very useful. I believe this could be a great case study for jrnl and visualisation improvement and it maps onto Chris’ ideas of refining queries and Doug’s ViewSpec modifications.\n\nWhat is necessary is for many more articles to be shown (in my current theme it’s just 3) and for me to be able to switch on and off Categories and Tags to refine what I am looking for, then to click to open and copy the URL or to quickly copy the URL from the search results.\n\nIn other words, my research focus at the moment is on finding my own articles when authoring, not as much on trying to understand someone else work. Doug wrote somewhere that it's hard to orient yourself in someone else information and at least as hard to orient yourself in your own information and I cannot find this quote at the moment, which highlight how right he is, since I consider his work part of my core research and therefore should be able to find it in my own 'information space'.\n\nMaybe the start should be a theme experiment?",
            "name" : "fast-dynamic-views-dynamic-displays",
            "modified" : "2018-10-17 17:09:57",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=366",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-17 17:09:57"
         },
         "type" : "post"
      },
      "term/37" : {
         "id" : "term/37",
         "type" : "post_tag",
         "data" : {
            "count" : "1",
            "description" : "",
            "slug" : "hyperwords"
         },
         "title" : "hyperwords"
      },
      "comment/28" : {
         "id" : "comment/28",
         "type" : "comment",
         "data" : {
            "creator_name" : "Why work on Improving our Tools for Thought? &#8211; liquid thoughts",
            "creator_url" : "http://wordpress.liquid.info/why-work-on-improving-our-tools-for-thought/",
            "date" : "2018-10-08 12:17:24",
            "date_gmt" : "2018-10-08 12:17:24",
            "html" : "[&#8230;] to augment our ability to understand and be understood (a recent wording I came across courtesy of Gyuri who referred to Maria Popova) is mis-placed, mis-guided or simply not possible or [&#8230;]"
         },
         "title" : "Why work on I...: [&#8230;] to augment our ability to understand ..."
      },
      "comment/52" : {
         "id" : "comment/52",
         "data" : {
            "creator_url" : "http://wordpress.liquid.info/fast-dynamic-views-dynamic-displays-jrnl-post/",
            "creator_name" : "fast dynamic views &#038; dynamic displays (jrnl post) &#8211; liquid thoughts",
            "date_gmt" : "2018-10-17 17:10:28",
            "date" : "2018-10-17 17:10:28",
            "html" : "[&#8230;] I have posted on jrn.global a post about fast dynamic views &amp; dynamic displays: https://jrnl.global/2018/10/17/fast-dynamic-views-dynamic-displays/ [&#8230;]"
         },
         "title" : "fast dynamic ...: [&#8230;] I have posted on jrn.global a post ab...",
         "type" : "comment"
      },
      "post/42" : {
         "id" : "post/42",
         "data" : {
            "html" : "Hi all,\n\nI have added a Google Spreadsheet here: <a href=\"https://docs.google.com/spreadsheets/d/1ZTzI92scoLm873zzrxUwt5GlNo27Q1owK62rWq9c_Gs/edit#gid=0\">https://docs.google.com/spreadsheets/d/1ZTzI92scoLm873zzrxUwt5GlNo27Q1owK62rWq9c_Gs/edit#gid=0</a>\n\nPlease have a look and write your name next to any functionality you feel is important to work on now.",
            "modified" : "2018-08-22 09:16:19",
            "name" : "votes-for-initial-priotities",
            "date" : "2018-08-22 09:16:19",
            "date_gmt" : "2018-08-22 09:16:19",
            "mime_type" : "",
            "modified_gmt" : "2018-08-22 09:16:19",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=42"
         },
         "title" : "Votes for Initial Priorities",
         "type" : "post"
      },
      "comment/21" : {
         "title" : "skreutzer: 5:20 Having participated in the Doug@50 group (...",
         "data" : {
            "creator_url" : "https://skreutzer.de",
            "creator_name" : "skreutzer",
            "date_gmt" : "2018-08-26 19:07:46",
            "date" : "2018-08-26 19:07:46",
            "html" : "<p style=\"text-align:justify;\"><a href=\"https://www.youtube.com/watch?v=K-m5lhUjbnU#t=5m20s\" rel=\"nofollow\">5:20</a> Having participated in the <a href=\"https://doug-50.info\" rel=\"nofollow\">Doug@50 group</a> (but not the earlier MOAD group [<a href=\"https://groups.google.com/forum/#!forum/dkr2\" rel=\"nofollow\">1</a>, <a href=\"https://groups.google.com/forum/#!forum/dkr2\" rel=\"nofollow\">2</a>]), I don’t understand why Houria Iderkou should be frustrated, I also don’t think that the Doug@50 group got hijacked by the knowledge graph community, my impression is that it was a deliberate group decision based on the existing components the participants had already, so if there should be an potentially amazing, groundbreaking result for the demo day on 2018-12-09, the 50th anniversary of Doug Engelbart’s great demo, that was and still is the most reasonable thing to do. It’s designed to be a result in Doug’s spirit, less concerned about recreating the past or doing long, basic research as the Augmentation Research Center did, but more focusing on what’s needed for solving urgent, complex world problems. I personally are suspicious about machines understanding knowledge, be it for reasoning or learning or federating, I don’t care much about the exact identity of topics/concepts, but more about the semantic categories/types at first to interpret and apply ViewSpecs on top of them, as the first step to improve from there. I’m uncomfortable with servers doing the curation, I lament the lack of tools for knowledge workers to work on the material manually, as it’s subject of social, human discourse. I want/need capabilities to work with basic, plain text (at first). The richness in that space of earlier days has been lost, as it seems to me. Anyhow, it’s not that I have a lot of knowledge-supporting tools already and there was no way to connect my stuff with the web model or to bootstrap something for linked data platforms. I also discovered that Frode probably doesn’t share this perspective, the document world might be a separate one just as well.﻿</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>"
         },
         "type" : "comment",
         "id" : "comment/21"
      },
      "user/1" : {
         "type" : "user",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/6ace81a8eaf2f4997e054f8d19b0e0a2"
         },
         "title" : "cjgdisplay",
         "id" : "user/1"
      },
      "post/303" : {
         "type" : "post",
         "title" : "Gyuri Lajos",
         "data" : {
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-08 06:45:19",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=303",
            "excerpt" : "",
            "name" : "gyuri-lajos",
            "modified" : "2018-10-08 06:45:19",
            "html" : "My <a href=\"https://www.linkedin.com/in/gyuri-lajos/\">Linked in Profile</a>   will have to do for the moment along with this post here on <a href=\"https://jrnl.global/2018/09/07/why-blogging-sucks/\">Why Blogging Sucks</a>\n\n<img class=\"size-medium wp-image-309 aligncenter\" src=\"http://wp.doug/wp-content/uploads/2018/10/overviewListing-300x300.png\" alt=\"\" width=\"300\" height=\"300\" />\n\n<img class=\"size-medium wp-image-308 aligncenter\" src=\"http://wp.doug/wp-content/uploads/2018/10/overviewGraph-269x300.png\" alt=\"\" width=\"269\" height=\"300\" />\n\n&nbsp;",
            "date_gmt" : "2018-10-08 06:45:19",
            "date" : "2018-10-08 06:45:19"
         },
         "id" : "post/303"
      },
      "post/2" : {
         "type" : "page",
         "title" : "Sample Page",
         "data" : {
            "date_gmt" : "2018-09-19 10:00:07",
            "date" : "2018-09-19 10:00:07",
            "modified" : "2018-09-19 10:00:07",
            "name" : "sample-page",
            "html" : "This is an example page. It's different from a blog post because it will stay in one place and will show up in your site navigation (in most themes). Most people start with an About page that introduces them to potential site visitors. It might say something like this:\n\n<blockquote>Hi there! I'm a bike messenger by day, aspiring actor by night, and this is my website. I live in Los Angeles, have a great dog named Jack, and I like pi&#241;a coladas. (And gettin' caught in the rain.)</blockquote>\n\n...or something like this:\n\n<blockquote>The XYZ Doohickey Company was founded in 1971, and has been providing quality doohickeys to the public ever since. Located in Gotham City, XYZ employs over 2,000 people and does all kinds of awesome things for the Gotham community.</blockquote>\n\nAs a new WordPress user, you should go to <a href=\"http://wp.doug/wp-admin/\">your dashboard</a> to delete this page and create new pages for your content. Have fun!",
            "guid" : "http://wp.doug/?page_id=2",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-19 10:00:07",
            "mime_type" : ""
         },
         "id" : "post/2"
      },
      "term/22" : {
         "title" : "Annotation",
         "data" : {
            "count" : "0",
            "slug" : "reading2annotate",
            "description" : "Annotating via highlights of colour or textual meaning for the benefit of the reader or the reader and their peer community."
         },
         "type" : "category",
         "id" : "term/22"
      },
      "term/26" : {
         "type" : "post_tag",
         "title" : "addressing",
         "data" : {
            "count" : "1",
            "description" : "",
            "slug" : "addressing"
         },
         "id" : "term/26"
      },
      "comment/50" : {
         "title" : "Agenda, 8 Oct...: [&#8230;] have posted a rough data flow diagram...",
         "data" : {
            "html" : "[&#8230;] have posted a rough data flow diagram here to help us discuss [&#8230;]",
            "date_gmt" : "2018-10-08 13:44:25",
            "date" : "2018-10-08 13:44:25",
            "creator_url" : "https://jrnl.global/2018/10/07/agenda-chris-shane/",
            "creator_name" : "Agenda, 8 October 2018 &#8211; jrnl"
         },
         "type" : "comment",
         "id" : "comment/50"
      },
      "post/1" : {
         "type" : "post",
         "data" : {
            "name" : "hello-world",
            "modified" : "2018-09-19 10:00:07",
            "html" : "Welcome to WordPress. This is your first post. Edit or delete it, then start writing!",
            "date_gmt" : "2018-09-19 10:00:07",
            "date" : "2018-09-19 10:00:07",
            "modified_gmt" : "2018-09-19 10:00:07",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "http://wp.doug/?p=1",
            "excerpt" : ""
         },
         "title" : "Hello world!",
         "id" : "post/1"
      },
      "comment/49" : {
         "title" : "Sketch first ...: [&#8230;] is where we are after the first call,...",
         "data" : {
            "date_gmt" : "2018-10-08 16:56:28",
            "date" : "2018-10-08 16:56:28",
            "creator_url" : "https://jrnl.global/2018/10/08/sketch-first-sprint-work-breakdown-structure-rev-after-call/",
            "creator_name" : "Sketch first Sprint work breakdown structure (rev after call) &#8211; jrnl",
            "html" : "[&#8230;] is where we are after the first call, working on making this into small, implementable components, based on the first [&#8230;]"
         },
         "type" : "comment",
         "id" : "comment/49"
      },
      "term/28" : {
         "id" : "term/28",
         "data" : {
            "description" : "",
            "slug" : "categories",
            "count" : "1"
         },
         "title" : "categories",
         "type" : "post_tag"
      },
      "term/14" : {
         "id" : "term/14",
         "title" : "Priorities",
         "data" : {
            "count" : "6",
            "description" : "Discussions of the priorities for development.",
            "slug" : "priorities"
         },
         "type" : "category"
      },
      "post/189" : {
         "id" : "post/189",
         "type" : "post",
         "title" : "Component overview",
         "data" : {
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-10 17:02:46",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=189",
            "excerpt" : "",
            "name" : "component-overview",
            "modified" : "2018-09-10 17:02:46",
            "html" : "In response to recent email discussion, I would suggest the following as independent components, or wordpress plugins to develop, but in a way which they plan nice with eacth other. Please feel free to comment and/or copy and do your own list for discussion, I am just throwing this out here. There is a lot to do in the future, as listed on the <a href=\"http://thefutureoftext.org/jrnl-components-to-build.html\">thefutureoftext.org/jrnl-components-to-build.html</a> page but this seems like our start:\n<h2>Timeline View</h2>\n<ul>\n \t<li><strong>Search Component.</strong> Chris adds: ”a way to refer to WP elements in a standardised way and an API to query those with a very light graph querying system that could be replaced later”</li>\n \t<li><strong>View Component</strong> with visual controls for the view and the search/query</li>\n</ul>\n<h2>Document View</h2>\n<ul>\n \t<li><strong>The interaction means for doing the below,</strong> both keyboard shortcut list and the ‘<a href=\"https://jrnl.global/2018/09/09/rich-text-interaction/\">blue dot</a>’ mouse interaction. I am working on this now.</li>\n</ul>\n<ul>\n \t<li><strong>ViewSpec support</strong> (change layout, including <a href=\"https://jrnl.global/2018/09/09/visual-syntactic-text-formatting/\">Flow</a> and Show only sentences with keywords)</li>\n \t<li><strong>Means for searching</strong> based on selected text</li>\n \t<li><strong>Means for Copying as Citation,</strong> including high resolution addressing</li>\n \t<li><strong>Means for creating, storing and accessing <a href=\"http://thefutureoftext.org/hyperglossary.html\">hyperGlossary</a> entries</strong></li>\n</ul>\n&nbsp;\n\n&nbsp;",
            "date_gmt" : "2018-09-10 17:02:46",
            "date" : "2018-09-10 17:02:46"
         }
      },
      "term/20" : {
         "title" : "ViewSpecs",
         "data" : {
            "slug" : "richreadingviewspec",
            "description" : "Providing a flexible view where the user can control the presentation of the article, including collapsing into outline modes, expanding into Flow mode, colour coding of key text and more.",
            "count" : "11"
         },
         "type" : "category",
         "id" : "term/20"
      },
      "post/317" : {
         "id" : "post/317",
         "data" : {
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-10-08 15:31:34",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=317",
            "excerpt" : "",
            "name" : "sketch-first-sprint-work-breakdown-structure",
            "modified" : "2018-10-08 15:31:34",
            "html" : "Exploring what could we build together for the 9th of December demo\n<div></div>\n<div><i>This is an experiment to see if it is possible to manually publish to word press from the MindGraph plain HTML.</i></div>\n<div></div>\n<div><i> Then experiment with HRSHTML</i></div>\n<div><a href=\"https://jrnl.global/2018/10/05/9th-december-my-priorities/\">9th December, my Priorities – jrnl</a>\n\n</div>\n<div></div>\n<div><a href=\"http://www.liquid.info/\">Liquid Information</a>\n\n</div>\n<div></div>\n<div><a href=\"http://wordpress.liquid.info/publish-from-author-to-wordpress-high-resolution-addressing/\">Publish from Author to WordPress : High Resolution Addressing – liquid thoughts</a>\n\n</div>\n<div></div>\n<div>identifying what could we demo within two weeks</div>\n<h2>Existing capabilities</h2>\n<div>\n<ol>\n \t<li>Author\n<ol>\n \t<li>export to WordPress</li>\n</ol>\n</li>\n \t<li>MindGraph\n<ol>\n \t<li>Roundtrip\n<a href=\"High Resolution structured HTML\">High Resolution Structured HTML</a>\ninto MindGraph</li>\n \t<li>Graph visualization, Manipulation</li>\n \t<li>Right Thought Editing</li>\n</ol>\n</li>\n \t<li>Grap</li>\n</ol>\n</div>\n<h2>First Sprint</h2>\n<div>Capabilities that could possibly be completed within two weeks</div>\n<div></div>\n<div>\n<ol>\n \t<li>MindGraph\n<ol>\n \t<li>Import HRSHTML from WordPress</li>\n \t<li>Export HRSHTML to WordPress</li>\n</ol>\n</li>\n \t<li>WordPress Plugin\n<ol>\n \t<li>Providing a script loadable Javascript client that handles\n<ol>\n \t<li>Authentication to wordpress</li>\n \t<li></li>\n \t<li>Get/Post/Search Posts, glossary entries as HRSHTML</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n&nbsp;\n\n</div>\n<div></div>\n<h2>Architecture</h2>\n<div></div>\n<div></div>",
            "date" : "2018-10-08 15:31:34",
            "date_gmt" : "2018-10-08 15:31:34"
         },
         "title" : "Sketch first Sprint work breakdown structure",
         "type" : "post"
      },
      "comment/20" : {
         "id" : "comment/20",
         "title" : "skreutzer: This is so incredibly amazing: to have it, to h...",
         "data" : {
            "html" : "<p style=\"text-align:justify;\">This is so incredibly amazing: to have it, to have it on YouTube, and being public! One advantage is that we get the automatically created transcript from Google/YouTube (I guess I can’t, but you as the uploader can download it in it’s entirety, even in quite usable formats, so that’s something we could work with/on). I would very much like to do the <a href=\"https://timebrowser.info\" rel=\"nofollow\">TimeBrowser</a> thing in parallel (as those recordings are material and proceedings of the FTI and part of the group’s Journal and research “results”), but with the first, basic technical aspects of recording, publishing and transcribing already solved, the social/legal problems also need to be addressed: can the implicitly assumed agreement of the recording being published be established with all of the participants (usually you inform them at the beginning or end of a recording, and everybody who joins later, that they should express consent or object otherwise in the call itself)? You put it under the standard YouTube license, which is a restrictive license, can we get explicit permission from all participants to put the recording under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons BY-SA 4.0</a> (maybe 3.0 as well for compatibility with the large body under 3.0 like Wikipedia, maybe with a “+ any later version” clause to get a path to upgrading, but then there’s not too much trust towards Creative Commons that they will do “the good thing” with future licenses as they didn’t explicitly express so and also house/advocate restrictive licenses)? YouTube by the way only supports the CC BY (3.0?). Those are questions regarding the human side policies, and while people tend to play nicely (granting each other blanket permissions to do things with the commons of the community) when it comes to collaboratively build software in large groups or writing an online encyclopedia, maybe they’re more hesitant when it comes to their communication, writing, the handbook because they feel less pain and restrictions if all that we’re doing is only passively reading/consuming it, not doing any actual knowledge work and augmentation besides using the words to manipulate our brains/thinking.</p>\n\n<p style=\"text-align:justify;\">There’s not much incentive to do the TimeBrowser thing with this recording if it can be taken away from with-under me, or if I’m legally prevented to do reasonable things (like re-publication, annotation, etc. etc.), so it would be of little to no use other than to use it as example material for developing the capability, for which I could use any other recording on YouTube just as well (including my own uploads which need to be worked on in that manner, it’s just not containing dialogue, that’s all).</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "date" : "2018-08-25 11:19:55",
            "date_gmt" : "2018-08-25 11:19:55",
            "creator_url" : "https://skreutzer.de",
            "creator_name" : "skreutzer"
         },
         "type" : "comment"
      },
      "post/113" : {
         "type" : "post",
         "data" : {
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=113",
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-04 11:01:21",
            "content_filtered" : "",
            "date_gmt" : "2018-09-04 11:01:21",
            "date" : "2018-09-04 11:01:21",
            "html" : "<p style=\"text-align:justify;\">A <a href=\"https://en.wikipedia.org/wiki/Executive_summary\">summary</a>/<a href=\"https://en.wikipedia.org/wiki/Abstract_(summary)\">abstract</a> capability can be implemented like this:</p>\n\n<pre>&lt;summary&gt;This is a summary.&lt;/summary&gt;</pre>\n\n<p style=\"text-align:justify;\">In compliance with a <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/summary\">HTML 5.1 proposal</a>, it’s also allowed to be wrapped in a <code>&lt;details&gt;</code> tag,</p>\n\n<pre>&lt;details&gt;\n  &lt;summary&gt;This is a summary.&lt;/summary&gt;\n&lt;/details&gt;</pre>\n\n<p style=\"text-align:justify;\">although this form isn’t recommended and a transitional provision for the time no semantical identifier has been assigned yet. Clients are free to ignore the <code>&lt;details&gt;</code> wrapping. Clients are also free to ignore any other tags within <code>&lt;summary&gt;</code>, the expectation is that the text nodes regardless of other tag encapsulation will be rendered.</p>\n\n<p style=\"text-align:justify;\">It might be important to point out that this RFC doesn’t imply that semantic meaning is derived from the HTML 5.1 proposal as it remains to be seen if it enters the standard, and this RFC deliberately ignores everything that is proposed in the context of a “living standard”. Summaries created according to this RFC are limited to the semantic meaning and function as outlined in this RFC.</p>\n\n<p style=\"text-align:justify;\">This capability can be used in combination with other capabilities and policies. For example, it could be anticipated that users/groups define a maximum length that is allowed for the text, or mechanisms to manually or automatically decide which text summarizes a given work best. A summary according to this RFC can be incorporated into the work itself or can be published independently. For now, it is expected that such summaries will be used to provide a little bit more detail about a resource in a list of resources, so it gets easier for the reader of such list to decide which resources to retrieve and look at, and which to skip.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "name" : "rfc-summary-data-formats",
            "modified" : "2018-09-04 11:01:21"
         },
         "title" : "RFC: Summary Data Formats",
         "id" : "post/113"
      },
      "post/165" : {
         "type" : "post",
         "title" : "Authoring Version Control, Comments & Layout",
         "data" : {
            "html" : "Taking the layout of this blog as the starting point, I have looked at how to indicate that an article has been superseded. In this design the text 'This Article has been superseded' is appended after the date, with a reveal triangle.\n\nThe reader can click on this to get options to simply acknowledge this (OK), and the red text becomes light grey, to view the latest version or to view the version history.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/post.jpg\"><img class=\"aligncenter wp-image-171 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/post-700x415.jpg\" alt=\"\" width=\"700\" height=\"415\" /></a>\n<h3>Design</h3>\nOther design thoughts in this mock-up are having next and previous post buttons be on the right side of the screen so as to follow the logic of scrolling back and forth.\n\nThere are no lists of Categories here, they are for the <a href=\"https://jrnl.global/2018/09/08/timeline/\">Timeline</a> view.\n<h3>Commenting</h3>\nThe Commenting system has been removed, in an effort to make comments be full posts with high resolution addressing in citation. Any comment with Pingbacks will be listed at the bottom of the screen. The reader can click to expand to show more (full or partial post) and have further options when expanded to jump to the article.\n\n&nbsp;",
            "modified" : "2018-09-09 13:10:26",
            "name" : "authoring-version-control",
            "date" : "2018-09-09 13:10:26",
            "date_gmt" : "2018-09-09 13:10:26",
            "mime_type" : "",
            "modified_gmt" : "2018-09-09 13:10:26",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=165"
         },
         "id" : "post/165"
      },
      "term/40" : {
         "type" : "post_tag",
         "title" : "Liquid | Author",
         "data" : {
            "slug" : "liquid-author",
            "description" : "",
            "count" : "1"
         },
         "id" : "term/40"
      },
      "post/263" : {
         "id" : "post/263",
         "type" : "post",
         "title" : "Basic Features, 20 Sep",
         "data" : {
            "date_gmt" : "2018-09-20 12:14:14",
            "date" : "2018-09-20 12:14:14",
            "modified" : "2018-09-20 12:14:14",
            "name" : "basic-features-20-sep",
            "html" : "In order for the jrnl project to reflect Doug Engelbart’s thinking we need to provide high-resolution addressability, ViewSpecs and some level of simple versioning.\n\nHigh resolution addressing will be met to a minimum requirement by having paragraph level addressability and higher resolution if we can incorporate it.\n<h1>High Resolution Addressing</h1>\n<h2>Authoring High Resolution Links</h2>\nThis means that we will need to provide a means through which we add anchors to the text and we need to decide if it should be by the authoring client or through a server plugin.\n<h2>Using High Resolution Links</h2>\nWe further need to make our text selection system ‘see’ the nearest higher anchor and incorporate it into the clipboard when user chooses Copy As Citation through our <a href=\"http://wordpress.liquid.info/macos-x-text-draft-proposal-post-18-sep-2018/\">http://wordpress.liquid.info/macos-x-text-draft-proposal-post-18-sep-2018/</a> blue dot system.\n<h1>ViewSpec</h1>\nThe basic ViewSpecs we should have is what we call Flow <a href=\"http://wordpress.liquid.info/vstf/\">http://wordpress.liquid.info/vstf/</a> which expands and contracts the text and the Liquid | Author style Find: <a href=\"http://www.liquid.info\">http://www.liquid.info</a> where user selects text and chooses Find and only sentences with the selected text are displayed.\n<h1>Versioning</h1>\nWe should have a plugin which appears on pages and specifies if there is a new version, with a link to the new version.\n\n&nbsp;",
            "guid" : "https://jrnl.global/?p=263",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-20 12:14:14",
            "mime_type" : ""
         }
      },
      "user/3" : {
         "id" : "user/3",
         "type" : "user",
         "title" : "Mark Anderson",
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/9d4572372f6171b0c534f19107b4c0f4"
         }
      },
      "comment/22" : {
         "title" : "skreutzer: 4:48 Hmm, I wonder if we can promise that it wi...",
         "data" : {
            "html" : "<p style=\"text-align:justify;\"><a href=\"https://www.youtube.com/watch?v=K-m5lhUjbnU#t=4m48s\" rel=\"nofollow\">4:48</a> Hmm, I wonder if we can promise that it will work yet. We have examples and indications from earlier systems that it might, but there is no guarantee that we can pull it off technologically or socio-politically. If it would be less risky, the web wouldn’t be the only paradigm around. Maybe we can declare victory if we can get something small working for ourselves, to solve some of our own problems, and then go from there, or also see it as a success to find out and learn precisely why it can’t work? I don’t want to constrict the ambition without need, but to be realistic and prevent disappointment, it’s not that I managed to forsee the future and know exactly what will happen. We’re just starting, have many and potentially different ideas, so open-end research/experimentation is needed to figure things out. If it is about the 50th anniversary of Doug Engelbarts great demo, what can we do in only three months that in any way resembles an aspect of Doug’s vision or approach? I’m a little suspicious, from experience things turn out to be harder than they look at first. On the other hand, we can’t allow worries to damage the confidence we need to pretend to have as some kind of a mental trick, just to be able to do anything in the field at all and thus leading to progress rather than failure hopefully.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "creator_name" : "skreutzer",
            "creator_url" : "https://skreutzer.de",
            "date_gmt" : "2018-08-27 23:50:24",
            "date" : "2018-08-27 23:50:24"
         },
         "type" : "comment",
         "id" : "comment/22"
      },
      "post/155" : {
         "type" : "post",
         "title" : "Implicit Linking",
         "data" : {
            "mime_type" : "",
            "modified_gmt" : "2018-09-08 14:45:15",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=155",
            "html" : "Let users select any arbitrary text and perform searches based on the text, such as we have experimented with for <a href=\"http://www.liquid.info/liquid.html\">Liquid | Flow</a> and in wordpress here <a href=\"http://wordpress.liquid.info/post-14-aug-1403/\">wordpress.liquid.info</a> both of which are already developed and owned by us. <a href=\"https://jrnl.global/2018/09/09/rich-text-interaction/\">A blog post with illustration of the blue dot</a>.\n\nThis is a Doug Engelbart Term.\n\n<a href=\"https://www.theguardian.com/technology/2004/nov/18/onlinesupplement\">https://www.theguardian.com/technology/2004/nov/18/onlinesupplement</a>\n\n<p style=\"text-align: center;\"> jrnl post Category: <a href=\"https://jrnl.global/category/dynamic-search-lookups/\">Implicit Linking</a>",
            "name" : "implicit-linking",
            "modified" : "2018-09-08 14:45:15",
            "date" : "2018-09-08 14:45:15",
            "date_gmt" : "2018-09-08 14:45:15"
         },
         "id" : "post/155"
      },
      "term/39" : {
         "data" : {
            "count" : "1",
            "slug" : "issues",
            "description" : ""
         },
         "title" : "issues",
         "type" : "post_tag",
         "id" : "term/39"
      },
      "term/2" : {
         "type" : "category",
         "data" : {
            "count" : "5",
            "description" : "",
            "slug" : "glossary-term"
         },
         "title" : "[Glossary Term]",
         "id" : "term/2"
      },
      "comment/34" : {
         "title" : "An end of sum...: [&#8230;] What I feel would be the minimum feat...",
         "data" : {
            "date_gmt" : "2018-10-03 21:01:37",
            "date" : "2018-10-03 21:01:37",
            "creator_name" : "An end of summer update &#8211; liquid thoughts",
            "creator_url" : "http://wordpress.liquid.info/an-end-of-summer-update/",
            "html" : "[&#8230;] What I feel would be the minimum features inspired by Doug to demonstrate (as in show fully working and let people download and install as robust plugins for their own wordpress setup) are high resolution addressability (in the form of the ability to Copy As Citation which provides at least a paragraph level address in the form of an anchor so that anyone can use the link in any context and it will work) and some ViewSpecs, likely an Author style Find In Page (which re-draws the page to show only sentences with the selected text) and/or Flow (which redraws the text with line breaks after , and double line breaks after . as discussed in: https://jrnl.global/2018/09/09/visual-syntactic-text-formatting/ [&#8230;]"
         },
         "type" : "comment",
         "id" : "comment/34"
      },
      "comment/32" : {
         "id" : "comment/32",
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] support (change layout, including Flow and Show only sentences with [&#8230;]",
            "creator_name" : "Component overview &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/09/10/component-overview/",
            "date" : "2018-09-10 17:02:49",
            "date_gmt" : "2018-09-10 17:02:49"
         },
         "title" : "Component ove...: [&#8230;] support (change layout, including Flo..."
      },
      "comment/41" : {
         "title" : "Teodora Petkova: Hello, Alexander! The project sounds great! Thi...",
         "data" : {
            "creator_name" : "Teodora Petkova",
            "creator_url" : "",
            "date_gmt" : "2018-09-18 12:54:55",
            "date" : "2018-09-18 12:54:55",
            "html" : "Hello, Alexander! The project sounds great! This might be helpful too: https://ontotext.com/publishers-big-linked-data-opportunities/\nEdited: This Amit Sheth's project might also prove interesting! <a href=\"http://knoesis.org/node/2066\" rel=\"nofollow\">Semantic Enhancement Engine: A Modular Document Enhancement Platform for Semantic Applications over Heterogeneous Content </a>"
         },
         "type" : "comment",
         "id" : "comment/41"
      },
      "term/10" : {
         "type" : "category",
         "title" : "Meetings",
         "data" : {
            "description" : "",
            "slug" : "meeting",
            "count" : "9"
         },
         "id" : "term/10"
      },
      "comment/8" : {
         "title" : "Personal Hype...: [&#8230;] else broke the parsing of the jrnl la...",
         "data" : {
            "html" : "[&#8230;] else broke the parsing of the jrnl launch meeting announcement (for Friday 24th of August 2018) post: welcome to the wpautop() function of WordPress! “autop” stands for “auto paragraph” [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/08/26/personal-hypertext-report-6/",
            "creator_name" : "Personal Hypertext Report #6 &#8211; jrnl",
            "date" : "2018-08-26 04:11:41",
            "date_gmt" : "2018-08-26 04:11:41"
         },
         "type" : "comment",
         "id" : "comment/8"
      },
      "term/15" : {
         "type" : "category",
         "title" : "Publishing Options",
         "data" : {
            "count" : "7",
            "slug" : "publishingoptions",
            "description" : "Usefully tagged and Categorised articles become more findable and useful in the future because there are more dimensions to find them along. Therefore imposing a(optional for Admin to choose to enable) ‘Publish’ screen where the author has to choose the appropriate Category and tags. "
         },
         "id" : "term/15"
      },
      "post/217" : {
         "id" : "post/217",
         "title" : "Blue Dot Menu Design",
         "data" : {
            "date_gmt" : "2018-09-14 11:22:18",
            "date" : "2018-09-14 11:22:18",
            "html" : "Guys, this is what we are doing with testing so that we have an interaction means to test some of the work we are looking into. Please comment.\n\nThe blue dot, carried over from <a href=\"http://wordpress.liquid.info\">http://wordpress.liquid.info</a> (originally the Hyperwords dot) is being tested as an interaction means for the jrnl.\n\nThe menu is being modified to not have the highlighted character, no sub menu, one menu break and no bottom 'brand' section.\n<h3>Menu Items</h3>\nThe menu items for first testing should be:\n<ul>\n \t<li>Search this site</li>\n \t<li>Google</li>\n \t<li>Wikipedia</li>\n \t<li>Images (google images)\n<em>– break, to be shown as an empty line, maybe later modified in height or with line –</em></li>\n \t<li>Copy As Citation (copies text and 'finds' the first anchor tag in the selection, or after, and uses it for the URL)</li>\n \t<li>Flow (<a href=\"https://jrnl.global/2018/09/09/visual-syntactic-text-formatting/\">flows</a> the selected text or full page. We will need to test)</li>\n</ul>\n<h3>Visual Style</h3>\nWe will continue this visual style after testing alternatives and noticing the macOS, with Dark Mode, actually has two different contextual menus so we are not going to customise based on OS (mac/windows etc.):\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.22.56.png\"><img class=\"aligncenter size-full wp-image-221\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.22.56.png\" alt=\"\" width=\"1306\" height=\"258\" /></a>\n\nmacOS Light mode:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.25.09.png\"><img class=\"aligncenter size-full wp-image-225\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.25.09.png\" alt=\"\" width=\"1398\" height=\"402\" /></a>\n\nmacOS Dark mode:<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.24.38.png\"><img class=\"aligncenter size-full wp-image-224\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.24.38.png\" alt=\"\" width=\"1362\" height=\"400\" /></a>Neutral test version:\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.30.45.png\"><img class=\"aligncenter size-full wp-image-228\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot-2018-09-14-at-12.30.45.png\" alt=\"\" width=\"1208\" height=\"378\" /></a>",
            "modified" : "2018-09-14 11:22:18",
            "name" : "blue-dot-menu-design",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=217",
            "mime_type" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-14 11:22:18"
         },
         "type" : "post"
      },
      "post/372" : {
         "id" : "post/372",
         "data" : {
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-18 14:58:03",
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=372",
            "html" : "We need to focus more on what we can do with the blue dot menu and what we need to re-code and what effort that will be. I had to leave early which was a shame but Marc-Antoine and Robert joined us.\n\nWe will also need to design all the functionality we feel should be done:\n<h1>Copy As Citation</h1>\nShane is using Chris' code for this. What effort is left? Also, can we simply add to the Copy command so it's always copied as citation with high resolution addressing?...\n<h1>Dynamic List View</h1>\nChris would like to build a powerful list view for queries. Frode would like this as well but feels we can start with more powerful templates. Chris would like to work on search and Frode on authoring where this view is to help the author find text within their own work or that of their known research.\n<h1>hyperGlossary</h1>\nWe all are interested in the hyperGlosssry and need to know how Gyuri's world fits into this or if he would like to contribute something different.\n<h1>Graph to start dialogue as to what should happen</h1>\n<a href=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-19-at-00.59.19.png\"><img class=\"aligncenter size-full wp-image-384\" src=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-19-at-00.59.19.png\" alt=\"\" width=\"2524\" height=\"1612\" /></a>",
            "name" : "thursday-18th-of-october-call",
            "modified" : "2018-10-18 14:58:03",
            "date" : "2018-10-18 14:58:03",
            "date_gmt" : "2018-10-18 14:58:03"
         },
         "title" : "Thursday 18th of October call",
         "type" : "post"
      },
      "comment/24" : {
         "id" : "comment/24",
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] sense to not only publish/distribute it via my own dedicated machine, but also to submit it to the FTI jrnl under Frode’s control. Sure, such practice is totally stupid because we don’t have a capability [&#8230;]",
            "date_gmt" : "2018-09-22 20:01:41",
            "date" : "2018-09-22 20:01:41",
            "creator_name" : "Personal Hypertext Report #7 &#8211; skreutzer’s Blog",
            "creator_url" : "https://skreutzer.de/2018/09/09/personal-hypertext-report-7/"
         },
         "title" : "Personal Hype...: [&#8230;] sense to not only publish/distribute ..."
      },
      "post/257" : {
         "id" : "post/257",
         "type" : "post",
         "data" : {
            "html" : "When presenting <a href=\"http://dougengelbart.org/pubs/augment-133320.html\">the keynote address</a> at the World Library Summit in Singapore in 2002, Doug Engelbart remarked on his impression of the computer when he first came across it. This was in the era when computers were still used simply to compute, to crunch numbers. He said:\n<h1>symbols</h1>\n“I saw that we have a tool that does not just move earth or bend steel, but we have a tool that actually can manipulate symbols and, even more importantly, portray symbols in new ways, so that we can interact with them and learn. We have a tool that radically extends our capabilities in the very area that makes us most human, and most powerful.”\n\nThis session is on symbol manipulation and I would like to highlight a basic and fundamental aspect of symbol manipulation, but first, an apology:\n\nI missed the 1968 demo since I was only 6 months old at the time.\n\nHowever, as I now see in my beautiful baby boy Edgar, I was already way on my way to working on one of the most fundamental aspects of interaction: Pointing.\n\nAs I see in my beautiful baby boy Edgar, it doesn’t take long after entering this world to start to look at things and then to point at them as a means of establishing a link to what ones attention is focused on.\n\nThis is natural, this arises out of our evolution. We are not separate from our environment, we are intrinsically tied to our environment–we want to reach out and touch. This is truly fundamental, this is crucial. As we as a species we are moving into working and living more in the digital realm we need to provide the means to point at the symbols we use in our work, primarily in the form of text:\n\nPointing is how we move our information components, usually text, around on our displays.\nPointing at them is how we can choose to portray the information.\nPointing is the highlighting of–and making of–connections.\nPointing is of course also how the symbols get their meaning and this is of course significant.\n\nAll the text on our displays, all the words and all the sentences, point to, link to, associate with (all words to describe pointing to different degrees) other words and some point to entities in the world. Some digital text even have an explicit link attached to them, as indicated traditionally with a line under the text and often blue colour.\n\nThis is where we are now, primarily. Doug also spoke of implicit links (that is to say, links to a word’s entry in a dictionary for example), link types, high resolution linking, backlink databases and more.\n\nThis connective aspect of text is massively important and in the digital environment the connective aspect can be powerfully extended. We can point better.\n<h1>addressable / identifiable</h1>\nWhat we point to must exist in some location, somewhere addressable. That location can be based on an addressing scheme or it can be based on identifying addressable characteristics, such as their names, contents or any other attribute. The important thing is that whatever points to it must have access to these attributes. Otherwise you cannot point.\n\nEverything hinges on this: To point, to connect, what you are pointing at must be addressable.\n\nYou can’t even open a document if you cannot point to it. That’s the most basic interaction in our modern graphical user interface.\n\nI don’t think it’s an exaggerating to say that with knowledge work everything is made more powerful through more powerful pointing, or constrained by more limited pointing.\n<h1>citations</h1>\nThis sounds quite abstract I’m told so I would like to illustrate with one very concrete case:\n\nWhen my beautiful boy Edgar is a bit older I expect we will experience an argument with him where his justification for something will be “because that’s what she said”. Yes, I expect he will start using citations… The citation in this case having only the most tenuous link to the source; he simply asserts and points to a source. A source which may very much deny what was asserted and the source may very well be unavailable.\n<h3>  analog citing</h3>\nWhen I was young I was taught to cite by referring to a book, since books were authored and therefore authoritative of course. The way I would link what I was quoting was through meticulously listing what book I was referring to, in other words the author, title, year of publication and edition and perhaps the publisher and so on. I would then note the page number so that my teacher or whoever else might read my paper would be able to check the citation, by going to the library, finding the right section for the book, then the book itself and then by opening it to the said page and finding the text I was referring to.\n\nOf course this did not happen all that much–books cited were either books assigned by the teacher and if I cited something my teacher had not read the chances she would actually look up the citation was minimal. This was a dirty secret of academia but now that we live in a world of links it is super-quick and easy to check on citations right?\n<h3>  digital citing</h3>\nYes. If the link is to an open web page, that is to say not behind a pay wall and the link is still active. And even then, it will only open the document, it will not allow you to point to a specific section as you could with a paper book where you could point to a page number. If someone has explicitly taken the effort to add a pointing target to the point where you needed it, called an anchor tag, you could, if you know how to find the anchor tag, link to the specific section of the document.\n\nHowever, if you wanted to refer to a specific page or section in a digital book you had purchased on your Kindle or in the iBooks Store you would be out of luck. The means through which Amazon and Apple address content in ‘their’ books is proprietary and we have no means of accessing it. We have no way to point to it.\n\nIf you want to point to a section in a PDF, well, that’s just pure fantasy at this point.\n\nI would say exacerbates that dirty little secret of academia. If an academic writes a citation to something you are already read you can evaluate its relevance and veracity. If it’s to something new, a book or a PDF you have not read, all the king's horses and all the king's men cannot put the link back together again. The link is lost, not much more useful than a toddler asserting that “he said, she said”.\n<h1>inter-operability</h1>\nThe same goes for inter-system communications. If you don’t know what you are pointing at then you are just waving your arms around in the dark.\n\naddressability enables pointing and interaction\n\nIn closing, digital interaction hinges on addressability and in the digital realm this is something we have to construct, it is not inherent as it is in the physical world.\n\nWithout local addressability we cannot open a file, we can not move a word around the screen.\n\nWithout wide addressability we cannot reliably refer to each others work, each others thoughts. We cannot move around in our information. We cannot even annotate without being able to somehow point to what we are annotating and if we can, how great would it be to search only one’s annotations across any corpus of knowledge and to string citations along with them?\n\nAnd as with our fingers pointing around in the room, the higher degree of flexibility and finesse we have, the more power we have in our interactions.\n\nThis is not a technical issue, this is a socio-technical issue. This is an issue we can and must work on together.\n<h1>session explorations</h1>\nIn this session we will explore aspects of symbol manipulation and of connection interaction in addressable space.\n\nWe will look at how can we build digital environments where we can move around freely and employ all kinds of basic and advanced tools to interact with the connections of our knowledge\n\nWho do we want to become? Interactive or passive? More connected or more isolated?\n\nThe development of our tools and the underlying infrastructures while largely determine the answers to these questions and we will develop the the tools and their supportive infrastructures based on who we want to become.\n\nSo I ask our panellists: Who do we want to become and what do we need to do to enable this to happen?",
            "name" : "draft-symbol-manipulation-session-intro-pointing",
            "modified" : "2018-09-17 09:39:04",
            "date_gmt" : "2018-09-17 09:39:04",
            "date" : "2018-09-17 09:39:04",
            "mime_type" : "",
            "modified_gmt" : "2018-09-17 09:39:04",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=257"
         },
         "title" : "Draft Symbol Manipulation Session Intro (pointing)"
      },
      "post/211" : {
         "type" : "post",
         "title" : "Collapse & Focus ViewSpec",
         "data" : {
            "guid" : "https://jrnl.global/?p=211",
            "excerpt" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-13 12:45:26",
            "mime_type" : "",
            "date_gmt" : "2018-09-13 12:45:26",
            "date" : "2018-09-13 12:45:26",
            "modified" : "2018-09-13 12:45:26",
            "name" : "collapse-focs-viewspec",
            "html" : "In follow up to <a href=\"https://jrnl.global/2018/09/12/the-incredible-difficulty-of-jumping-mental-tracks-breakdown-and-notions-of-progress/\">https://jrnl.global/2018/09/12/the-incredible-difficulty-of-jumping-mental-tracks-breakdown-and-notions-of-progress/</a> here is a visualisation created in Keynote to illustrate how double clicking on a heading to collapse all other headings and thus give the user a more focused way to work could look:\n\n[video width=\"1440\" height=\"1080\" m4v=\"http://wp.doug/wp-content/uploads/2018/09/double-click-a-heading.m4v\"][/video]"
         },
         "id" : "post/211"
      },
      "comment/42" : {
         "title" : "Collapse &#03...: [&#8230;] follow up to https://jrnl.global/201...",
         "data" : {
            "creator_name" : "Collapse &#038; Focs ViewSpec &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/09/13/collapse-focs-viewspec/",
            "date_gmt" : "2018-09-13 12:45:29",
            "date" : "2018-09-13 12:45:29",
            "html" : "[&#8230;] follow up to https://jrnl.global/2018/09/12/the-incredible-difficulty-of-jumping-mental-tracks-breakdown-and-noti&#8230; here is a visualisation created in Keynote to illustrate how double clicking on a heading to [&#8230;]"
         },
         "type" : "comment",
         "id" : "comment/42"
      },
      "post/246" : {
         "id" : "post/246",
         "title" : "Fast HyperGlossary Attachment",
         "data" : {
            "guid" : "https://jrnl.global/?p=246",
            "excerpt" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-16 14:58:10",
            "mime_type" : "",
            "date_gmt" : "2018-09-16 14:58:10",
            "date" : "2018-09-16 14:58:10",
            "name" : "fast-hyperglossary-attachment",
            "modified" : "2018-09-16 14:58:10",
            "html" : "Often when I write I want to refer to something a point I have made earlier in a blog post/article, such as a definition, an explanation or a point of view.\n\nI could of course switch over to my web browser, find my blog, click on whatever option lists what I have referred to as Glossary Entries or other relevant categories, then trawl through new and old and then copy the link, return to my word processor and add the link\n\nI think it would be far superior if I could create an organised list of HyperGlossary entries where I add a short and a long definition, along with relevant links and relationships, as I have illustrated with a <a href=\"http://thefutureoftext.org/basic-walkthrough.html\">Basic 'HyperGlossary' Walkthrough</a>.\n\nI would then be able to ctrl-click on text in my word processor and choose to 'Attach Glossary' and here my favourites would appear on top, recently added below that and a keyboard shortcut (perhaps cmd-h) which would list all my articles in a large screen dedicated to only that single task.\n\nOne click and a glossary item is attached.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/09/fast-glossary-attachment.jpg\"><img class=\"aligncenter wp-image-247 size-large\" src=\"http://wp.doug/wp-content/uploads/2018/09/fast-glossary-attachment-700x266.jpg\" alt=\"\" width=\"700\" height=\"266\" /></a>\n<h1>Reading</h1>\nWhen this is attached a reader can see that the text has a HyperGlossary term attached since it has double ']' brackets next to it, like this: word[]\n\nIf the user clicks the '[]' it expands in the style of an <a href=\"https://pdfs.semanticscholar.org/8cfb/f544a3629e93331d109865ac0478c21cab1d.pdf\">inline link</a> to show the short definition for the attached term, like this: word [ a unit of speech [ + ]\n\nThe reader can now click again to close or click the '+' to open the article with the full definition.\n<h1>Other Means To Add</h1>\nAdditionally, on publishing my document I would like to have my word processor comb through the text and highlight any words or phrases which match the titles of the glossary entries so that I can choose to make them live or leave them off.\n\nFurthermore, when I perform the cmd-k keyboard shortcut and I don't have a valid URL on the clipboard, the same list of glossary terms should be listed, along with a text entry area, so that I can choose to quickly link to any of my articles.\n\nWhat do you think?\n<h1>Implementation</h1>\nIn order to implement this the word processor would need to be able to log in to the wordpress server to retrieve article names, contents, meta and addresses and to present them into the document.\n\nOn Publishing the word processing document the word processor would need to either publish with the [] acting as regular links, onto a server with inline link support (via a plugin) or with the definitions attached inside the document."
         },
         "type" : "post"
      },
      "post/148" : {
         "id" : "post/148",
         "data" : {
            "mime_type" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-08 14:31:25",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=148",
            "html" : "The Timeline in jrnl is the view of all the blog posts.\n\nWe aim to augment this view through two mechanisms:\n<h3>Query/Search</h3>\nIn the Timeline view the user should be able to search/query the server for which blog articles to view and the user should further be able to search within the search result.\n<h3>ViewSpec</h3>\nTimeline ViewSpec system which provides flexible ways for the user to choose how the list of document should appear. This is conceptually the same as the <a href=\"http://www.liquid.info/view.html\">Dynamic Views</a>.",
            "modified" : "2018-09-08 14:31:25",
            "name" : "timeline",
            "date" : "2018-09-08 14:31:25",
            "date_gmt" : "2018-09-08 14:31:25"
         },
         "title" : "Timeline",
         "type" : "post"
      },
      "comment/44" : {
         "id" : "comment/44",
         "data" : {
            "creator_url" : "https://www.conversence.com",
            "creator_name" : "Marc-Antoine Parent",
            "date" : "2018-09-21 12:10:18",
            "date_gmt" : "2018-09-21 12:10:18",
            "html" : "I have done work on high resolution links here:\nhttps://github.com/conversence/client/tree/anchor_range_on_fragment\nThis is a fork from the hypothesis client, since they're the best-maintained fork of the annotator code base. However, it's possible to just use annotator from that repository and not the whole hypothesis machinery."
         },
         "title" : "Marc-Antoine ...: I have done work on high resolution links here:...",
         "type" : "comment"
      },
      "comment/37" : {
         "data" : {
            "html" : "[&#8230;] and then have a selection mechanism (I propose the old hyperwords/liquid blue dot) https://jrnl.global/2018/09/09/rich-text-interaction/ know what anchor is before any selected text and use that as the URL anchor [&#8230;]",
            "date" : "2018-09-12 08:47:15",
            "date_gmt" : "2018-09-12 08:47:15",
            "creator_name" : "jrnl High Resolution Addressing Implementation &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/09/12/jrnl-high-resolution-addressing-implementation/"
         },
         "title" : "jrnl High Res...: [&#8230;] and then have a selection mechanism (...",
         "type" : "comment",
         "id" : "comment/37"
      },
      "post/75" : {
         "title" : "What Sucks about Blogging",
         "data" : {
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-08-25 14:53:55",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=75",
            "excerpt" : "",
            "name" : "what-sucks-about-blogging",
            "modified" : "2018-08-25 14:53:55",
            "html" : "We had the inaugural meeting of the jrnl project yesterday and we decided to write a blog post each of what sucks about blogging, with hopefully some useful issues coming out of that for us to work to improve. We could of course also list suggested improvements in the process.\n<h1>View Flexibility</h1>\nFor me the single biggest issue is the lack of view flexibility. Even such a simple thing as viewing all the posts by a specific set of people in one timeline is only possible if they are on the same blog, it’s not possible cross-domains.\n\nAlso, something as simple as saying I want to see all the paragraphs where Chris mentioned in a meeting Houria is not possible.\n\nFurthermore, with the view that what we are doing should augment our ability to work together, the treatment of comments as separate entities from articles makes it harder to thread conversations.\n\nI think we need a way where we can comment on specific sections of a blog with another blog where we use a paragraph level link and the comment post makes the original post aware of the comment through a pingback and has the option to display some sort of visual indicator that there is a comment in a blog post about this section.\n\nThese types of improvements should make it possible to visually follow threads of conversations and what certain people have written about certain things and so on.\n\nA further issue is the lack of versioning. It should be possible to somehow update an article without removing the original, by adding a new article and the naming scheme increments and the old article is made aware of the new article and gives the reader the option to read an order or newer version. This could help with issue tracking.\n\nMicro posts which act as to-do items could also be powerful with a powerful view system.\n\n<a href=\"https://jrnl.global/2018/08/21/stephan-kreutzer/\">Stephan</a> mentioned that a TimeBrowser feature would be useful. I agree, it should be another possible view.\n\nThat’s all for now, we are moving house today, from our flat in Fulham to our house in West Wimbledon. It’s a big day, a strange day, and an emotional day, no more so when I watched my mother take my son Edgar out for a walk for the very first time. This was a ramble, this is an illustration of the issues we have to deal with. How can we build a system to encourage an author, in this case me, to author more readable articles and how can we provide a reader, you, with better ways to view and interact with this article and any and all articles on this blogs and beyond?",
            "date_gmt" : "2018-08-25 14:53:55",
            "date" : "2018-08-25 14:53:55"
         },
         "type" : "post",
         "id" : "post/75"
      },
      "comment/17" : {
         "id" : "comment/17",
         "title" : "Gyuri Lajos: It does not seem to be editable for me. But I s...",
         "data" : {
            "date" : "2018-08-24 16:06:23",
            "date_gmt" : "2018-08-24 16:06:23",
            "creator_name" : "Gyuri Lajos",
            "creator_url" : "",
            "html" : "It does not seem to be editable for me. But I say yes to all those things listed"
         },
         "type" : "comment"
      },
      "post/387" : {
         "type" : "post",
         "title" : "Search Results Theme for finding own articles (primarily)",
         "data" : {
            "modified_gmt" : "2018-10-19 10:59:57",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=387",
            "excerpt" : "",
            "modified" : "2018-10-19 10:59:57",
            "name" : "search-results-theme-for-finding-own-articles-primarily",
            "html" : "This is what I was talking about during our <a href=\"https://jrnl.global/2018/10/18/frodes-dream-of-rich-article-listing/\">previous meeting</a>. Simple search results for the user to find an article they wrote and quickly copy a link or as citation to add to what they are currently writing, with ability to refine search results based on what tags and categories are used around the keyword.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-19-at-12.54.07.png\"><img class=\"aligncenter size-full wp-image-388\" src=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-19-at-12.54.07.png\" alt=\"\" width=\"1910\" height=\"1378\" /></a>",
            "date" : "2018-10-19 10:59:57",
            "date_gmt" : "2018-10-19 10:59:57"
         },
         "id" : "post/387"
      },
      "term/19" : {
         "type" : "category",
         "title" : "The Team",
         "data" : {
            "count" : "5",
            "slug" : "team",
            "description" : "Everyone working on the project is encouraged to post a bio of themselves with the Category ‘The Team’. If you are not on the project but you would like to consider joining, please email frode@liquid.info"
         },
         "id" : "term/19"
      },
      "post/254" : {
         "type" : "post",
         "title" : "Draft 2 for 'symbol manipulation session'",
         "data" : {
            "comment_count" : null,
            "modified_gmt" : "2018-09-16 18:02:02",
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=254",
            "excerpt" : "",
            "name" : "draft-2-for-symbol-manipulation-session",
            "modified" : "2018-09-16 18:02:02",
            "html" : "When presenting the <a href=\"http://dougengelbart.org/pubs/augment-133320.html\">keynote address</a> at the World Library Summit in Singapore in 2002, Doug Engelbart remarked on his impression of the computer when he first came across it. This was in the era when computers were still used simply to compute, to crunch numbers. He said:\n<h1>symbols</h1>\n“I saw that we have a tool that does not just move earth or bend steel, but we have a tool that actually can manipulate symbols and, even more importantly, portray symbols in new ways, so that we can interact with them and learn. We have a tool that radically extends our capabilities in the very area that makes us most human, and most powerful.”\n<h1>symbols are connections</h1>\nSymbols get their meaning and power from their connection to something else, often other symbols–symbols get their power from the way they connect–a letter of the alphabet has little meaning without connecting to other letters, and words have little meaning without other words.\n\nThis connective aspect of text is massively important and in the digital environment the connective aspect can be powerfully extended. Not just through the common blue-underlined link. Doug spoke of implicit links, link types, high resolution linking, backlink databases and more.\n<h1>connections need addresses to connect</h1>\nI would like to highlight one aspect of connections for a minute: Addressability.\n\nWhat we point to must exist in some location, somewhere addressable.\n\nEverything hinges on this: To point, to connect, what you are pointing at must be addressable.\n\nYou can’t even open a document if you cannot point to it. That’s the most basic interaction in our modern graphical user interface.\n\nI don’t think it’s an exaggerating to say that with knowledge work everything is made more powerful through more powerful pointing, or constrained by more limited pointing.\n<h1>citations</h1>\nThis sounds quite abstract I’m told so I would like to illustrate with one very concrete case:\n\nWhen my beautiful boy Edgar is a bit older I expect we will experience an argument with him where his justification for something will be “because that’s what she said”. Yes, I expect he will start using citations… The citation in this case having only the most tenuous link to the source; he simply asserts and points to a source. A source which may very much deny what was asserted and the source may very well be unavailable.\n<h3>analog citing</h3>\nWhen I was young I was taught to cite by referring to a book, since books were authored and therefore authoritative of course. The way I would link what I was quoting was through meticulously listing what book I was referring to, in other words the author, title, year of publication and edition and perhaps the publisher and so on. I would then note the page number so that my teacher or whoever else might read my paper would be able to check the citation, by going to the library, finding the right section for the book, then the book itself and then by opening it to the said page and finding the text I was referring to.\n\nOf course this did not happen all that much–books cited were either books assigned by the teacher and if I cited something my teacher had not read the chances she would actually look up the citation was minimal. This was a dirty secret of academia but now that we live in a world of links it is super-quick and easy to check on citations right?\n<h3>digital citing</h3>\nYes. If the link is to an open web page, that is to say not behind a pay wall and the link is still active. And even then, it will only open the document, it will not allow you to point to a specific section as you could with a paper book where you could point to a page number. If someone has explicitly taken the effort to add a pointing target to the point where you needed it, called an anchor tag, you could, if you know how to find the anchor tag, link to the specific section of the document.\n\nHowever, if you wanted to refer to a specific page or section in a digital book you had purchased on your Kindle or in the iBooks Store you would be out of luck. The means through which Amazon and Apple address content in ‘their’ books is proprietary and we have no means of accessing it. We have no way to point to it.\n\nIf you want to point to a section in a PDF, well, that’s just pure fantasy at this point.\n\nI would say exacerbates that dirty little secret of academia. If an academic writes a citation to something you are already read you can evaluate its relevance and veracity. If it’s to something new, a book or a PDF you have not read, all the king's horses and all the king's men cannot put the link back together again. The link is lost, not much more useful than a toddler asserting that “he said, she said”.\n<h1>inter-operability</h1>\nThe same goes for inter-system communications. If you don’t know what you are pointing at then you are just waving your arms around in the dark.\n<h1>addressability enables pointing and interaction</h1>\nIn closing, digital interaction hinges on addressability and in the digital realm this is something we have to construct, it is not inherent as it is in the physical world.\n\nWithout local addressability we cannot open a file, we can not move a word around the screen.\n\nWithout wide addressability we cannot reliably refer to each others work, each others thoughts. We cannot move around in our information. We cannot even annotate without being able to somehow point to what we are annotating and if we can, how great would it be to search only one’s annotations across any corpus of knowledge and to string citations along with them?\n\nAnd as with our fingers pointing around in the room, the higher degree of flexibility and finesse we have, the more power we have in our interactions.\n\nThis is not a technical issue, this is a socio-technical issue. This is an issue we can and must work on together.\n<h1>session explorations</h1>\nIn this session we will explore aspects of symbol manipulation and of connection interaction in addressable space.\n\nWe will look at how can we build digital environments where we can move around freely and employ all kinds of basic and advanced tools to interact with the connections of our knowledge\n\nWho do we want to become? Interactive or passive? More connected or more isolated?\n\nThe development of our tools and the underlying infrastructures while largely determine the answers to these questions and we will develop the the tools and their supportive infrastructures based on who we want to become.\n\nSo I ask our panellists: Who do we want to become and what do we need to do to enable this to happen?",
            "date" : "2018-09-16 18:02:02",
            "date_gmt" : "2018-09-16 18:02:02"
         },
         "id" : "post/254"
      },
      "term/8" : {
         "data" : {
            "slug" : "hyperglossary",
            "description" : "Authors can easily add entries to a glossary which will help them in their writing since they will not have to constantly re-introduce topics and it makes it easier for readers to quicker understand the text.",
            "count" : "11"
         },
         "title" : "hyperGlossary",
         "type" : "category",
         "id" : "term/8"
      },
      "post/333" : {
         "id" : "post/333",
         "title" : "9th December, Project Priorities",
         "data" : {
            "guid" : "https://jrnl.global/?p=333",
            "excerpt" : "",
            "modified_gmt" : "2018-10-09 10:39:22",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "date" : "2018-10-09 10:39:22",
            "date_gmt" : "2018-10-09 10:39:22",
            "name" : "9th-december-project-priorities",
            "modified" : "2018-10-09 10:39:22",
            "html" : "We have decided that we need to first and foremost implement high resolution addressing into the blue dot menu.\n\nWe will further work on ViewSpecs and hyperGlossary integration."
         },
         "type" : "post"
      },
      "post/60" : {
         "type" : "post",
         "data" : {
            "modified" : "2018-08-25 09:59:38",
            "name" : "initial-meeting-recording",
            "html" : "The audio recording from the initial meeting on the 24th of August 2018 has been uploaded to: <a href=\"https://youtu.be/K-m5lhUjbnU\">https://youtu.be/K-m5lhUjbnU</a>",
            "date" : "2018-08-25 09:59:38",
            "date_gmt" : "2018-08-25 09:59:38",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-08-25 09:59:38",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=60",
            "excerpt" : ""
         },
         "title" : "Initial Meeting Recording",
         "id" : "post/60"
      },
      "term/7" : {
         "id" : "term/7",
         "type" : "category",
         "title" : "High Resolution Addressability",
         "data" : {
            "count" : "13",
            "slug" : "highresolutionaddressability",
            "description" : "Providing the ability for a link to be created which does not just link to the document but to a specific section within the document."
         }
      },
      "comment/13" : {
         "title" : "skreutzer: Hi Christopher,\n\nthank you very much for your c...",
         "data" : {
            "html" : "Hi Christopher,\n\n<p style=\"text-align:justify;\">thank you very much for your comment! Could you please elaborate a little more what the strong argument for keeping (expectation that this is how the rendering will look like, that it will be possible for clients to produce that rendering, designing the content for a specific visual layout) the HTML rendering is? I assume that any given ViewSpec will ignore it completely anyway, and while there can be a ViewSpec that mimics the HTML default rendering, it shouldn’t be more privileged than any other ViewSpec.</p>\n\n<p style=\"text-align:justify;\">What purpose/function would richer scope provide, could you give a quick example? Similarily, for matches/occurrences that don’t want to be shown, this RFC isn’t much concerned about how the glossary is actually used, how connections between glossary terms and a main text are established, because those mechanisms might be capabilities of their own, needing their own RFCs and research, as I expect that we will come up with several of them. Explicit linkage and automatic text search come to mind, already delving into a myriad of possibilities, options, potential. This proposal here is pretty much about a primitive, generic text capability that can be used in different ways, even be repurposed to do other things than we anticipate. I realize that it is not a full traditional glossary spec of course, but if we would go on to build glossaries, this would be one way to go about it, to structure parts of the data that would be involved in it. To come up with this RFC at all, I hope that parts of the glossary data might get stored in a usable format, and especially for being published as independent resources with no relation to WordPress (or other server/hosting/storage systems), as becomes a little bit more apparent in the second stage, because that one might break WordPress already (didn’t try or can’t remember, irrelevant anyway).</p>\n\n<p style=\"text-align:justify;\">I’m pretty much in favor of adding IDs for more advanced knowledge capabilities like global disambiguation, but not clear yet if that’s supposed to be a separate format/resource/publication/relation/statement, so the glossary data remains free of the many problems that would be invited by such additions. As a glossary, that’s the terms and definitions in it, tend to be explicitly constructe/curated (sure, we could do a lot for the authoring of glossaries, indexes, etc.) in a certain context of only one main text or a collection of texts or the use of words of a single individual or a limited group (not global), the glossary as a reading aid is supposed to be employed in ways that aid the reader, considering the text/terms he will encounter in the material, previous knowledge (what to include and what not to), intended effect of the augmentation, and so on. “The Queen” could point out that this is a way how the author or people or the text refers to her, on the other hand, sure, in RFCs for the linking/connecting capabilities (if separate), we would need to look at questions like a reference to a term where the term text doesn’t match, for linking the same term of the main text in different occurrences to different glossary term definitions (furthermore, if both of those groups have multiple definitions for the same term), linking to a specific form/variant of the term or to one or several specific definitions, and on and on.</p>\n\n<p style=\"text-align:justify;\">The RFC is obviously a little older and only suggested that if it is done on WordPress, it should rather be in a useful form to not burry data in custom formats. It’s also a first draft/stage, not only as a RFC, but for bootstrapping, so it would develop from practical implementation and usage. It’s designed to serve as a transitional compromise for users who are exclusively web-affected (a form of computer illiteracy). It doesn’t need to be the only one, there could be other formats as well as long as these are reasonable enough. It could be a start to research and experiment with glossary related capabilities, a wide and interesting field in itself probably, but for our own purposes I’m not aware if we already encountered the “Queen problem”. I also didn’t want to suggest full xFiles/EDL/ZigZag/NOSQL dimensions for category/type semantics as a compromise to get a glossary capability for a Journal going, not entering this whole other field of data structuring, which may or may not solve all of the problems we will encounter down the road with this simple, first glossary data RFC. Now my “short reply” turned already into a report on my thinking about glossary-related capabilities and a potential larger architecture/infrastructure/system they might be part of.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\" rel=\"nofollow\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "creator_url" : "https://skreutzer.de",
            "creator_name" : "skreutzer",
            "date_gmt" : "2018-08-22 11:12:04",
            "date" : "2018-08-22 11:12:04"
         },
         "type" : "comment",
         "id" : "comment/13"
      },
      "user/8" : {
         "data" : {
            "icon" : "http://0.gravatar.com/avatar/aedc0495da1738d235ecaa23ec886016"
         },
         "title" : "Jacob Hazelgrove",
         "type" : "user",
         "id" : "user/8"
      },
      "term/31" : {
         "id" : "term/31",
         "type" : "post_tag",
         "title" : "double click",
         "data" : {
            "description" : "",
            "slug" : "double-click",
            "count" : "1"
         }
      },
      "comment/6" : {
         "id" : "comment/6",
         "title" : "Teodora Petkova: Thank you for inviting me to be part of this ex...",
         "data" : {
            "html" : "Thank you for inviting me to be part of this exciting project, Frode. I will be probably listening in first and when I feel comfortable with the format, I will chime in with ideas and suggestions revolving around Intertextuality and embedding spaces in digital text that allow for the very important components of a text - ambiguity and that irreducible to code part, to emerge.\n\nFor now I will put one link here: https://file.scirp.org/pdf/CE_2017011917065452.pdf \n\nHere's a citation from the author:\n\n\"Throughout history, human beings created three great types of intellectual technologies to express their intelligence: orality, writing, and informatics.Understanding the evolution of intellectual technologies is fundamental to understanding cyberculture\".\n\nThe reason I am putting this here is because I believe the future of text is woven of these three threads: orality, writing and informatics. All code for recording and transfering meaning.",
            "creator_name" : "Teodora Petkova",
            "creator_url" : "",
            "date" : "2018-08-22 10:26:08",
            "date_gmt" : "2018-08-22 10:26:08"
         },
         "type" : "comment"
      },
      "post/328" : {
         "data" : {
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=328",
            "mime_type" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-08 16:55:52",
            "date_gmt" : "2018-10-08 16:55:52",
            "date" : "2018-10-08 16:55:52",
            "html" : "Here is where we are after <a href=\"https://jrnl.global/2018/10/07/agenda-chris-shane/\">the first call</a>, working on making this into small, implementable components, based on the first <a href=\"https://jrnl.global/2018/10/08/sketch-first-sprint-work-breakdown-structure/\">sketch</a>.\n\n<a href=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-08-at-17.54.03.png\"><img class=\"aligncenter size-full wp-image-329\" src=\"http://wp.doug/wp-content/uploads/2018/10/Screenshot-2018-10-08-at-17.54.03.png\" alt=\"\" width=\"4522\" height=\"2240\" /></a>",
            "modified" : "2018-10-08 16:55:52",
            "name" : "sketch-first-sprint-work-breakdown-structure-rev-after-call"
         },
         "title" : "Sketch first Sprint work breakdown structure (rev after call)",
         "type" : "post",
         "id" : "post/328"
      },
      "term/3" : {
         "id" : "term/3",
         "type" : "category",
         "title" : "Authoring",
         "data" : {
            "description" : "The act of authoring articles.",
            "slug" : "authoring",
            "count" : "15"
         }
      },
      "post/51" : {
         "data" : {
            "guid" : "https://jrnl.global/?p=51",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-08-22 12:37:45",
            "mime_type" : "",
            "date_gmt" : "2018-08-22 12:37:45",
            "date" : "2018-08-22 12:37:45",
            "modified" : "2018-08-22 12:37:45",
            "name" : "re-jrnl-launch-meeting-announcement-for-friday-24th-of-august-2018",
            "html" : "<p style=\"text-align:justify\">This is a reply to “<a href=\"https://jrnl.global/2018/08/21/jrnl-launch-meeting-announcement-for-friday-24th-of-august-2018/\">jrnl launch meeting announcement (for Friday 24th of August 2018)</a>”.</p>\n\n<p style=\"text-align:justify\">It’s a little surprising that the Journal/jrnl in an already very, very specific form is supposed to be the main topic, despite it’s still unclear to which extent the potential participants write about their research and work or plan to, or if that should be the main interest or first strategic goal for now. For a long time, I keep repeating that even WordPress comes with many problems, I wonder who’s supposed to work on these. The proposal continues to suggest that the jrnl should exist as just another blog or website, following the traditional model of the WWW that seriously lacks actual hypertext capabilities.</p>\n\n<p style=\"text-align:justify\">The announcement also mentions that “the first use of the jrnl will be to make a digital version of the analog book we will produce for this year’s special Future of Text: 50th years Anniversary of Doug Engelbart’s Demo”. I’m puzzled when reading such statements in 2018. The analog book should be made into a digital version and not the other way around? If that activity would succeed, the “Journal” would be a failure right away. I understand well that the Doug@50 project should get their permanent record of their proceedings, but as it’s about the web of knowledge and Journal was abandoned, there’s now no other way to do it than as the book printing guild and publishing industry is doing it since the beginning of time. What role does a printed book even play in relation to a web of concepts/topics/knowledge? I’m left completely clueless.</p>\n\n<p style=\"text-align:justify\">There’s the question how familiar people are with using WordPress for writing/publishing. We could break this down into the separate capabilities that are grouped into this meta- or super-capability, bundled into the WordPress package in a not too fortunate manner. It’s a text editor (the only “advantage” is inherited from the property of web scripting that the “application” will remotely execute on the client without the need to explicitly install it), it can publish the text on the network (enabling the retrieval of the resource), it assigns it a unique ID. We could easily replace those capabilities with other implementations that create far less problems than WordPress because of its webbiness, WYSIWYG, etc., but any other alternative would go against the established paradigm and can never get support or consensus, so it’s not unlikely that we will need to work around and abuse WordPress in quite horrible ways just to not lose the entrapped material that will go into that system. As there might be people who are unable or unwilling to publish in useful ways and hopefully can at least get used to WordPress (if at all), it’s probably better to collect their submissions on WordPress than to not take it, even as this will demand manual curation and certainly can’t stay at that place when considering how it is set up at the moment. WordPress might serve as an totally agnostic storage system, that’s basically it.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>"
         },
         "title" : "Re: jrnl launch meeting announcement (for Friday 24th of August 2018)",
         "type" : "post",
         "id" : "post/51"
      },
      "comment/3" : {
         "id" : "comment/3",
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] Frode Hegland officially confirmed the first meeting of the Future of Text Institute on the 2018-08-24. With that [&#8230;]",
            "date_gmt" : "2018-08-22 12:37:04",
            "date" : "2018-08-22 12:37:04",
            "creator_name" : "Re: Friday &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/08/22/re-friday/"
         },
         "title" : "Re: Friday &#...: [&#8230;] Frode Hegland officially confirmed th..."
      },
      "comment/39" : {
         "type" : "comment",
         "title" : "Alexander Rod...: Hello Teodora, as always a concise and valuable...",
         "data" : {
            "html" : "Hello Teodora, as always a concise and valuable text. I was apprehensive of You having abandoned blogging, but it not the case. I am participating in a new project and I was needing models of using semantics for multimedia content and the BBC case will be of great help.\nThank You very much, again.",
            "creator_url" : "http://microepequenas.com.br/",
            "creator_name" : "Alexander Rodrigues Silva",
            "date_gmt" : "2018-09-18 12:21:45",
            "date" : "2018-09-18 12:21:45"
         },
         "id" : "comment/39"
      },
      "post/244" : {
         "id" : "post/244",
         "title" : "Textual Symbols VS. Other Media",
         "data" : {
            "guid" : "https://jrnl.global/?p=244",
            "excerpt" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-16 14:25:29",
            "content_filtered" : "",
            "mime_type" : "",
            "date" : "2018-09-16 14:25:29",
            "date_gmt" : "2018-09-16 14:25:29",
            "name" : "textual-symbols-vs-other-media",
            "modified" : "2018-09-16 14:25:29",
            "html" : "I wrote this in order to have something to point to when someone (invariably) starts talking about text as it if will be superseded soon. This is the kind of post I would like to be able to cite/link to/hyperglossary when I am writing articles. How can we do that? How can I bring a long list of my previous work to be inserted at need?\n<h1>Speech</h1>\nFirstly, I’d like to address the notion that there is more information in speech than text and that speech is therefore somehow richer or more useful. In his groundbreaking book Sapiens (2014), Yuval Noah Harari wrote that writing was invented to solve very different problems than speaking. Speaking with people, and to a degree also to computers, will remain useful, sure. But not for the same reason we use written symbols. Symbols are visual and this expands our mental space simply allowing us to employ our occipital lobe to augment our prefrontal cortex. Symbols are themselves stable and therefore lend themselves to us manipulating them.\n<h1>Pictures</h1>\nSecondly, I feel the need to address the notion that the future is more emoticon and less textual:\n\nIt can indeed take a thousand words to describe a picture in any detail–if the purpose is to use words to describe the picture to a degree that someone can re-create it or picture it in their minds–but to turn text into images requires the images to be abstracted to the point of becoming rebuses and then they really are symbols–in other words a form of text. When it comes to communicating something which does not have a literal, figurative analog, such as this sentence, pictures can’t hack it.\n<h1>Direct Brain Connections</h1>\nThen there is the issue of neural implants:\n\nA perspective that’s frequently thrown into this ring of ideas is that soon we can just ‘plug connections directly into our brains’ and that means no more computer interfaces or anything like that. However, even such connections would somehow have to show up in our minds in some symbolic form. You would still need to mentally access these symbols somehow. Let’s not discard the brain-world interfaces we have been working on for the past few billion years: our powerful visual systems and nimble hands. We should ask; how can we build systems to better use these two aspects of our physiology to meld our minds to manipulations?\n<h1>AI</h1>\nAnd finally, we are entering an age of AI, Artificial Intelligence. Today we are celebrating Doug, who worked at SRI, same place where Siri was born and Doug certainly appreciated the power of AI but he was more interested in IA, Intelligence Amplification. We need to ask how we can augment our minds rather than simply outsource thinking. To put the question starkly, are we willing to surrender our knowledge work blindly to artificial intelligence constructs entirely, or are we also going to fight for systems to enable us to employ our own intelligence?"
         },
         "type" : "post"
      },
      "post/298" : {
         "id" : "post/298",
         "type" : "post",
         "title" : "Agenda, 8 October 2018",
         "data" : {
            "html" : "This will be the first meeting with Shane. We will be discussing how to produce something useful for the 9th of December based on what I (Frode) have posted in my '<a href=\"https://jrnl.global/2018/10/05/9th-december-my-priorities/\">priorities</a>' post on this blog.\n\nIt is expected that other priorities should also be blogged and I will link to them here.\n<h1>Architecture</h1>\nWe will need to spend some time discussing the project architecture to make sure our wishes don't contradict other wished for functionalities.\n<h1>Responsibilities</h1>\nWe will then discuss who is in charge of what aspect and what  we will actually build.\n<h1>Timeline</h1>\nOur timeline is a hard deadline 9th of December with an initial deadline in about two weeks, when we will meet with Vint to present our progress and discuss future focus.\n\nI have posted a <a href=\"https://jrnl.global/2018/10/08/initial-project-overview/\">rough data flow diagram</a> here to help us discuss this.",
            "name" : "agenda-chris-shane",
            "modified" : "2018-10-07 15:16:50",
            "date_gmt" : "2018-10-07 15:16:50",
            "date" : "2018-10-07 15:16:50",
            "mime_type" : "",
            "modified_gmt" : "2018-10-07 15:16:50",
            "comment_count" : null,
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=298"
         }
      },
      "term/9" : {
         "id" : "term/9",
         "type" : "category",
         "data" : {
            "description" : "Let users select any arbitrary text and perform searches based on the text, such as we have experimented with for Liquid | Flow and in wordpress here: wordpress.liquid.info or the Liquid | Flow macOS tool which are both already developed and owned by us.",
            "slug" : "implicit-linking",
            "count" : "9"
         },
         "title" : "Implicit Linking"
      },
      "term/4" : {
         "id" : "term/4",
         "data" : {
            "description" : "",
            "slug" : "comment",
            "count" : "1"
         },
         "title" : "Comment",
         "type" : "category"
      },
      "post/131" : {
         "type" : "post",
         "data" : {
            "guid" : "https://jrnl.global/?p=131",
            "excerpt" : "",
            "comment_count" : null,
            "content_filtered" : "",
            "modified_gmt" : "2018-09-07 13:34:54",
            "mime_type" : "",
            "date" : "2018-09-07 13:34:54",
            "date_gmt" : "2018-09-07 13:34:54",
            "modified" : "2018-09-07 13:34:54",
            "name" : "why-blogging-sucks",
            "html" : "6 minutes read at slow text-to-speech rate\n\nIn my regular role as a self-appointed long distance technology scout, my secret weapon and antidote to any hype has always been to do a Google Search \"X sucks\" or \"Why X sucks\".\n\nI understand that our goal here is to find better ways to do what  blogging wanted to be.  So I leave the task of providing an overview of the subject for another time.\n\nHere I have 2 hours tops to do a brain dump on the topic, and use this opportunity to articulate long held beliefs on the subject.\n\nTogether with my colleagues at Easysoft we had been blogging and writing our own personal wiki and blog before these concept got much traction.  We were all doing this, and keeping a true blog of all our work and associated knowledge, so we knew, and the best boss I ever worked for, knew what's going on and could best work together. We had en-massed an in house knowledge base, \"the simplest possible that one can have\", and strived to \"Always finish the day on a success\" as my closest colleague Martin Evans phrased it (who is <a href=\"http://www.martin-evans.me.uk/\">still blogging</a> under that by-line today).\n\nThe sheer value of gathering and sharing information is at the heart of not just the blogosphere but the Web itself. Our goal, to quote <a href=\"https://hyp.is/NBoBbLKsEeieuKM0QdA-eQ/onbeing.org/programs/maria-popova-cartographer-of-meaning-in-a-digital-age-jan2017/\">Maria Popova</a>, is to <a href=\"https://hyp.is/3B6SmLKrEeia2gtvzwKYfQ/www.brainpickings.org/2013/10/23/7-lessons-from-7-years/\">understand and to be understood</a> so that we can all can be \"Cartographers of [our] meanings in the digital age\". That's what blogging should be, but really falls short.\n\nWikis, Blogs or even <a href=\"https://martinfowler.com/intro.html\">Blikis</a> have been \"invented\" as the poor man's Knowledge Management tool.\n\nAlas, as Stephan put it so aptly put it :\n\n<a href=\"https://hyp.is/GzlILLKVEeikPVdlXNMFtg/jrnl.global/2018/08/26/personal-hypertext-report-6/\">The web wasn’t designed as a hypertext capability infrastructure</a>\n\nThat is the core reason why Blogging, and practically every authoring, reading and publishing system on the Web sucks, really.\n\nFrode has been writing eloquently about the missing capabilities in <a href=\"https://docs.google.com/spreadsheets/d/1ZTzI92scoLm873zzrxUwt5GlNo27Q1owK62rWq9c_Gs/edit#gid=0\">here</a>\n\nI could not vote for it, last time I looked at it, but now I could, and add some more there.\n\nEngelbart's NLS later <a href=\"https://hyp.is/4kM1JrEaEei3Q_MalKzLsQ/www.dougengelbart.org/pubs/oad-2250.html\">Augment</a> really had it all.\n\nWith recent advances in Web technologies I would like to propose that it is now possible to turn the Web into a Hypertext capability infrastructure with all that Augment did offer in terms of:\n\nauthorship, structure and collaboration (and more).\n\nWhile NLS was a one machine World Wide Web we can turn the Web Itself into a  distributed, peer to peer and even federated Collective Intelligence platform capable of building a <a href=\"http://hyperknowledge.org/\">Web of Knowledge</a>  through interoperability of Personal and community Knowledge work and federation.\n<ol>\n \t<li>Decentralized Collaboration technologies IPFS, DAT, HoloChain</li>\n \t<li><a href=\"http://hyperknowledge.org/\">HyperKnowledge</a></li>\n \t<li>Personal Knowledge Interoperability Hubs</li>\n \t<li>Hyper Knowledge Media technology supporting Augment like Deep authoring capabilites</li>\n</ol>\nAll these technologies are now in alpha or pre alpha stage.\n\n&nbsp;\n\nThe Personal Knowledge Interoperability Hub, even in its current state, screenshot below, let's me do my web research and writing on any of my devices that are synchronised without data loss.\n\n<img class=\"alignnone wp-image-134\" src=\"http://wp.doug/wp-content/uploads/2018/09/Screenshot_2018-09-07-15-47-06-169x300.png\" alt=\"\" width=\"256\" height=\"454\" />\n\nBeyond interoperability and collaboration, we need better ways to consume and create knowledge. Instead of linear text need to see a Map first of what we encounter. What that needs is a way to turn texts into knowledge graphs.\n\nThe screenshot below show the beginnings of the technology needed to turn <strong>any</strong> HTML content into a Knowledge Graph (or nodes in Augment parlance), and back, so that any statement becomes globally addressable, expanded upon, identified with keywords, linked bidirectionally in meaningful ways, deeply re-arrangeable for creating narrative trails. This will help us to see the meaning of content at a glance, and do our own cartography of it.  Five years ago I had a round trip like that working with Google Docs that contained some special markup. Now it is becoming possible to to mark any part of any Google Doc document, turn it into grahp-based Knowledge Media and collaborate on it in real time in a truly \"serverless\" way. Thanks to IPFS the collaborators' browsers act as peer to peer servers.\n\nAnything in that knowledge graph can be portrayed and shared, in whole, or in parts as Knowledge Media (i.e. HTML containing custom tags with user defined/personalized capabilities)\n\n<img class=\"alignnone wp-image-132 size-full\" src=\"http://wp.doug/wp-content/uploads/2018/09/hyperknowledgemedia.png\" alt=\"\" width=\"677\" height=\"1024\" />\n\nThis kind of Knowledge Media can be created as easily as writing into a google doc or any other online Rich Text Editor, but it would act as a Rich Thought Editor. We do not want to process text, we want to process our Thoughts using a Thought Processor, a true <a href=\"http://www.rheingold.com/texts/tft/\">Tool for Thought</a>. This way we can turn the Universal Turing Machines into \"Universal Meaning Machines\" and \"bicycles for the mind\" (computers for the mind).\n\nWithin a month I hope to be able to replace this post with a Hyper Knowledge Media version using core capabilities of the personal Knowledge Hub.\n\n&nbsp;\n\nPS: WordPress really sucks. I lost some edits while changing tabs.  I registered <a href=\"https://hyperblog.co/\">https://hyperblog.co/</a>  two years ago and the full technology stack to drive it on the distributed web will be there to do my future blogging in a month or so.\n\n&nbsp;"
         },
         "title" : "Why Blogging Sucks",
         "id" : "post/131"
      },
      "post/290" : {
         "id" : "post/290",
         "title" : "update",
         "data" : {
            "guid" : "https://jrnl.global/?p=290",
            "excerpt" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-03 21:07:06",
            "mime_type" : "",
            "date_gmt" : "2018-10-03 21:07:06",
            "date" : "2018-10-03 21:07:06",
            "modified" : "2018-10-03 21:07:06",
            "name" : "update",
            "html" : "I have posted a personal and project update to my personal blog: <a href=\"http://wordpress.liquid.info/an-end-of-summer-update/\">http://wordpress.liquid.info/an-end-of-summer-update/</a>"
         },
         "type" : "post"
      },
      "term/41" : {
         "id" : "term/41",
         "title" : "meeting",
         "data" : {
            "count" : "2",
            "description" : "",
            "slug" : "meeting"
         },
         "type" : "post_tag"
      },
      "comment/51" : {
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] visual presentation and the speed and smoothness of interaction. For the jrnl project we have our priorities and here are some further thoughts based on our last group [&#8230;]",
            "creator_url" : "https://jrnl.global/2018/10/17/fast-dynamic-views-dynamic-displays/",
            "creator_name" : "fast dynamic views &#038; dynamic displays &#8211; jrnl",
            "date" : "2018-10-18 10:33:36",
            "date_gmt" : "2018-10-18 10:33:36"
         },
         "title" : "fast dynamic ...: [&#8230;] visual presentation and the speed and...",
         "id" : "comment/51"
      },
      "post/182" : {
         "id" : "post/182",
         "type" : "post",
         "title" : "Why Blogging Sucks?",
         "data" : {
            "mime_type" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-09-10 07:28:46",
            "content_filtered" : "",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=182",
            "html" : "First things first. Blogging doesn't suck.\n\nIt just still does not shine with the light it can, given some proper data are added to our words. It does not breath enough connected data space. And I totally agree with <a href=\"https://jrnl.global/2018/09/03/what-sucks-about-blogging-2/\" target=\"_blank\" rel=\"noopener\">Stephan Kreutzer's write-up</a> that blogging isn't \"hypertexty enough.\"\n\nIn my world, I would call that same concept - webby, or better: <em>semantic webby</em>.\n\nWhat would really augment my experience as a writer and a reader, is the ability of the system I write within to:\n<ul>\n \t<li>Consolidate dynamic content</li>\n \t<li>Assign unique identifiers for things, people and all other conceivable entities</li>\n \t<li>Allow the creation of semantic networks that will add to the <a href=\"https://web.archive.org/web/20160713021037/http://dig.csail.mit.edu/breadcrumbs/node/215\" target=\"_blank\" rel=\"noopener\">Giant Global Graph</a>, as described by Tim Berner-Lee</li>\n \t<li>Create semantic metadata</li>\n \t<li>Interact with users that have universal ID (the kind of a WebId, which doesn't scatter their digital footprint across platforms, but concentrates it it one unique identifier)</li>\n \t<li>Read and write comments that are universal across all platforms</li>\n</ul>\nAll of the above would follow if Linked Data is put to good use not only for libraries (<a href=\"http://www.mynewsdesk.com/se/kungliga_biblioteket/pressreleases/kb-becomes-the-first-national-library-to-fully-transition-to-linked-data-2573975\" target=\"_blank\" rel=\"noopener\">see KB becomes the first national library to fully transition to linked data</a> ) and enterprises (see <a href=\"https://www.w3.org/2001/sw/sweo/public/UseCases/BBC/\" target=\"_blank\" rel=\"noopener\">BBC: The Web as a CMS</a>), but also for personal blogging. Such attempts are already being made with the projects Solid (ref. https://gitter.im/solid/chat) and Dokieli.\n\nBoth aim to bring the power of typed link (or, the power of code and RDF and hopefully conceptual graphs) to work to enhance our interaction and collaboration online. Blogging very much included.\n\nFeatured image source: https://pixabay.com/en/network-networking-rope-connection-1246209/",
            "modified" : "2018-09-10 07:28:46",
            "name" : "why-blogging-sucks-2",
            "date_gmt" : "2018-09-10 07:28:46",
            "date" : "2018-09-10 07:28:46"
         }
      },
      "post/233" : {
         "id" : "post/233",
         "type" : "post",
         "data" : {
            "comment_count" : null,
            "modified_gmt" : "2018-09-15 09:52:44",
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=233",
            "excerpt" : "",
            "modified" : "2018-09-15 09:52:44",
            "name" : "addressing-draft-of-fot-doug50-introduction",
            "html" : "I missed the 1968 demo since I was only 6 months old at the time.\n<h1>pointing</h1>\nHowever, as I now see in my beautiful baby boy Edgar, I was already way on my way to working on one of the most fundamental aspects of human-world-interaction: Pointing.\n\nAs I see in my beautiful baby boy Edgar, it doesn’t take long after entering this world to start to look at things and then to point at them as a means of establishing a link to what ones attention is focused on.\n\nThis is natural, this arises out of our evolution. We are not separate from our environment, we are intrinsically tied to our environment.\n\nEdgar points to what he finds interesting, he points to where he wants to go. His instinctive pointing was not learnt, it was his early means to interact with that which was outside his immediate grasp.\n\nThis is fundamental. This is crucial. As we as a species we are moving into working and living more in the digital realm we need to provide the means to point.\n<h1>addressability</h1>\nAnd to point, what we point at must exist in some location, somewhere addressable.\n\nEverything hinges on this.\n\nEverything is made more powerful through more power pointing, or constrained by limited pointing.\n\nYou can’t even open a document if you cannot point to it. That’s the most basic interaction in our modern graphical user interface world. Let’s take that up a notch. And back a step. When Edgar is a bit older I expect we will experience an argument with him where his justification for something will be “because that’s what she said”. Yes, I expect he will start using citations!\n\nThe citation in this case having only the most tenuous link to the source; he simply asserts and points to a source. A source which may very much deny what was asserted and the source may very well be unavailable.\n<h1>analog citing</h1>\nWhen I was young I was taught to cite by referring to a book, since books were authored and therefore authoritative of course. The way I would link what I was quoting was through meticulously listing what book I was referring to, in other words the author, title, year of publication and edition and perhaps the publisher and so on. I would then note the page number so that my teacher or whoever else might read my paper would be able to check the citation, by going to the library, finding the right section for the book, then the book itself and then by opening it to the said page and finding the text I was referring to.\n\nOf course this did not happen all that much–books cited were either books assigned by the teacher and if I cited something my teacher had not read the chances she would actually look up the citation was minimal. This was a dirty secret of academia but now that we live in a world of links it’s super-quick and easy to check on citations right?\n<h1>digital citing</h1>\nYes. If the link is to an open web page, that is to say not behind a pay wall and the link is still active. And even then, it will only open the document, it will not allow you to point to a specific section as you could with a paper book where you could point to a page number. If someone has explicitly taken the effort to add a pointing target to the point where you needed it, called an anchor tag, you could, if you know how to find the anchor tag, link to the specific section of the document.\n\nHowever, if you wanted to refer to a specific page or section in a digital book you had purchased on your Kindle or in the iBooks Store you would be out of luck. The means through which Amazon and Apple address content in ‘their’ books is proprietary and we have no means of accessing it. We have no way to point to it.\n\nIf you want to point to a section in a PDF, well, that’s just pure fantasy at this point.\n\nI would say exacerbates that dirty little secret of academia. If an academic writes a citation to something you are already read you can evaluate its relevance and veracity. If it’s to something new, a book or a PDF you have not read, all the king's horses and all the king's men cannot put the link back together again. The link is lost, not much more useful than a toddler asserting that “he said, she said”.\n\nThe same goes for inter-system communications. If you don’t know what you are pointing at then you are just waving your arms around in the dark.\n<h1>deeper</h1>\nIt goes deep.\n\nSome say that the most fundamental aspect of reality is stuff, others say it’s information. I say it’s interaction since without interaction there is no information. Information is a description of something in terms of something else. Always.\n\nThink of a little particle in ‘space’. Until it bumps into or comes into meaningful vicinity with another particle we have no way of consider whether it’s dark or light, heavy or light, hot or cold, fast or slow. Only the interaction between the particles produces that. Information arises out of interaction.\n\nI said in the introduction that everything hinges on this. Everything hinges on addressability. The term ‘hinges’ was not chosen at random.\n\nLet’s look at a network. We have nodes and connections. If we loose the connections we loose a lot of meaning. If we loose the nodes however, we still have the network. The etymology of the word ‘node’ is enlightening here: It has the same origin as the word ‘knot’. In the same way that knots exist because of the interaction of a connection, the string, a node is relevant and useful because of the connections it is part of.\n<h1>addressability enables pointing and interaction</h1>\nEverything hinges on addressability.\n\nWithout local addressability we cannot open a file, we can not move a word around the screen.\n\nWithout wide addressability we cannot reliably refer to each others work, each others thoughts. We cannot move around in our information. We cannot even annotate without being able to somehow point to what we are annotating and if we can, how great would it be to search only one’s annotations across any corpus of knowledge and to string citations along with them?\n\nAnd as with our fingers pointing around in the room, the higher degree of flexibility and finesse we have, the more power we have in our interactions.\n\nDoug Engelbart wanted high resolution linking. This can be made possible through high resolution addressability. He proposed evolution within how we view our knowledge, through the employment of powerfully flexible view specifications or viewSpecs. This can only be made possible where the user can refer to what should be shown and where.\n\nThere is much more. So much more more than what I can address in this introduction.\n<h1>session explorations</h1>\nIn this session we will explore aspects of addressability and aspects of how we can view our information.\n\nWe have evolved powerful visual systems and nimble hands. How can we build systems to better use these two aspects of our physiology?\n\nWe are entering an age of AI, Artificial Intelligence, but Doug was more interested in IA, Intelligence Amplification.\n\nAre we willing to surrender our knowledge work blindly to artificial intelligence constructs entirely or are we also going to fight for system to enable us to develop ever deeper literacies where we employ our own intelligence and use what four billion years of evolution has given us to interact with our external environment; our hands and our eyes?\n\nI am not disparaging AI, let’s not get side tracked on that.\n\nI am asking, how can we build environments where we can move around freely and employ all kinds of fundamental and advanced tools?\n\nWho do we want homo sapiens to become? Interactive man or passive man?\n\n&nbsp;",
            "date_gmt" : "2018-09-15 09:52:44",
            "date" : "2018-09-15 09:52:44"
         },
         "title" : "draft of FoT 'Addressing & ViewSpecs' Session at Doug@50 Introduction"
      },
      "term/51" : {
         "id" : "term/51",
         "type" : "post_tag",
         "data" : {
            "count" : "1",
            "slug" : "bar",
            "description" : ""
         },
         "title" : "bar"
      },
      "post/335" : {
         "type" : "post",
         "title" : "Future Linking",
         "data" : {
            "date" : "2018-10-09 11:08:29",
            "date_gmt" : "2018-10-09 11:08:29",
            "html" : "Links which do not point to anything which currently exists but which is expected to come into existence, such as a future version of a document or dialog about the document.",
            "modified" : "2018-10-09 11:08:29",
            "name" : "future-linking",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?p=335",
            "mime_type" : "",
            "content_filtered" : "",
            "comment_count" : null,
            "modified_gmt" : "2018-10-09 11:08:29"
         },
         "id" : "post/335"
      },
      "post/396" : {
         "id" : "post/396",
         "title" : "Journal",
         "data" : {
            "date" : "2018-10-19 11:27:24",
            "date_gmt" : "2018-10-19 11:27:24",
            "html" : "",
            "modified" : "2018-10-19 11:27:24",
            "name" : "journal",
            "excerpt" : "",
            "guid" : "https://jrnl.global/?page_id=396",
            "mime_type" : "",
            "modified_gmt" : "2018-10-19 11:27:24",
            "comment_count" : null,
            "content_filtered" : ""
         },
         "type" : "page"
      },
      "comment/15" : {
         "type" : "comment",
         "title" : "What Sucks ab...: [&#8230;] Stephan mentioned that a TimeBrowser ...",
         "data" : {
            "date" : "2018-08-25 14:53:58",
            "date_gmt" : "2018-08-25 14:53:58",
            "creator_name" : "What Sucks about Blogging &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/08/25/what-sucks-about-blogging/",
            "html" : "[&#8230;] Stephan mentioned that a TimeBrowser feature would be useful. I agree, it should be another possible view. [&#8230;]"
         },
         "id" : "comment/15"
      },
      "term/52" : {
         "title" : "baz",
         "data" : {
            "count" : "1",
            "description" : "",
            "slug" : "baz"
         },
         "type" : "post_tag",
         "id" : "term/52"
      },
      "comment/36" : {
         "type" : "comment",
         "data" : {
            "html" : "[&#8230;] interaction means for doing the above, both keyboard shortcut list and the ‘blue dot’ mouse [&#8230;]",
            "date" : "2018-09-11 13:36:21",
            "date_gmt" : "2018-09-11 13:36:21",
            "creator_url" : "https://jrnl.global/2018/09/10/component-overview/",
            "creator_name" : "Component overview &#8211; jrnl"
         },
         "title" : "Component ove...: [&#8230;] interaction means for doing the above...",
         "id" : "comment/36"
      },
      "post/35" : {
         "id" : "post/35",
         "type" : "post",
         "data" : {
            "modified" : "2018-08-21 17:20:29",
            "name" : "stephan-kreutzer",
            "html" : "<p style=\"text-align:justify\">I maintain an updated profile on my <a href=\"https://skreutzer.de/about.html\">about page</a>. It’s still only available in German language, but the collection of links there lead to my other online presences and projects. In the context of this effort, I also describe most of my earlier and current work in <a href=\"https://skreutzer.de/2018/03/09/my-journey-through-text/\">this article</a>. My <a href=\"https://skreutzer.de/category/hypertext/\">contributions to this initiative</a> usually won’t reside on this site as I’m able to build and run my own hypertext systems that hopefully will compose material from different sources into a virtual space or combined rendering, something like that. Furthermore, I do my things in the context of the <a href=\"http://publishing-systems.org\">publishing-systems.org</a> site (despite being seriously outdated) and hope to develop <a href=\"http://hypertext-systems.org\">hypertext-systems.org</a> as a complement, the former for automated conversion workflows for single-source, multi-channel publishing (working with legacy, bookish-style material) and the latter for more hypertexty approaches.</p>\n\n<p style=\"text-align: justify\">Copyright (C) 2018 Stephan Kreutzer. This text is licensed under the <a href=\"https://www.gnu.org/licenses/agpl-3.0.html\">GNU Affero General Public License 3 + any later version</a> and/or under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\">Creative Commons Attribution-ShareAlike 4.0 International</a>.</p>",
            "date_gmt" : "2018-08-21 17:20:29",
            "date" : "2018-08-21 17:20:29",
            "modified_gmt" : "2018-08-21 17:20:29",
            "comment_count" : null,
            "content_filtered" : "",
            "mime_type" : "",
            "guid" : "https://jrnl.global/?p=35",
            "excerpt" : ""
         },
         "title" : "Stephan Kreutzer"
      },
      "comment/47" : {
         "title" : "Sketch first ...: [&#8230;] This is an experiment to see if it is...",
         "data" : {
            "creator_name" : "Sketch first Sprint work breakdown structure &#8211; jrnl",
            "creator_url" : "https://jrnl.global/2018/10/08/sketch-first-sprint-work-breakdown-structure/",
            "date" : "2018-10-08 15:31:37",
            "date_gmt" : "2018-10-08 15:31:37",
            "html" : "[&#8230;] This is an experiment to see if it is possible to manually publish to word press from the MindGraph plain HTML.   Then experiment with HRSHTML 9th December, my Priorities – jrnl [&#8230;]"
         },
         "type" : "comment",
         "id" : "comment/47"
      },
      "term/27" : {
         "title" : "bootstrapping",
         "data" : {
            "count" : "1",
            "slug" : "bootstrapping",
            "description" : ""
         },
         "type" : "post_tag",
         "id" : "term/27"
      },
      "term/12" : {
         "title" : "Perspective",
         "data" : {
            "count" : "12",
            "slug" : "perspective",
            "description" : ""
         },
         "type" : "category",
         "id" : "term/12"
      },
      "term/45" : {
         "title" : "views",
         "data" : {
            "slug" : "views",
            "description" : "",
            "count" : "2"
         },
         "type" : "post_tag",
         "id" : "term/45"
      }
   },
   "links" : [
      {
         "subject" : "post/1",
         "object" : "user/1",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/2",
         "object" : "user/1"
      },
      {
         "type" : "creator",
         "subject" : "post/5",
         "object" : "user/1"
      },
      {
         "subject" : "post/7",
         "object" : "user/1",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/26"
      },
      {
         "object" : "user/4",
         "subject" : "post/33",
         "type" : "creator"
      },
      {
         "object" : "user/4",
         "subject" : "post/35",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/42",
         "object" : "user/2"
      },
      {
         "subject" : "post/45",
         "object" : "user/5",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/4",
         "subject" : "post/49"
      },
      {
         "object" : "user/4",
         "subject" : "post/51",
         "type" : "creator"
      },
      {
         "object" : "user/2",
         "subject" : "post/57",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/60"
      },
      {
         "type" : "creator",
         "subject" : "post/66",
         "object" : "user/4"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/75"
      },
      {
         "subject" : "post/88",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "object" : "user/4",
         "subject" : "post/103",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/107"
      },
      {
         "type" : "creator",
         "object" : "user/4",
         "subject" : "post/113"
      },
      {
         "object" : "user/2",
         "subject" : "post/117",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/6",
         "subject" : "post/131"
      },
      {
         "object" : "user/2",
         "subject" : "post/148",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/150"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/152"
      },
      {
         "type" : "creator",
         "subject" : "post/155",
         "object" : "user/2"
      },
      {
         "type" : "creator",
         "subject" : "post/158",
         "object" : "user/2"
      },
      {
         "subject" : "post/162",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "subject" : "post/165",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "subject" : "post/173",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/177"
      },
      {
         "type" : "creator",
         "object" : "user/5",
         "subject" : "post/182"
      },
      {
         "type" : "creator",
         "subject" : "post/189",
         "object" : "user/2"
      },
      {
         "type" : "creator",
         "subject" : "post/198",
         "object" : "user/2"
      },
      {
         "object" : "user/2",
         "subject" : "post/204",
         "type" : "creator"
      },
      {
         "subject" : "post/211",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/217",
         "object" : "user/2"
      },
      {
         "type" : "creator",
         "subject" : "post/233",
         "object" : "user/2"
      },
      {
         "object" : "user/2",
         "subject" : "post/244",
         "type" : "creator"
      },
      {
         "subject" : "post/246",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/254",
         "object" : "user/2"
      },
      {
         "object" : "user/2",
         "subject" : "post/257",
         "type" : "creator"
      },
      {
         "subject" : "post/263",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "object" : "user/2",
         "subject" : "post/272",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/290"
      },
      {
         "subject" : "post/292",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "object" : "user/2",
         "subject" : "post/298",
         "type" : "creator"
      },
      {
         "object" : "user/6",
         "subject" : "post/303",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/6",
         "subject" : "post/317"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/320"
      },
      {
         "subject" : "post/328",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/333",
         "object" : "user/2"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/335"
      },
      {
         "subject" : "post/343",
         "object" : "user/9",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/349",
         "object" : "user/2"
      },
      {
         "subject" : "post/353",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "object" : "user/9",
         "subject" : "post/364",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/366",
         "object" : "user/2"
      },
      {
         "subject" : "post/372",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "post/382"
      },
      {
         "subject" : "post/387",
         "object" : "user/2",
         "type" : "creator"
      },
      {
         "type" : "creator",
         "subject" : "post/389",
         "object" : "user/2"
      },
      {
         "object" : "user/2",
         "subject" : "post/390",
         "type" : "creator"
      },
      {
         "object" : "user/2",
         "subject" : "post/396",
         "type" : "creator"
      },
      {
         "object" : "user/7",
         "subject" : "post/407",
         "type" : "creator"
      },
      {
         "subject" : "comment/1",
         "object" : "post/1",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/2",
         "object" : "post/7"
      },
      {
         "type" : "creator",
         "subject" : "comment/2",
         "object" : "user/1"
      },
      {
         "subject" : "comment/3",
         "object" : "post/389",
         "type" : "comments"
      },
      {
         "object" : "post/26",
         "subject" : "comment/6",
         "type" : "comments"
      },
      {
         "object" : "user/5",
         "subject" : "comment/6",
         "type" : "creator"
      },
      {
         "object" : "post/26",
         "subject" : "comment/7",
         "type" : "comments"
      },
      {
         "subject" : "comment/8",
         "object" : "post/26",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/9",
         "object" : "post/26"
      },
      {
         "object" : "post/26",
         "subject" : "comment/10",
         "type" : "comments"
      },
      {
         "object" : "post/33",
         "subject" : "comment/11",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "object" : "post/33",
         "subject" : "comment/12"
      },
      {
         "type" : "comments",
         "object" : "post/33",
         "subject" : "comment/13"
      },
      {
         "type" : "creator",
         "subject" : "comment/13",
         "object" : "user/4"
      },
      {
         "object" : "user/4",
         "subject" : "comment/13",
         "type" : "comments"
      },
      {
         "subject" : "comment/14",
         "object" : "post/33",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "object" : "user/4",
         "subject" : "comment/14"
      },
      {
         "type" : "comments",
         "object" : "user/4",
         "subject" : "comment/14"
      },
      {
         "type" : "comments",
         "object" : "post/35",
         "subject" : "comment/15"
      },
      {
         "type" : "comments",
         "object" : "post/35",
         "subject" : "comment/16"
      },
      {
         "object" : "post/42",
         "subject" : "comment/17",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "object" : "user/6",
         "subject" : "comment/17"
      },
      {
         "type" : "comments",
         "object" : "post/45",
         "subject" : "comment/18"
      },
      {
         "type" : "comments",
         "object" : "post/45",
         "subject" : "comment/19"
      },
      {
         "type" : "comments",
         "subject" : "comment/20",
         "object" : "post/60"
      },
      {
         "subject" : "comment/20",
         "object" : "user/4",
         "type" : "creator"
      },
      {
         "subject" : "comment/21",
         "object" : "post/60",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "subject" : "comment/21",
         "object" : "user/4"
      },
      {
         "subject" : "comment/22",
         "object" : "post/60",
         "type" : "comments"
      },
      {
         "object" : "user/4",
         "subject" : "comment/22",
         "type" : "creator"
      },
      {
         "object" : "post/60",
         "subject" : "comment/23",
         "type" : "comments"
      },
      {
         "subject" : "comment/23",
         "object" : "user/4",
         "type" : "creator"
      },
      {
         "type" : "comments",
         "subject" : "comment/24",
         "object" : "post/66"
      },
      {
         "object" : "post/103",
         "subject" : "comment/25",
         "type" : "comments"
      },
      {
         "subject" : "comment/26",
         "object" : "post/131",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/27",
         "object" : "post/131"
      },
      {
         "type" : "creator",
         "subject" : "comment/27",
         "object" : "user/2"
      },
      {
         "type" : "comments",
         "object" : "post/131",
         "subject" : "comment/28"
      },
      {
         "type" : "comments",
         "subject" : "comment/29",
         "object" : "post/148"
      },
      {
         "subject" : "comment/30",
         "object" : "post/165",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "object" : "user/4",
         "subject" : "comment/30"
      },
      {
         "type" : "comments",
         "subject" : "comment/31",
         "object" : "post/165"
      },
      {
         "object" : "user/2",
         "subject" : "comment/31",
         "type" : "creator"
      },
      {
         "type" : "comments",
         "object" : "user/2",
         "subject" : "comment/31"
      },
      {
         "type" : "comments",
         "subject" : "comment/32",
         "object" : "post/173"
      },
      {
         "object" : "post/173",
         "subject" : "comment/33",
         "type" : "comments"
      },
      {
         "object" : "post/173",
         "subject" : "comment/34",
         "type" : "comments"
      },
      {
         "object" : "post/177",
         "subject" : "comment/35",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "object" : "post/177",
         "subject" : "comment/36"
      },
      {
         "type" : "comments",
         "subject" : "comment/37",
         "object" : "post/177"
      },
      {
         "subject" : "comment/38",
         "object" : "post/182",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "object" : "user/2",
         "subject" : "comment/38"
      },
      {
         "type" : "comments",
         "subject" : "comment/39",
         "object" : "post/182"
      },
      {
         "subject" : "comment/40",
         "object" : "post/182",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "subject" : "comment/40",
         "object" : "user/5"
      },
      {
         "object" : "user/5",
         "subject" : "comment/40",
         "type" : "comments"
      },
      {
         "subject" : "comment/41",
         "object" : "post/182",
         "type" : "comments"
      },
      {
         "subject" : "comment/41",
         "object" : "user/5",
         "type" : "creator"
      },
      {
         "object" : "user/5",
         "subject" : "comment/41",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/42",
         "object" : "post/204"
      },
      {
         "subject" : "comment/43",
         "object" : "post/257",
         "type" : "comments"
      },
      {
         "object" : "post/263",
         "subject" : "comment/44",
         "type" : "comments"
      },
      {
         "object" : "post/272",
         "subject" : "comment/45",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "object" : "post/292",
         "subject" : "comment/46"
      },
      {
         "subject" : "comment/47",
         "object" : "post/292",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/48",
         "object" : "post/298"
      },
      {
         "subject" : "comment/49",
         "object" : "post/298",
         "type" : "comments"
      },
      {
         "type" : "comments",
         "subject" : "comment/50",
         "object" : "post/320"
      },
      {
         "object" : "post/333",
         "subject" : "comment/51",
         "type" : "comments"
      },
      {
         "object" : "post/366",
         "subject" : "comment/52",
         "type" : "comments"
      },
      {
         "object" : "post/366",
         "subject" : "comment/53",
         "type" : "comments"
      },
      {
         "subject" : "comment/54",
         "object" : "post/366",
         "type" : "comments"
      },
      {
         "type" : "creator",
         "subject" : "comment/54",
         "object" : "user/6"
      },
      {
         "object" : "post/382",
         "subject" : "comment/55",
         "type" : "comments"
      },
      {
         "type" : "broader",
         "object" : "term/6",
         "subject" : "term/7"
      },
      {
         "object" : "term/6",
         "subject" : "term/8",
         "type" : "broader"
      },
      {
         "type" : "broader",
         "object" : "term/6",
         "subject" : "term/9"
      },
      {
         "subject" : "term/13",
         "object" : "term/5",
         "type" : "broader"
      },
      {
         "type" : "broader",
         "object" : "term/6",
         "subject" : "term/15"
      },
      {
         "type" : "broader",
         "subject" : "term/16",
         "object" : "term/10"
      },
      {
         "object" : "term/6",
         "subject" : "term/20",
         "type" : "broader"
      },
      {
         "type" : "broader",
         "object" : "term/6",
         "subject" : "term/22"
      },
      {
         "object" : "term/6",
         "subject" : "term/23",
         "type" : "broader"
      },
      {
         "object" : "term/6",
         "subject" : "term/24",
         "type" : "broader"
      },
      {
         "type" : "broader",
         "object" : "term/5",
         "subject" : "term/25"
      },
      {
         "type" : "subject",
         "object" : "term/1",
         "subject" : "post/1"
      },
      {
         "type" : "subject",
         "object" : "term/1",
         "subject" : "post/7"
      },
      {
         "type" : "subject",
         "object" : "term/1",
         "subject" : "post/28"
      },
      {
         "subject" : "post/49",
         "object" : "term/1",
         "type" : "subject"
      },
      {
         "subject" : "post/51",
         "object" : "term/1",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/66",
         "object" : "term/1"
      },
      {
         "type" : "subject",
         "subject" : "post/157",
         "object" : "term/1"
      },
      {
         "subject" : "post/285",
         "object" : "term/1",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/1",
         "subject" : "post/288"
      },
      {
         "type" : "subject",
         "object" : "term/1",
         "subject" : "post/349"
      },
      {
         "subject" : "post/360",
         "object" : "term/1",
         "type" : "subject"
      },
      {
         "subject" : "post/364",
         "object" : "term/1",
         "type" : "subject"
      },
      {
         "object" : "term/2",
         "subject" : "post/148",
         "type" : "subject"
      },
      {
         "subject" : "post/150",
         "object" : "term/2",
         "type" : "subject"
      },
      {
         "subject" : "post/152",
         "object" : "term/2",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/155",
         "object" : "term/2"
      },
      {
         "type" : "subject",
         "object" : "term/2",
         "subject" : "post/335"
      },
      {
         "subject" : "post/158",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "subject" : "post/162",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/3",
         "subject" : "post/165"
      },
      {
         "subject" : "post/173",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/3",
         "subject" : "post/198"
      },
      {
         "type" : "subject",
         "object" : "term/3",
         "subject" : "post/204"
      },
      {
         "type" : "subject",
         "subject" : "post/211",
         "object" : "term/3"
      },
      {
         "type" : "subject",
         "object" : "term/3",
         "subject" : "post/233"
      },
      {
         "object" : "term/3",
         "subject" : "post/244",
         "type" : "subject"
      },
      {
         "object" : "term/3",
         "subject" : "post/257",
         "type" : "subject"
      },
      {
         "object" : "term/3",
         "subject" : "post/272",
         "type" : "subject"
      },
      {
         "subject" : "post/320",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "subject" : "post/353",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "object" : "term/3",
         "subject" : "post/366",
         "type" : "subject"
      },
      {
         "subject" : "post/387",
         "object" : "term/3",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/88",
         "object" : "term/4"
      },
      {
         "type" : "subject",
         "subject" : "post/406",
         "object" : "term/5"
      },
      {
         "object" : "term/7",
         "subject" : "post/150",
         "type" : "subject"
      },
      {
         "subject" : "post/189",
         "object" : "term/7",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/198",
         "object" : "term/7"
      },
      {
         "object" : "term/7",
         "subject" : "post/217",
         "type" : "subject"
      },
      {
         "subject" : "post/233",
         "object" : "term/7",
         "type" : "subject"
      },
      {
         "subject" : "post/254",
         "object" : "term/7",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/7",
         "subject" : "post/257"
      },
      {
         "type" : "subject",
         "object" : "term/7",
         "subject" : "post/272"
      },
      {
         "object" : "term/7",
         "subject" : "post/292",
         "type" : "subject"
      },
      {
         "subject" : "post/320",
         "object" : "term/7",
         "type" : "subject"
      },
      {
         "subject" : "post/333",
         "object" : "term/7",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/349",
         "object" : "term/7"
      },
      {
         "type" : "subject",
         "subject" : "post/382",
         "object" : "term/7"
      },
      {
         "object" : "term/8",
         "subject" : "post/189",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/8",
         "subject" : "post/204"
      },
      {
         "object" : "term/8",
         "subject" : "post/217",
         "type" : "subject"
      },
      {
         "subject" : "post/233",
         "object" : "term/8",
         "type" : "subject"
      },
      {
         "subject" : "post/244",
         "object" : "term/8",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/8",
         "subject" : "post/246"
      },
      {
         "object" : "term/8",
         "subject" : "post/257",
         "type" : "subject"
      },
      {
         "object" : "term/8",
         "subject" : "post/292",
         "type" : "subject"
      },
      {
         "object" : "term/8",
         "subject" : "post/320",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/333",
         "object" : "term/8"
      },
      {
         "object" : "term/8",
         "subject" : "post/382",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/155",
         "object" : "term/9"
      },
      {
         "object" : "term/9",
         "subject" : "post/177",
         "type" : "subject"
      },
      {
         "object" : "term/9",
         "subject" : "post/189",
         "type" : "subject"
      },
      {
         "object" : "term/9",
         "subject" : "post/217",
         "type" : "subject"
      },
      {
         "object" : "term/9",
         "subject" : "post/233",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/9",
         "subject" : "post/254"
      },
      {
         "type" : "subject",
         "object" : "term/9",
         "subject" : "post/257"
      },
      {
         "object" : "term/9",
         "subject" : "post/272",
         "type" : "subject"
      },
      {
         "object" : "term/9",
         "subject" : "post/349",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/60",
         "object" : "term/10"
      },
      {
         "type" : "subject",
         "subject" : "post/117",
         "object" : "term/10"
      },
      {
         "type" : "subject",
         "subject" : "post/298",
         "object" : "term/10"
      },
      {
         "subject" : "post/317",
         "object" : "term/10",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/320",
         "object" : "term/10"
      },
      {
         "object" : "term/10",
         "subject" : "post/328",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/10",
         "subject" : "post/343"
      },
      {
         "subject" : "post/366",
         "object" : "term/10",
         "type" : "subject"
      },
      {
         "subject" : "post/372",
         "object" : "term/10",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/11",
         "subject" : "post/26"
      },
      {
         "type" : "subject",
         "subject" : "post/42",
         "object" : "term/11"
      },
      {
         "subject" : "post/57",
         "object" : "term/11",
         "type" : "subject"
      },
      {
         "subject" : "post/272",
         "object" : "term/11",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/11",
         "subject" : "post/290"
      },
      {
         "type" : "subject",
         "subject" : "post/333",
         "object" : "term/11"
      },
      {
         "subject" : "post/349",
         "object" : "term/11",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/66"
      },
      {
         "type" : "subject",
         "subject" : "post/75",
         "object" : "term/12"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/103"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/131"
      },
      {
         "subject" : "post/158",
         "object" : "term/12",
         "type" : "subject"
      },
      {
         "object" : "term/12",
         "subject" : "post/162",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/182"
      },
      {
         "object" : "term/12",
         "subject" : "post/198",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/211"
      },
      {
         "type" : "subject",
         "subject" : "post/320",
         "object" : "term/12"
      },
      {
         "subject" : "post/353",
         "object" : "term/12",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/12",
         "subject" : "post/366"
      },
      {
         "type" : "subject",
         "subject" : "post/117",
         "object" : "term/14"
      },
      {
         "type" : "subject",
         "subject" : "post/263",
         "object" : "term/14"
      },
      {
         "subject" : "post/272",
         "object" : "term/14",
         "type" : "subject"
      },
      {
         "object" : "term/14",
         "subject" : "post/292",
         "type" : "subject"
      },
      {
         "subject" : "post/320",
         "object" : "term/14",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/333",
         "object" : "term/14"
      },
      {
         "type" : "subject",
         "object" : "term/15",
         "subject" : "post/158"
      },
      {
         "subject" : "post/162",
         "object" : "term/15",
         "type" : "subject"
      },
      {
         "subject" : "post/198",
         "object" : "term/15",
         "type" : "subject"
      },
      {
         "object" : "term/15",
         "subject" : "post/217",
         "type" : "subject"
      },
      {
         "object" : "term/15",
         "subject" : "post/320",
         "type" : "subject"
      },
      {
         "object" : "term/15",
         "subject" : "post/382",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/387",
         "object" : "term/15"
      },
      {
         "type" : "subject",
         "subject" : "post/60",
         "object" : "term/16"
      },
      {
         "type" : "subject",
         "subject" : "post/117",
         "object" : "term/16"
      },
      {
         "subject" : "post/328",
         "object" : "term/16",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/17",
         "subject" : "post/107"
      },
      {
         "type" : "subject",
         "object" : "term/18",
         "subject" : "post/33"
      },
      {
         "type" : "subject",
         "object" : "term/18",
         "subject" : "post/113"
      },
      {
         "subject" : "post/165",
         "object" : "term/18",
         "type" : "subject"
      },
      {
         "subject" : "post/35",
         "object" : "term/19",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/19",
         "subject" : "post/45"
      },
      {
         "object" : "term/19",
         "subject" : "post/303",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/19",
         "subject" : "post/389"
      },
      {
         "object" : "term/19",
         "subject" : "post/407",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/152",
         "object" : "term/20"
      },
      {
         "object" : "term/20",
         "subject" : "post/165",
         "type" : "subject"
      },
      {
         "subject" : "post/173",
         "object" : "term/20",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/20",
         "subject" : "post/177"
      },
      {
         "type" : "subject",
         "object" : "term/20",
         "subject" : "post/189"
      },
      {
         "object" : "term/20",
         "subject" : "post/217",
         "type" : "subject"
      },
      {
         "object" : "term/20",
         "subject" : "post/233",
         "type" : "subject"
      },
      {
         "object" : "term/20",
         "subject" : "post/292",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/20",
         "subject" : "post/349"
      },
      {
         "type" : "subject",
         "object" : "term/20",
         "subject" : "post/366"
      },
      {
         "type" : "subject",
         "object" : "term/20",
         "subject" : "post/387"
      },
      {
         "type" : "subject",
         "subject" : "post/198",
         "object" : "term/23"
      },
      {
         "subject" : "post/217",
         "object" : "term/23",
         "type" : "subject"
      },
      {
         "subject" : "post/382",
         "object" : "term/23",
         "type" : "subject"
      },
      {
         "subject" : "post/387",
         "object" : "term/23",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/406",
         "object" : "term/25"
      },
      {
         "object" : "term/26",
         "subject" : "post/254",
         "type" : "subject"
      },
      {
         "object" : "term/27",
         "subject" : "post/88",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/162",
         "object" : "term/28"
      },
      {
         "subject" : "post/211",
         "object" : "term/29",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/30",
         "subject" : "post/165"
      },
      {
         "type" : "subject",
         "subject" : "post/211",
         "object" : "term/31"
      },
      {
         "type" : "subject",
         "subject" : "post/150",
         "object" : "term/32"
      },
      {
         "type" : "subject",
         "subject" : "post/152",
         "object" : "term/32"
      },
      {
         "type" : "subject",
         "object" : "term/32",
         "subject" : "post/155"
      },
      {
         "subject" : "post/366",
         "object" : "term/32",
         "type" : "subject"
      },
      {
         "subject" : "post/75",
         "object" : "term/33",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/33",
         "subject" : "post/233"
      },
      {
         "type" : "subject",
         "subject" : "post/88",
         "object" : "term/34"
      },
      {
         "object" : "term/34",
         "subject" : "post/182",
         "type" : "subject"
      },
      {
         "object" : "term/35",
         "subject" : "post/75",
         "type" : "subject"
      },
      {
         "subject" : "post/233",
         "object" : "term/36",
         "type" : "subject"
      },
      {
         "object" : "term/37",
         "subject" : "post/177",
         "type" : "subject"
      },
      {
         "object" : "term/38",
         "subject" : "post/75",
         "type" : "subject"
      },
      {
         "object" : "term/39",
         "subject" : "post/75",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/40",
         "subject" : "post/162"
      },
      {
         "subject" : "post/57",
         "object" : "term/41",
         "type" : "subject"
      },
      {
         "subject" : "post/60",
         "object" : "term/41",
         "type" : "subject"
      },
      {
         "object" : "term/42",
         "subject" : "post/162",
         "type" : "subject"
      },
      {
         "subject" : "post/182",
         "object" : "term/42",
         "type" : "subject"
      },
      {
         "subject" : "post/162",
         "object" : "term/44",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/75",
         "object" : "term/45"
      },
      {
         "type" : "subject",
         "object" : "term/45",
         "subject" : "post/211"
      },
      {
         "type" : "subject",
         "subject" : "post/211",
         "object" : "term/46"
      },
      {
         "type" : "subject",
         "subject" : "post/173",
         "object" : "term/47"
      },
      {
         "type" : "subject",
         "object" : "term/48",
         "subject" : "post/274"
      },
      {
         "subject" : "post/275",
         "object" : "term/48",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/276",
         "object" : "term/48"
      },
      {
         "object" : "term/48",
         "subject" : "post/277",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "object" : "term/48",
         "subject" : "post/278"
      },
      {
         "type" : "subject",
         "object" : "term/48",
         "subject" : "post/279"
      },
      {
         "subject" : "post/280",
         "object" : "term/48",
         "type" : "subject"
      },
      {
         "subject" : "post/397",
         "object" : "term/48",
         "type" : "subject"
      },
      {
         "type" : "subject",
         "subject" : "post/408",
         "object" : "term/48"
      },
      {
         "type" : "subject",
         "subject" : "post/158",
         "object" : "term/49"
      },
      {
         "type" : "subject",
         "object" : "term/50",
         "subject" : "post/382"
      },
      {
         "type" : "subject",
         "object" : "term/51",
         "subject" : "post/382"
      },
      {
         "type" : "subject",
         "object" : "term/52",
         "subject" : "post/382"
      }
   ]
}
